[
  {
    "question": "The induced drag of an aeroplane",
    "feedback": "decreases with increasing airspeed."
  },
  {
    "question": "The optimum speed for maximum Specific Range (SR) for a propeller-driven aeroplane is minimum....",
    "feedback": "drag speed VMD"
  },
  {
    "question": "A jet aeroplane is performing a maximum range flight.\nThe speed corresponds to:",
    "feedback": "the point of contact of the tangent from the origin to the Drag versus TAS curve."
  },
  {
    "question": "Given:\nRunway 23 leftW/V 0505KTOAT -2°CQNH 985 hPaAnti-ice ONPacks OFFWeather: Fog\nUsing the table provided, determine the RTOM for an aircraft that uses the quick lineup technique given the above conditions without interpolation:(do not interpolate, always choose the most conservative figures)",
    "feedback": "76980 kg"
  },
  {
    "question": "The thrust of a jet engine at constant RPM",
    "feedback": "increases in proportion to the airspeed."
  },
  {
    "question": "Which of the following is the most limiting situation on landing?",
    "feedback": "downslope with tailwind"
  },
  {
    "question": "(For this question use Performance Manual SEP1 Figure 2.4 ) With regard to the graph for landing performance, what is the minimum headwind component required in order to land at Helgoland airport (non EASA AIR OPS)? Given: Runway length: 1300 ft Runway elevation: MSL Weather: assume ISA conditions Mass: 3200 lbs Obstacle height: 50 ft",
    "feedback": "10 kt."
  },
  {
    "question": "Which of the following represents the minimum for V1?",
    "feedback": "VMCG"
  },
  {
    "question": "Referring to the figure, find the time taken (I), the fuel used (II) and distance travelled (III) to stabilising height for an aircraft that experiences an engine failure at 40000 ft with an all-up weight at the point of failure of 35000 lbs.",
    "feedback": "(I) 34 minutes, (II) 795 lbs, (III) 155 NM"
  },
  {
    "question": "(for this question use Performance Manual SEP1, Figure 2.3)\nDetermine the rate of climb by using the following information:\nPower setting: Full throttle (2700 RPM)Mass: 3400 lbPressure Altitude: 10000 ft (ISA conditions)",
    "feedback": "720 ft/min"
  },
  {
    "question": "Considering drift down requirement which one of the statements are correct?",
    "feedback": "Service ceiling at alternate airport must be at least 1500 AGL"
  },
  {
    "question": "Considering max range vs headwind :",
    "feedback": "higher speed for obtaining max range"
  },
  {
    "question": "Two identical turbojet aeroplane (whose specific fuel consumptions are considered to be equal) are at holding speed at the same altitude.\nThe mass of the first aircraft is 130 000 kg and its hourly fuel consumption is 4300 kg/h. The mass of the second aircraft is 115 000 kg and its hourly fuel consumption is:",
    "feedback": "3804 kg/h."
  },
  {
    "question": "(For this Question use Performance Manual MRJT1 Fig.4.28)\nWhat is the minimum field length required for the worst wind situation, landing a twin jet aeroplane with the anti-skid inoperative?\nElevation: 2000 ft\nQNH: 1013 hPa\nLanding mass: 50 000 kg\nFlaps: as required for minimum landing distance\nRunway condition: dry\nWind: \nMaximum allowable tailwind: 15 kt\nMaximum allowable headwind: 50 kt",
    "feedback": "3100 m."
  },
  {
    "question": "Define the term \"screen height\":",
    "feedback": "The height at the end of the take-off distance required and at the beginning of the landing distance required"
  },
  {
    "question": "If the actual landing mass is higher than planned:",
    "feedback": "the landing distance will be longer"
  },
  {
    "question": "Which of the following three speeds of a jet aeroplane are basically identical?\nThe speeds for:",
    "feedback": "holding, maximum climb angle and minimum glide angle."
  },
  {
    "question": "During a glide at constant Mach number, the pitch angle of the aeroplane will:",
    "feedback": "decrease."
  },
  {
    "question": "The angle of climb with flaps extended, compared to that with flaps retracted, will normally be:",
    "feedback": "Smaller."
  },
  {
    "question": "According to the obstacle  requirements the take-off path may by curved, but bank angle must not exceed",
    "feedback": "15°"
  },
  {
    "question": "From the screen height of 50 ft, a single-engined piston aeroplane performs a straight-out climb in visual meteorological conditions with a rate of climb of 500 ft/min and a TAS of 110 kt. The wind is calm. What will be the expected height clearance of a crane at is 9 m high above the ground and positioned at a distance of 372 m on the extended runway centre line from the reference zero point?",
    "feedback": "22.94 m"
  },
  {
    "question": "According to Part CAT, the correct statement regarding the declared runway distances is that ......",
    "feedback": "they do not account for runway line-up, and are usually adjusted in case of a 90° entry or 180° turnaround"
  },
  {
    "question": "For a Class A aircraft, following an engine failure during take-off, what is the net take-off flight path?",
    "feedback": "It is the actual flight path reduced by a safety margin"
  },
  {
    "question": "Which force compensates the weight in unaccelerated straight and level flight ?",
    "feedback": "the lift"
  },
  {
    "question": "Refer to the graph\nGiven:\nClimb power: Full throttleFlaps: UpTemperature: ISA + 15°CQNH: 1013 hPaWeight: 2950 lbsAirspeed: 120 kts KIASGear: retracted Wind: 10 kts headwind\nFind the approximate rate of climb for a flight at an altitude of 12000 ft:",
    "feedback": "1160 ft/min"
  },
  {
    "question": "(For this Question use Performance Manual SEP1 Fig. 2.4)\nPlanning a flight in a single engine aeroplane. With regard to the landing chart determine the landing distance required at your planned destination aerodrome.\nGiven :\nOAT: ISA Pressure Altitude: 1000 ft Aeroplane Mass: 3500 lbs Tailwind component: 5 kt Flaps: Landing position (down)  Runway: Tarred and wetRunway Slope: 2% upslope",
    "feedback": "2880 ft"
  },
  {
    "question": "An aircraft has two certified landing flaps positions, 25° and 35°. If a pilot chooses 35° instead of 25°, the aircraft will have:",
    "feedback": "a reduced landing distance and degraded go-around performance"
  },
  {
    "question": "Refer to CAP 698, Fig. 4-23\nGiven the information provided below, the pilot of a jet-engine aircraft must determine which of the following en-route alternate airports are the most appropriate diversion airports in case of an engine failure during the cruise phase.\nTemperature: ISA +10°C or belowAnti-Ice: Engine anti-ice onAircraft cruise mass: 43000 kg\nRequired airport altitude for:Airport 1: 21000 ftAirport 2: 23000 ftAirport 3: 24500 ftAirport 4: 19500 ft",
    "feedback": "1, 4"
  },
  {
    "question": "Which data can be extracted from the Buffet Onset Boundary Chart?",
    "feedback": "The values of the Mach number at which low speed and Mach buffet occur at various masses and altitudes."
  },
  {
    "question": "Field length is balanced when",
    "feedback": "take-off distance equals accelerate-stop distance."
  },
  {
    "question": "CS 25.121 (d)(1) § (i) to (iv) state the pre-requisite conditions for an aeroplane, during certification, demonstrating its one-engine inoperative gradient of climb in the approach phase.\nWhich of the following options states the correct description of one of these prerequisites?",
    "feedback": "The landing gear is retracted"
  },
  {
    "question": "During the certification flight testing of a twin engine turbojet aeroplane, the real take-off distances are equal to:\n- 1547 m with all engines running\n- 1720 m with failure of critical engine at V1, with all other things remaining unchanged.\nThe take-off distance adopted for the certification file is:",
    "feedback": "1779 m."
  },
  {
    "question": "A turbojet is flying at a constant IAS and pressure altitude. Given that a ± 1° C of ISA deviation results in a change in fuel flow of ± 0.2 %, determine how much the specific fuel consumption would change if the OAT is ISA - 10° C rather than ISA:",
    "feedback": "2 % decrease in SFC"
  },
  {
    "question": "At what altitude would a propeller aircraft reach its maximum endurance?",
    "feedback": "A piston engine at sea level"
  },
  {
    "question": "Given: VS= Stalling speed VMCA= Air minimum control speed  VMU= Minimum unstick speed (disregarding engine failure) V1= take-off decision speed VR= Rotation speed V2 min.= Minimum take-off safety speed VLOF: Lift-off speed  The correct formula is:",
    "feedback": "VS< VMCA< V2 min"
  },
  {
    "question": "(for this question use Performance Manual MRJT1, Fig. 4.4)\nFor a twin engine turbojet aeroplane two take-off flap settings (5° and 15°) are certified. Using the chart, what is the maximum allowed take-off mass, given the following conditions:\nAirport Pressure Altitude: 7000 ftOutside Air Temperature (OAT): -10°CField length available: 2400 mWind: CalmRunway slope: LevelPMC: OnA/C: Auto",
    "feedback": "56000 kg"
  },
  {
    "question": "The Density Altitude",
    "feedback": "is used to determine the aeroplane performance."
  },
  {
    "question": "Which statement with respect to the stepped climb is correct?",
    "feedback": "Performing a stepped climb based on economy can be limited by the 1.3-g buffet onset requirements"
  },
  {
    "question": "Higher gross mass at the same altitude decreases the gradient and the rate of climb whereas",
    "feedback": "VY and VX are increased."
  },
  {
    "question": "With a jet aeroplane the maximum climb angle can be flown at approximately:",
    "feedback": "the maximum CL/CD ratio."
  },
  {
    "question": "The rate of climb is approximately equal to:",
    "feedback": "the still-air gradient multiplied by the TAS"
  },
  {
    "question": "(for this question use Performance Manual MRJT1, Fig. 4.25)\nGiven the following information and assuming a drift down after engine failure, what is the time travelled, ground distance travelled,  and fuel burned from the point of engine failure?\nDrift down from pressure altitude: 33000 ftDrift down to pressure altitude: 16000 ftGross Mass at engine failure: 58050 kgOAT: ISA -20°CTailwind: 25 KTBleed configuration: Engine anti-ice on A/C Auto (High)",
    "feedback": "31 min, 182 NM, 1150 kg"
  },
  {
    "question": "Which of the following factors leads to the maximum flight time of a glide?",
    "feedback": "Low mass."
  },
  {
    "question": "A twin engined aeroplane (mass = 68'500 kg) is established on a climb with all engines operating. The lift-to-drag ratio is 14, the AEO gradient of climb is 23.5%. What will be the OEI gradient of climb if one engine fails? (assume g = 10 m/s^2, constant L/D ratio)",
    "feedback": "8,2%"
  },
  {
    "question": "The correct definition of TODA",
    "feedback": "TORA plus clearway"
  },
  {
    "question": "What is true about a clearway?",
    "feedback": "A clearway can be water or land and must be under the control of the aerodrome authority"
  },
  {
    "question": "(for this question use Performance Manual MRJT1, Fig. 4.22)\nDetermine the gross level off altitude and optimum driftdown speed:\nGiven:\nMass: 44000 kgOAT: ISA +7°C",
    "feedback": "28300 ft, speed 196 kts"
  },
  {
    "question": "A jet aeroplane is descending en route from cruise altitude at idle thrust. If ATC requests the crew to descend to a given flight level by a given point such that it requires a steeper descent gradient, this could be achieved by ......",
    "feedback": "increasing the airspeed"
  },
  {
    "question": "Which one of the following statements concerning drift down is correct?",
    "feedback": "When determining the obstacle clearance during drift down, fuel dumping may be taken into account."
  },
  {
    "question": "With a positive rate of climb, the difference between the climb angle and the climb gradient is that the gradient ....",
    "feedback": "is stated as a percent, climb angle is stated in degrees"
  },
  {
    "question": "You are flying a medium jet aircraft with the autopilot maintaining a constant vertical speed. While flying a Continuous Descent Approach (CDA), the autothrust maintains a constant airspeed (CAS). You select the approach flaps as the aircraft gradually slows down from minimum clean speed of 213 kt to 180 kt, therefore, the ......\n(Other factors should not be considered to answer this question)",
    "feedback": "vertical speed must be reduced to maintain the trajectory, and when the approach speed stabilises, the autothrust will demand more thrust to maintain the speed"
  },
  {
    "question": "The effect of increasing the flap setting, from zero to the recommended take-off setting, on the length of the Take-off Distance Required (TODR) and the Field-Length-Limited Take-off Mass (TOM) is:",
    "feedback": "Decreased TOD required and increased field length limited TOM."
  },
  {
    "question": "(for this question use Performance Manual MEP1, Fig. 3.6)\nGiven:\nTake-off mass: 4000 lbsTemperature (OAT): -22°CPower: Below max. cont.\nThe single engine service ceiling of the aircraft is approximately:",
    "feedback": "18500 ft"
  },
  {
    "question": "Other factors remaining constant, the effect an increase of altitude, in a standard atmosphere, has on the value of Vx and Vy in terms of TAS is:",
    "feedback": "both will increase"
  },
  {
    "question": "for this question unse CAP 698, Figure 3.1\nGiven the following information, find the ground roll and take-off distance for the multi-engine piston aeroplane:\nOAT + 22°CPressure altitude 4000 ftTake-off mass 4250 lb5 kt tailwind",
    "feedback": "Ground roll 2100 ft, take-off distance 2500 ft"
  },
  {
    "question": "Refer to the graph\nGiven:\nLanding mass: 3000 lbsAirport elevation: 1500 ftQNH 996 hPaTemperature: 16°CWind: 5 kts tailRunway surface: dry grassRunway upslope: 1%Indicated airspeed: 74 ktsFlaps: 33°\nDetermine the landing distance from 50 ft above the threshold for a commercial aeroplane. Choose the closest answer.",
    "feedback": "1064 m"
  },
  {
    "question": "Maximum endurance for a piston engined aeroplane is achieved at:",
    "feedback": "The speed that approximately corresponds to the maximum climb angle speed."
  },
  {
    "question": "Which statement is correct for a descent without engine thrust at maximum lift to drag ratio speed?",
    "feedback": "A tailwind component increases the ground distance."
  },
  {
    "question": "(for this question use CAP 698, Figure 4.7)\nGiven the following information, what is the Maximum Take-Off Mass (MTOM) eventually limited by VMBE for the MRJT aeroplane?\nAirfield elevation: 1998 ftSlope: 0.2% downQNH: 1013.25 hPaOAT: 38°CV1: 145 ktTailwind: 5 kt",
    "feedback": "Approximately 68000 kg"
  },
  {
    "question": "The speed for maximum endurance",
    "feedback": "is always lower than the speed for maximum specific range."
  },
  {
    "question": "A twin engined aeroplane (mass = 51'500 kg) is established on a climb. The lift-to-drag ratio is 12. Each engine produces 60'000 newtons of thrust. The OEI gradient of climb is: (assume g = 10 m/s^2)",
    "feedback": "3,3%"
  },
  {
    "question": "CS 25.125 specifies the requirements for determining the landing distance of an aeroplane. According to that rule, what is the earliest point at which wheel brakes may be applied by the pilot?",
    "feedback": "When only the main wheels are firmly on the ground, provided the nose gear can be lowered in a controlled manner"
  },
  {
    "question": "If  T/0 weight is limited by Climb Requirements (A/C weight > 5700kg), then it means:",
    "feedback": "That at higher T/0 weight certain climb gradients during the T/O climb cannot be attained in case of an engine failure"
  },
  {
    "question": "When V1 has to be reduced because of a wet runway the one engine out obstacle clearance / climb performance:",
    "feedback": "decreases / remains constant."
  },
  {
    "question": "Consider a Class A Medium Range Jet Transport aeroplane that is approved to be operated with increased bank angle limits. The maximum permitted bank angle for the portion of the net take-off flight path between 200 ft and 400 ft is:",
    "feedback": "20°"
  },
  {
    "question": "(for this question use Performance Manual MRJT1, Fig.4.28)\nGiven the following information, what is the Field Length Limited Mass?\nRunway Length: 1600 m (dry)Airport PA: 1800 ftHeadwind: 20 ktsFlaps: 30°Anti-skid: OperativeSpoilers: Automatic",
    "feedback": "58000 kg"
  },
  {
    "question": "In a steady descending flight (descent angle GAMMA) equilibrium of forces acting on the aeroplane is given by: (T = Thrust, D = Drag, W = Weight)",
    "feedback": "T + W *sin GAMMA = D"
  },
  {
    "question": "How does the thrust of fixed propeller vary during take-off run, assuming unstalled flow conditions at the propeller blades ? The thrust",
    "feedback": "decreases while the aeroplane speed builds up"
  },
  {
    "question": "(for this question use Performance Manual MRJT1, Fig. 4.4)\nGiven:\nTake-off Mass: 58500 kgPressure Altitude: 1000 ftOutside Air Temperature (OAT): -7°CFlaps: 15°Wind: 10 kts headRunway slope: 1% downAir Conditioning (A/C) Packs: Off\nUsing the above data, determine the take-off distance:",
    "feedback": "5500 ft"
  },
  {
    "question": "Stepped climbs are used on long distance flights:",
    "feedback": "to fly a profile as close as possible to the optimum altitude as the aeroplane mass reduces"
  },
  {
    "question": "The landing field length required for turbojet aeroplanes at the destination (wet condition) is the demonstrated landing distance plus",
    "feedback": "92%"
  },
  {
    "question": "Refer to the figure.\nGiven:Aircraft: Multi-engine piston (MEP)Flight: Commercial air transportTake-off distance available (TODA): 2300 ftRunway downslope: 1 %Runway surface and condition: Paved and dryAerodrome field length: Unbalanced\nThe de-factored take-off distance for entering the take-off performance graph is .......",
    "feedback": "2000 ft"
  },
  {
    "question": "(for this question use Performance Manual SEP1, Figure 2.1)\nWith regard to the take-off performance chart for the single engine aeroplane determine the take-off distance to a height of 50 ft. Given:\nOAT: -7°CPressure Altitude: 7000 ftAeroplane Mass: 2950 lbsHeadwind: 5 ktsFlaps: UpRunway: Tarred and dry",
    "feedback": "2050 ft"
  },
  {
    "question": "What is the maximum quick turnaround mass?",
    "feedback": "It is the maximum mass corresponding to the minimum time you need to wait before commencing another take-off"
  },
  {
    "question": "During take-off, what are the consequences of mistakenly using a dry V1 on a wet runway? The actual Accelerate Stop Distance (ASD) required ....",
    "feedback": "will be longer, because of the reduced braking capability"
  },
  {
    "question": "If the value of the balanced V1 is found to be lower than VMCG, which of the following is correct ?",
    "feedback": "The take-off is not permitted."
  },
  {
    "question": "The speed VSR is defined as:",
    "feedback": "as reference stall speed and may not be less than 1-g stall speed"
  },
  {
    "question": "The speed V2 is",
    "feedback": "the take-off safety speed."
  },
  {
    "question": "At maximum landing mass, the structure of the aircraft is designed for a rate of descent of",
    "feedback": "600 fpm"
  },
  {
    "question": "An aeroplane carries out a descent from FL 410 to FL 270 at cruise Mach number, and from FL 270 to FL 100 at the IAS reached at FL 270. How does the angle of descent change in the first and in the second part of the descent? Assume idle thrust and clean configuration and ignore compressibility effects.",
    "feedback": "Increases in the first part; is constant in the second."
  },
  {
    "question": "The optimum cruise altitude is",
    "feedback": "the pressure altitude at which the best specific range can be achieved."
  },
  {
    "question": "Reduced take-off thrust should normally not be used when:",
    "feedback": "the runway is contaminated."
  },
  {
    "question": "(for this question use Performance Manual MRJT1, Fig. 4.4)\nWhat is the maximum brake release mass when the following data is given?\nPressure altitude: 6000 ftField length available: 7500 ftUpslope: 2%Tailwind: 5 ktsFlaps: 15°OAT: -20°CA/C: AutoAnti-ice: OffPMC: Off",
    "feedback": "50340 kg"
  },
  {
    "question": "for this question use CAP 698, Figure 4.1\nA flight has been planned to operate at the maximum field-length limited take-off mass (FLLTOM). This was based upon the planned runway being 04 and the forecast wind to be light and variable. During taxi, an aircraft just ahead was cleared to take-off and the reported wind was 27020 KT. What observations should the flight crew raise, given this updated wind?",
    "feedback": "The aircraft performance should be re-calculated prior to take-off because there is now a tailwind of approximately 13 KT"
  },
  {
    "question": "For a turbojet aircraft, what is the difference between range and endurance speeds? Maximum range is flown at ......",
    "feedback": "1.32 VMD minimum drag speed and maximum endurance is flown at VMD"
  },
  {
    "question": "The lift coefficient decreases during a glide with constant Mach number, mainly because the :",
    "feedback": "IAS increases."
  },
  {
    "question": "Which of the following statements is correct ?",
    "feedback": "A stopway means an area beyond the take-off runway, able to support the aeroplane during an aborted take-off."
  },
  {
    "question": "Given the following information, calculate the net glide distance for a single-engined aeroplane operating under performance class B.\nAeroplane altitude: 10000 ftTerrain elevation: 500 ftGross glide gradient: 10%TAS: 200 ktHeadwind component: 20 kt1 NM = 6080 ftstill air distance = (height difference / net gradient) x 100. Ground distance = Still Air Distance x (GS/TAS)",
    "feedback": "13.4 NM"
  },
  {
    "question": "In relation to the net take-off flight path, the required 35 ft vertical distance to clear all obstacles is",
    "feedback": "the minimum vertical distance between the lowest part of the aeroplane and all obstacles within the obstacle corridor."
  },
  {
    "question": "On a reciprocating engined aeroplane, to maintain a given angle of attack, configuration and altitude at higher gross mass",
    "feedback": "an increase in airspeed and power is required."
  },
  {
    "question": "In accordance with CS-25 the take-off safety speed V2min for turbo-propeller powered aeroplanes with more than three engines may not be less than:",
    "feedback": "1.08 Vsr"
  },
  {
    "question": "In addition to other requirements, the approach climb requirement is based on:",
    "feedback": "One engine out, flaps approach and gear up"
  },
  {
    "question": "The take-off safety speed V2 for two-engined or three-engined turbo propeller powered aeroplanes may not be less than:",
    "feedback": "1.13 Vsr"
  },
  {
    "question": "The maximum mass for landing could be limited by",
    "feedback": "the climb requirements with one engine inoperative in the approach configuration."
  },
  {
    "question": "Refer to the Regulated Take-Off Mass (RTOM) table for runway 23L from take-off position VB. In each RTOM chart box, the following information is provided for a given wind component, and a given outside air temperature:\nMTOM (1000 kg) / limit code /V1/VR/V2 (+100 kt)\nUse the data below to determine the RTOM for departure. For this question do not interpolate. Choose the most conservative figures at all times:\nW/V 23005KTModerate rainOAT + 12°CQNH 1015 hPaEngine anti-ice OFFPacks OFFQuick line-up",
    "feedback": "77570 kg"
  },
  {
    "question": "During a take-off in a Performance Class A aircraft, you will need to apply more than 15 degrees of bank. The required vertical obstacle clearance margin....",
    "feedback": "is increased from 35 ft to 50 ft"
  },
  {
    "question": "(For this Question use Performance Manual SEP1 Fig. 2.4)\nWith regard to the landing chart for the single engine aeroplane determine the landing distance from a height of 50 ft .\n\nGiven :\nO.A.T : ISA +15°C\nPressure Altitude:  0 ft\nAeroplane Mass:  2940 lbs\nHeadwind component:  10 kt\nFlaps:  Landing position (down) \nRunway: Tarred and Dry",
    "feedback": "approximately : 1300 feet"
  },
  {
    "question": "(for this question use Performance Manual SEP1, Figure 2.1)\nWith regard to the take-off performance chart for the single engine aeroplane and with regard to the commencement of a commercial flight, determine the maximum allowable take-off mass. Given:\nOAT: ISAPressure Altitude: 4000 ftHeadwind Component: 5 ktsFlaps: UpRunway: Tarred and dryTODA=TORA=ASDA: 2500 ftObstacle height: 50 ft",
    "feedback": "3240 lbs"
  },
  {
    "question": "(for this question use Performance Manual MRJT1, Fig. 4.11)\nGiven:\nPressure Altitude: 6000 ftPMC: OnTemperature (OAT): 30°CA/C packs: Auto\nDetermine %N1:",
    "feedback": "96.1"
  },
  {
    "question": "(for this question use Performance Manual MEP1, Fig. 3.1)\nGiven:\nOAT: -15°CPressure Altitude: 4000 ftRWY: 12RWind 08012KTTake-off Mass: 4000 lbsRunway Surface: Tarred and dry\nWhat is the minimum runway length, when no stopway and clearway is available?",
    "feedback": "1950 ft"
  },
  {
    "question": "(For this Question use Performance Manual MEP1 Fig. 3.7)\n\nGiven :\nO.A.T : -20 °C\nPressure Altitude:  14000 ft\nGross Mass:  4000 lbs\nOther conditions as associated in the header of the graph\n\nWhat is the one engine inoperative rate of climb for the conditions given?",
    "feedback": "175 ft/min"
  },
  {
    "question": "What is the effect of increased mass on the performance of a gliding aeroplane?",
    "feedback": "The speed for best angle of descent increases."
  },
  {
    "question": "The minimum climb gradient required on the 2nd flight path segment after the take-off of a jet aeroplane is defined by the following parameters:\n1) Undercarriage up2) Undercarriage down3) Wing flaps retracted4) Wing flaps in take-off position5) N engines at the take-off thrust6) (N-1) engines at the take-off thrust7) Speed over the path equal to V2 + 10 kts8) Speed over the path equal to 1.3 VS9) Speed over the path equal to V210) At a height of 35 ft above the runway\nThe correct statements are:",
    "feedback": "1, 4 , 6, 9"
  },
  {
    "question": "What issue you may experience with the take-off, if you were to pick up a new aircraft from a factory in Europe on a cold day?",
    "feedback": "A high VMCG which may lead to controllability issues in the event of an aborted take-off"
  },
  {
    "question": "(for this question use Performance Manual SEP1, Fig. 2.4)\nGiven:\nOAT: 18°CPressure Altitude: 3000 ft AMSLWind: 21010KTMass: 3120 lbRunway: Paved, wet\nUsing the graph, determine the ground roll distance of an aircraft, landing on runway 15:",
    "feedback": "1188 ft"
  },
  {
    "question": "(For this Question use Performance Manual MEP1 Fig. 3.2)\n\nGiven :\nO.A.T : 25 °C\nPressure Altitude:  3000 ft\nTake off Mass:  4400 lbs\nWind:  310/20 kt\nRWY: 26L\nHeavy Duty Brakes installed\nOther conditions as associated in the header of the graph\n\nWhat is the accelerate and stop distance under the conditions given?",
    "feedback": "3500 ft"
  },
  {
    "question": "Two identical turbojet aeroplanes (whose specific fuel consumption is assumed to be constant) are in a holding pattern at the same altitude. The mass of the first one is 95 000 kg and its hourly fuel consumption is equal to 3100 kg/h. Since the mass of the second one is 105 000 kg, its hourly fuel consumption is:",
    "feedback": "3426 kg/h"
  },
  {
    "question": "From 500 ft above the destination aerodrome to FL050, a multi-engine piston (MEP) aeroplane performs a steady climb, maintaining a constant speed of 120 kt IAS. During this climb, the \"power required vs. TAS\" curve will move (1) ...... and the \"power available vs. TAS\" curve will move (2) ......",
    "feedback": "(1) up and right, (2) down and right"
  },
  {
    "question": "Any acceleration in climb, with a constant power setting,",
    "feedback": "decreases the rate of climb and the angle of climb."
  },
  {
    "question": "(for this question use Performance Manual MEP1, Fig. 3.2)\nGiven:\nOAT: 32°CPressure Altitude: 2000 ftRWY: 34Wind: 10004KTTake-off Mass: 4350 lbsHeavy Duty Brakes: Installed\nOther conditions as associated in the header of the chart.\nWhat is the accelerate and stop distance under the conditions given?",
    "feedback": "4092 ft"
  },
  {
    "question": "(For this Question use Performance Manual SEP1 Fig. 2.4) Using the Landing Diagramm, for single engine aeroplane, determine the landing distance required (from a screen height of 50 ft), in the following conditions:  Given :  Pressure altitude: 4000 ft O.A.T.: 5°C Aeroplane mass: 3530 lbs Headwind component: 15 kt Flaps: down Runway: tarred and dry Landing gear: down",
    "feedback": "1400 ft"
  },
  {
    "question": "The maximum speed in horizontal flight occurs when:",
    "feedback": "the maximum thrust is equal to the total drag"
  },
  {
    "question": "for this question use CAP 698, Figure 4.9\nGiven:Aircraft: Medium range jet (MRJT)Runway: 27, 0.1 % downslopeTemperature (OAT): +42°CPressure altitude (PA): 111 ftRegulated take-off mass (RTOM): 59300 kgTake-off mass (TOM): 50810 kgWind: 18010 KTFlaps: 15°\nDetermine V1, VR, V2:",
    "feedback": "V1 = 125 kt, VR = 126 kt, V2 = 135 kt"
  },
  {
    "question": "Which statement regarding V1 is correct?",
    "feedback": "V1 is not allowed to be greater than VR."
  },
  {
    "question": "For a jet engine powered airplane which of the following corresponds to the speed for best L/D?",
    "feedback": "Speed for best endurance"
  },
  {
    "question": "The speed for best rate of climb is called",
    "feedback": "VY."
  },
  {
    "question": "Which speed represents the maximum endurance speed for a propeller driven aeroplane?",
    "feedback": "Minimum power speed"
  },
  {
    "question": "What is the difference between climb angle and climb gradient?",
    "feedback": "The value of the gradient is always higher than the value of the angle"
  },
  {
    "question": "The effect on a too late rotation will be an",
    "feedback": "increase the ground roll but climb ability will be good"
  },
  {
    "question": "To maximise the specific range of an aeroplane:",
    "feedback": "True airspeed must be high, and the fuel flow must be low"
  },
  {
    "question": "If the take-off mass of an aeroplane is tyre speed limited, downhill slope would",
    "feedback": "have no effect on the maximum mass for take-off."
  },
  {
    "question": "Vr  for transport category aircraft must be at least:",
    "feedback": "1.05 x Vmca"
  },
  {
    "question": "With regard to a large jet transport aeroplane, which of the following is a suitable definition of Specific Range over the Ground?",
    "feedback": "The number of nautical ground miles per unit of fuel"
  },
  {
    "question": "Compare a take-off at an airport with low air density with a take-off at an airport with high air density. A take-off with high air density ambient conditions leads to a/an ......",
    "feedback": "increased V2MIN"
  },
  {
    "question": "According to EASA AIR OPS, which one of the following statements concerning the landing distance for a turbojet aeroplane is correct?",
    "feedback": "When determining the maximum allowable landing mass at destination, 60% of the available landing runway length should be taken into account."
  },
  {
    "question": "The decision speed at take-off (V1) is the calibrated airspeed:",
    "feedback": "below which take-off must be rejected if an engine failure is recognized, above which take-off must be continued."
  },
  {
    "question": "The aeroplane, for which data are provided by the Buffet Onset Boundary Chart, is flying at FL350 through the tropics in the late afternoon. Ahead of the aeroplane is an extended line of thunderstorms. If the 1.4 g buffet range is Mach 0.79 to 0.81, which of the following answers is the most appropriate operational decision?",
    "feedback": "Descend to FL330 where the 1.4 g buffet margin is Mach 0.73 to greater than Mach 0.84 and navigate laterally between the thunderstorm cells"
  },
  {
    "question": "(for this question use CAP 698, Figure 4.7)\nGiven the following information, what is the Maximum Take-Off Mass (MTOM) eventually limited by VMBE for the MRJT aeroplane?\nPA: 1457 ftSlope: 0.4% downQNH: 1013.25 hPaOAT: 19°CV1: 148 ktTailwind: 10 kt",
    "feedback": "64000 kg"
  },
  {
    "question": "What should be considered when calculating take-off performance for a ferry flight of an MRJT at very cold temperatures?",
    "feedback": "VMCG can limit V1"
  },
  {
    "question": "(for this question use Performance Manual MRJT1, Fig. 4.28)\nGiven:\nAirport Pressure Altitude: 4000 ftRunway Condition: dryField Length: 2100 mWind: 30 kts headFlaps: 15°Manual Spoilers and Anti-skid: Operative\nUsing the data, determine the Field Length Limiting Landing Mass (FLLLM):",
    "feedback": "57200 kg"
  },
  {
    "question": "(for this question use Performance Manual MRJT1, Fig. 4.25)\nGiven the following information and assuming a drift down after engine failure, what is the time travelled and fuel burned during the drift down?\nDrift down from pressure altitude: 33000 ftDrift down to pressure altitude: 20000 ftGross Mass at engine failure: 55000 kgConditions: ISA, no wind",
    "feedback": "23 min, 750 kg"
  },
  {
    "question": "(For this Question use Flight Planning & Monitoring SEP1 Fig. 2.4) Using the Range Profile Diagramm, for the single engine aeroplane, determine the range, with 45 minutes reserve, in the following conditions: \n\nGiven :\nO.A.T.:                       ISA +16°C\nPressure altitude:        4000 ft\nPower:                       Full throttle / 25,0 in/Hg./ 2100 RPM",
    "feedback": "865 NM"
  },
  {
    "question": "(for this question use Performance Manual MRJT1, Fig. 4.4)\nWhat is the maximum brake release mass, given there is no slope and no wind?\nFlap setting: 15°OAT: +25°CAerodrome pressure altitude: 2000 ftField length available: 8000 ft",
    "feedback": "61000 kg"
  },
  {
    "question": "How does a wet runway affect the speed of V1?",
    "feedback": "it decreases"
  },
  {
    "question": "When calculating landing distance, wind correction factor must not be more than",
    "feedback": "50 % headwind  and 150 % tailwind"
  },
  {
    "question": "A higher outside air temperature (OAT)",
    "feedback": "decreases the brake energy limited take-off mass."
  },
  {
    "question": "Which of the following is a reason to operate an aeroplane at 'long range speed'?",
    "feedback": "It is efficient to fly slightly faster than with maximum range speed."
  },
  {
    "question": "The lowest take-off safety speed (V2 min) is:",
    "feedback": "1.13 VSR for two- and three-engine turbo-propeller and turbojet aeroplanes"
  },
  {
    "question": "An aeroplane is flying westwards over the middle of the Alps when it suffers an engine failure. The operator has defined two possible escape routes from the area, both of equal distance and terrain profile. In order to maximise terrain clearance, which escape route should the pilots take, and what speed should they descend at?\n1) Escape route North, with a tailwind2) Escape route South, with a headwind3) Descend at high speed (close to VMO, maximum operating limit speed)4) Descend at low speed (close to VMD, minimum drag speed)",
    "feedback": "1, 4"
  },
  {
    "question": "VSR1 is the:",
    "feedback": "Reference stall speed in a specific configuration"
  },
  {
    "question": "(For this Question use Performance Manual MEP1 Fig. 3.1)\n\nGiven :\nO.A.T : 24 °C\nPressure Altitude:  3000 ft\nTake off Mass:  3800 lbs\nWind:  080/12kt\nRWY: 12L\nHeavy Duty Brakes installed\nOther conditions as associated in the header of the graph\n\nWhat is the ground roll distance under the conditions given?",
    "feedback": "1350 ft"
  },
  {
    "question": "A jet aeroplane is climbing at a constant IAS and maximum climb thrust, how will the climb angle / the pitch angle change?",
    "feedback": "Reduce / decrease."
  },
  {
    "question": "V2 has to be equal to or higher than",
    "feedback": "1.1 VMCA."
  },
  {
    "question": "For a piston-engined propeller aircraft, the speed for maximum endurance which gives the greatest endurance time is:",
    "feedback": "Found at low altitude"
  },
  {
    "question": "The minimum value of V2 must exceed \"air minimum control speed\" by:",
    "feedback": "10%"
  },
  {
    "question": "Which of the following sequences of speed for a jet aeroplane is correct ? (from low to high speeds)",
    "feedback": "Vs, maximum angle climb speed, maximum range speed."
  },
  {
    "question": "Vmca is defined as the minimum speed at which directional control can be maintained in flight with an engine failure in a defined configuration which include:",
    "feedback": "zero yaw"
  },
  {
    "question": "With all engines out, a pilot wants to fly for maximum time. Therefore he has to fly the speed corresponding to:",
    "feedback": "the minimum power"
  },
  {
    "question": "A multi engine piston aircraft suffers an engine failure during climb. What will happen to VY and the rate of climb?",
    "feedback": "Both will decrease"
  },
  {
    "question": "All other criteria being equal, what factor can reduce the landing distance?",
    "feedback": "The use of spoilers"
  },
  {
    "question": "If a departure procedure requires 4.6 % climb gradient to 1300 ft, to clear an obstacle, what is the minimum ROC, given the following?\nTAS: 125 KTSHeadwind component: 25 KTS",
    "feedback": "460 ft/min"
  },
  {
    "question": "You are in descent on a ILS with a constant CAS, compared with a nil wind situation, a tailwind will:",
    "feedback": "increase descent rate"
  },
  {
    "question": "With regard to a take-off from a wet runway, which of the following statements is correct?",
    "feedback": "The screen height can be lowered to reduce the mass penalties."
  },
  {
    "question": "Which of the following are to be taken into account for the runway in use for take-off ?",
    "feedback": "Airport elevation, runway slope, outside air temperature, pressure altitude and wind components."
  },
  {
    "question": "The use of reduced take-off thrust is permitted, only if:",
    "feedback": "The actual take-off mass (TOM) is lower than the field length limited TOM."
  },
  {
    "question": "Which statement regarding the influence of a runway down-slope is correct for a balanced take-off? Down-slope...",
    "feedback": "reduces V1 and reduces take-off distance required (TODR)."
  },
  {
    "question": "During a cruise flight of a jet aeroplane at constant flight level and at the maximum range speed, the IAS / the drag will:",
    "feedback": "decrease / decrease."
  },
  {
    "question": "Changing the take-off flap setting from flap 15° to flap 5° will normally result in :",
    "feedback": "a longer take-off distance and a better climb."
  },
  {
    "question": "A twin jet aeroplane is in cruise, with one engine inoperative, and has to overfly a high terrain area. In order to allow the greatest clearance height, the appropriate airspeed must be the airspeed",
    "feedback": "of greatest lift-to-drag ratio."
  },
  {
    "question": "If you are taking off on a runway with a contaminated surface and you are VMCG limited, how can you improve performance?",
    "feedback": "Derated thrust to decrease VMCG"
  },
  {
    "question": "Normal procedures associated with take-off and landing on contaminated runways are to be found in ......",
    "feedback": "Part B of the Operations Manual"
  },
  {
    "question": "(for this question use Performance Manual SEP1, Figure 2.2)\nWith regard to the take-off performance chart for the single engine aeroplane determine the take-off distance to a height of 50 ft. Given:\nOAT: 30°CPressure Altitude: 1000 ftAeroplane Mass: 3400 lbsTailwind component: 10 ktsFlaps: ApproachRunway: Tarred and dry",
    "feedback": "2500 ft"
  },
  {
    "question": "Which of the following statements are correct or incorrect?\n1) In order to achieve a sufficient level of safety, the weight of a dispatched aeroplane may be limited2) Measured performance is the performance achieved by the manufacturer under test conditions for certification",
    "feedback": "1) and 2) are correct"
  },
  {
    "question": "How is VMCA influenced by increasing pressure altitude?",
    "feedback": "VMCA decreases with increasing pressure altitude."
  },
  {
    "question": "V1 for a balanced field is calculated when:",
    "feedback": "the acceleration/stop distance available is equal to the take-off distance available"
  },
  {
    "question": "Regarding take-off, the take-off decision speed V1:",
    "feedback": "is the airspeed on the ground at which the pilot is assumed to have made a decision to continue or discontinue the take-off"
  },
  {
    "question": "If the climb speed schedule is changed from 280/.74 to 290/.74 the new crossover altitude is",
    "feedback": "lower."
  },
  {
    "question": "What happens when flying at the 'backside of the power curve'?",
    "feedback": "The speed is unstable."
  },
  {
    "question": "For turboprop aircraft >5700 kg in transport CAT, the runway length requirements for landing at the alternate airport is",
    "feedback": "70 % of runway length available"
  },
  {
    "question": "You are preparing for departure at an airfield with two runways, one is reported as contaminated and the other is reported as wet. Which of the following statements is correct?",
    "feedback": "A derated thrust take-off is allowed on either runway"
  },
  {
    "question": "The take-off distance of an aircraft is 600m in standard atmosphere, no wind at 0 ft pressure-altitude. Using the following corrections: \"± 20 m / 1 000 ft field elevation\" \"- 5 m / kt headwind\" \"+ 10 m / kt tail wind\" \"± 15 m / % runway slope\" \"± 5 m / °C deviation from standard temperature\" The take-off distance from an airport at 1 000 ft elevation, temperature 17°C, QNH 1013,25 hPa, 1% up-slope, 10 kt tail wind is:",
    "feedback": "755 m"
  },
  {
    "question": "(For this Question use Performance Manual SEP1 Fig. 2.2)\nWith regard to the take off performance chart for the single engine aeroplane determine the take off distance to a height of 50 ft.\n\nGiven :\nO.A.T :                            -7°C\nPressure Altitude:             7000 ft\nAeroplane Mass:               2950 lbs\nHeadwind component:       5 kt\nFlaps:                             Approach setting\nRunway:                          Tarred and Dry",
    "feedback": "approximately : 2050 ft"
  },
  {
    "question": "The critical engine inoperative",
    "feedback": "increases the power required because of the greater drag caused by the windmilling engine and the compensation for the yaw effect."
  },
  {
    "question": "Considering VR, Which statement is correct?",
    "feedback": "VR is the speed at which rotation should be initiated."
  },
  {
    "question": "An aeroplane is in a power off glide at speed for minimum glide angle. If the pilot increases pitch attitude the glide distance:",
    "feedback": "decreases."
  },
  {
    "question": "Given the information, what landing flap configuration should be used to be within the landing limits?\n\nEstimated Landing Mass: 54500 kg\nStructural-limited Landing Mass: 66300 kg",
    "feedback": "Flaps 30"
  },
  {
    "question": "A four jet-engined aeroplane (mass = 150 000 kg) is established on climb with all engines operating. The lift-to-drag ratio is 14. Each engine has a thrust of 75 000 Newtons. The gradient of climb is: (given: g= 10 m/s²)",
    "feedback": "12.86%."
  },
  {
    "question": "Which of the following statements is true regarding a balanced field lenght?",
    "feedback": "A balanced field length provides the minimum required field length in the event of an engine failure."
  },
  {
    "question": "For planning purposes, determine the net distance travelled. Given the following data:\nAltitude: 8000 feetAirport elevation: 1500 ftTAS: 100 ktsHeadwind: 10 ktsGross gradient of descent 8 %\nstill air distance (ft) = height difference  /  net gradient x 100Ground distance = still air distance x (GS / TAS)1 NM = 6080 ft",
    "feedback": "12.03 NM"
  },
  {
    "question": "(for this question use Performance Manual SEP1, Figure 2.3)\nFind the rate of climb at an altitude of 12000 ft if the following information is given:\nGross mass: 2950 lbsClimb power: full throttleSpeed: 100 kts IASTemperature: ISA +15°CQNH: 1013 hPaHeadwind: 10 kts",
    "feedback": "740 ft/min"
  },
  {
    "question": "An increase in atmospheric pressure has, among other things, the following consequences on take-off performance:",
    "feedback": "a reduced take-off distance and improved initial climb performance"
  },
  {
    "question": "Which of the following statements is correct?",
    "feedback": "VR is the speed at which the pilot should start to rotate the aeroplane."
  },
  {
    "question": "Density altitude is the",
    "feedback": "pressure altitude corrected for 'non standard' temperature"
  },
  {
    "question": "What is the advantage of balancing V1, even in the event of a climb limited take-off?",
    "feedback": "The safety margin with respect to the runway length is greatest."
  },
  {
    "question": "A two engine turbojet has to initiate a turn in the second segment of the take-off flight path. During the turn there is an obstacle that requires a net climb gradient of 2.0 % in order to clear the obstacle. The bank angle during the turn is 15° and the flight manual gives a decrement for the turn of 0.5 %.\nTaking into account both the Regulation and obstacle clearance, what will be the minimum gross gradient required before commencing the turn?",
    "feedback": "3.3 %"
  },
  {
    "question": "The value of V1 has to be equal or higher than:",
    "feedback": "VMCG"
  },
  {
    "question": "Which of the following statements regarding the reduced thrust take-off technique is correct?",
    "feedback": "Reduced thrust can be used when the actual take-off mass is less than the performance limited take-off mass."
  },
  {
    "question": "(for this question use CAP 698, Figure 4.7)\nGiven the following information, what is the Maximum Take-Off Mass (MTOM) eventually limited by VMBE for the MRJT aeroplane?\nPA: 130 ftSlope: 0.1 % upQNH: 1013 hPaOAT: 21°CV1: 149 ktTailwind: 5 kt",
    "feedback": "Greater than 68000 kg"
  },
  {
    "question": "At an aerodrome, the minimum climb gradient for obstacle clearance is 6.3 %. Calculate the minimum rate of climb, which the pilot has to maintain during the climb.\nGiven:\nTAS: 135 KTSTailwind: 8 KTS",
    "feedback": "910 ft/min"
  },
  {
    "question": "The speed VR",
    "feedback": "is the speed at which rotation to the lift-off angle of attack is initiated."
  },
  {
    "question": "The maximum operating altitude for a certain aeroplane with a pressurised cabin",
    "feedback": "is the highest pressure altitude certified for normal operation."
  },
  {
    "question": "Consider the graphic representation of the power required versus true air speed (TAS), for a piston engined aeroplane with a given mass. The tangent from the point of origin to the point of contact on the curve, at the point of contact (A), determines the speed that will attain the:",
    "feedback": "maximum specific range."
  },
  {
    "question": "Which of the following statements is correct?",
    "feedback": "VR is the speed at which the pilot should start to rotate the aeroplane."
  },
  {
    "question": "The value of V1 has to be equal or higher than:",
    "feedback": "VMCG"
  },
  {
    "question": "(for this question use Performance Manual MEP1, Fig. 3.6)\nGiven:Take-off mass; 4375 lbAirport elevation: 4000 ftTemperature (OAT): +22°CTailwind: 10 ktClimb speed: 92 KIAS (99 KTAS)Flaps: retractedGear: retractedPower setting: take-off power\nThe one engine inoperative flight path gradient with a feathered propeller is ......",
    "feedback": "2.8 %"
  },
  {
    "question": "(for this question use Performance Manual MRJT1, Fig. 4.4)\nWhat is the maximum brake release mass when the following data is given?\nPressure altitude: 6000 ftField length available: 7500 ftUpslope: 2%Tailwind: 5 ktsFlaps: 15°OAT: -20°CA/C: AutoAnti-ice: OffPMC: Off",
    "feedback": "50340 kg"
  },
  {
    "question": "From the screen height of 50 ft, a single-engined piston aeroplane performs a straight-out climb in visual meteorological conditions with a rate of climb of 500 ft/min and a TAS of 110 kt. The wind is calm. What will be the expected height clearance of a crane at is 9 m high above the ground and positioned at a distance of 372 m on the extended runway centre line from the reference zero point?",
    "feedback": "22.94 m"
  },
  {
    "question": "You are taking off in a Class A aircraft. Between 200 and 400 ft more bank than the standard regulatory limit is required. What is the maximum bank angle you are allowed to fly, when approved to be operated with increased bank angle limits according to EU-OPS?",
    "feedback": "20°"
  },
  {
    "question": "The airspeed for jet aeroplanes at which power required is a minimum",
    "feedback": "is always lower than the minimum drag speed."
  },
  {
    "question": "(for this question use Performance Manual MEP1, Fig. 3.2)\nGiven:\nOAT: 32°CPressure Altitude: 2000 ftRWY: 34Wind: 10004KTTake-off Mass: 4350 lbsHeavy Duty Brakes: Installed\nOther conditions as associated in the header of the chart.\nWhat is the accelerate and stop distance under the conditions given?",
    "feedback": "4092 ft"
  },
  {
    "question": "The intersections of the thrust available and the drag curve are the operating points of the aeroplane",
    "feedback": "in unaccelerated level flight."
  },
  {
    "question": "On a reciprocating engined aeroplane, with increasing altitude at constant gross mass, angle of attack and configuration the power required",
    "feedback": "increases and the TAS increases by the same percentage."
  },
  {
    "question": "Moving the center of gravity from the forward to the aft limit (gross mass, altitude and airspeed remain unchanged)",
    "feedback": "decreases the induced drag and reduces the power required."
  },
  {
    "question": "What speed will be limiting with a descent at constant Mach?",
    "feedback": "VMO"
  },
  {
    "question": "If the aircraft mass, in a horizontal unaccelerated flight, decreases:",
    "feedback": "the minimum drag decreases and the IAS for minimum drag decreases."
  },
  {
    "question": "Given:\n\nVS = stalling speed\nVMCA = air minimum control speed\nVMU = minimum unstick speed (disregarding engine failure)\nV1 = take-off decision speed\nVR = rotation speed\nV2min = minimum take-off safety speed\nVLOF = lift-off speed\n\nThe correct formula is:",
    "feedback": "VS < VMCA < V2min"
  },
  {
    "question": "Maximum tire speed Vmax tyre are limited to speed due to",
    "feedback": "centripetal force on the tire"
  },
  {
    "question": "An airplane is flying at FL350 and its Mach number is M 0.78 (262 kg CAS). An engine failure occurs and the flight crew has to commence a drift down. There are three different drift down strategies given:\nStandard strategy: M 0.78, 300 ktObstacle strategy: Minimum drag speed VMD (241 CAS)ETOPS strategy: M 0.80, 340 kt\nWhich of the following statements is correct?(all strategies use max continuous thrust)",
    "feedback": "Obstacle strategy: Decelerating to VMD before commencing the descent improves the obstacle clearance"
  },
  {
    "question": "May the whole runway always be used for landing?",
    "feedback": "No, obstacles in the approach area may decrease the usable part of the runway."
  },
  {
    "question": "(For this Question use Performance Manual MEP1 Fig. 3.2)\n\nGiven :\nO.A.T : 20 °C\nPressure Altitude:  2000 ft\nTake off Mass:  4500 lbs\nWind:  120/15 kt\nRWY: 07R\nHeavy Duty Brakes installed\nOther conditions as associated in the header of the graph\n\nWhat is the accelerate and stop distance under the conditions given?",
    "feedback": "3450 ft"
  },
  {
    "question": "With increasing altitude, what will happen to VY and excess power?",
    "feedback": "VY expressed as a TAS will increase and excess power will decrease"
  },
  {
    "question": "A multi engine piston aircraft suffers an engine failure during climb. What will happen to VY and the rate of climb?",
    "feedback": "Both will decrease"
  },
  {
    "question": "The procedure to minimise fuel consumption following an instruction from ATC to delay the arrival time due to traffic is:",
    "feedback": "To reduce speed to VMD and maintain optimum altitude"
  },
  {
    "question": "When an aircraft takes off with the mass limited by the TODA:",
    "feedback": "the actual take-off mass equals the field length limited take-off mass."
  },
  {
    "question": "Which of the following statements correctly describes the sequence of descent speeds for a turbojet airplane when leaving its cruising level at the top of descent?(assume idle thrust, clean configuration and no compressibility effects)",
    "feedback": "The first part of the descent is flown with a constant Mach number and the second part of the descent is flown with a constant IAS"
  },
  {
    "question": "The approach climb requirement (A/C weight > 5700 kg) is normally met by:",
    "feedback": "Reducing flap setting for approach with one engine inoperative (2-engine airplanes)"
  },
  {
    "question": "What will happen to the accelerate stop distance (ASD) if a dry V1 is used on a wet runway?",
    "feedback": "ASD increases and the runway becomes unbalanced"
  },
  {
    "question": "The danger associated with low speed and/or high speed buffet",
    "feedback": "limits the maneuvering load factor at high altitudes."
  },
  {
    "question": "Which of the following is a reason to operate an aeroplane at 'long range speed'?",
    "feedback": "It is efficient to fly slightly faster than with maximum range speed."
  },
  {
    "question": "When flying at high altitudes speed range becomes narrow due to",
    "feedback": "low speed buffet onset increase and high speed buffet decrease"
  },
  {
    "question": "At a given mass, the reference stall speed of a twin engine turboprop aircraft is 100 kts in the landing configuration. The minimum speed a pilot must maintain on short final is:",
    "feedback": "123 kts"
  },
  {
    "question": "Consider a scenario where two turbojet aeroplanes are climbing with a constant Mach number in standard conditions with the same angle of climb.\nAeroplane 1 climbs at Mach 0.75Aeroplane 2 climbs at Mach 0.73\nWhich option is correct?",
    "feedback": "Rate of climb depends on TAS and can not be estimated using a Mach number only"
  },
  {
    "question": "The take-off mass could be limited by",
    "feedback": "the take-off distance available (TODA), the maximum brake energy and the climb gradient with one engine inoperative."
  },
  {
    "question": "The speed V2 of a jet aeroplane must be greater than:",
    "feedback": "1.13Vsr."
  },
  {
    "question": "Assuming that the required lift exists, which forces determine an aeroplane's angle of climb?",
    "feedback": "Weight, drag and thrust."
  },
  {
    "question": "A turbojet is flying at a constant IAS and pressure altitude. Given that a ± 1° C of ISA deviation results in a change in fuel flow of ± 0.2 %, determine how much the specific fuel consumption would change if the OAT is ISA - 10° C rather than ISA:",
    "feedback": "2 % decrease in SFC"
  },
  {
    "question": "What is the equation for the climb gradient expressed in percentage during unaccelerated flight (applicable to small angles only)?",
    "feedback": "Climb Gradient = ((Thrust - Drag)/Weight) x 100"
  },
  {
    "question": "What is the maximum endurance speed for a turbojet?",
    "feedback": "The speed for minimum drag (lowest point of the drag curve)"
  },
  {
    "question": "(For this Question use Performance Manual MEP1 Fig. 3.7)\n\nGiven :\nO.A.T : 0 °C\nPressure Altitude:  18000 ft\nGross Mass:  3750 lbs\nMixture: leaned to 25°F rich of peak EGT\nOther conditions as associated in the header of the graph\n\nWhat is the two engine rate of climb for the conditions given?",
    "feedback": "1050 ft/min"
  },
  {
    "question": "When compared to still air conditions, a constant headwind component:",
    "feedback": "increases the angle of the flight path during climb"
  },
  {
    "question": "On the Power versus TAS graph for level flight, the point at which a tangent from the origin touches the power required curve:",
    "feedback": "is the point where the Lift to Drag ratio is a maximum."
  },
  {
    "question": "(For this Question use Performance Manual MEP1 Fig. 3.7)\n\nGiven :\nO.A.T : -20 °C\nPressure Altitude:  14000 ft\nGross Mass:  4000 lbs\nOther conditions as associated in the header of the graph\n\nWhat is the one engine inoperative rate of climb for the conditions given?",
    "feedback": "175 ft/min"
  },
  {
    "question": "An aeroplane with reciprocating engines is flying at a constant angle of attack, mass and configuration. With increasing altitude the drag:",
    "feedback": "remains unchanged but the TAS increases"
  },
  {
    "question": "Which of the following statements is applicable to the acceleration height at the beginning of the 3rd climb segment ?",
    "feedback": "The maximum acceleration height depends on the maximum time take-off thrust may be applied."
  },
  {
    "question": "Which of the equations below defines specific range (SR)?",
    "feedback": "SR = True Airspeed/Total Fuel Flow"
  },
  {
    "question": "The following parameters affect the take of ground run:\n\n1) decreasing take off mass\n2) increasing take of mass\n3) increasing density\n4) decreasing density\n5) increasing flap setting\n6) decreasing flap setting\n7) increasing pressure altitude\n8) decreasing pressure altitude\n\nWhich parameters will decrease the take off ground run?",
    "feedback": "1, 3, 5, 8"
  },
  {
    "question": "For jet aeroplanes which of the following statements is correct?",
    "feedback": "When determining the maximum allowable landing mass at destination, 60% of the available distance is taken into account, if the runway is expected to be dry."
  },
  {
    "question": "From the screen height of 50 ft, a single-engined piston aeroplane performs a straight-out climb in visual meteorological conditions with a rate of climb of 500 ft/min and a TAS of 110 kt. The wind is calm. What will be the expected height clearance of a group of trees that are 9 m tall and located at a distance of 352 m on the extended runway centre line from reference zero?",
    "feedback": "22.3 m"
  },
  {
    "question": "(for this question use Performance Manual SEP1, Figure 2.3)\nDetermine the rate of climb by using the following information:\nPower setting: Full throttle (2700 RPM)Mass: 3400 lbPressure Altitude: 10000 ft (ISA conditions)",
    "feedback": "720 ft/min"
  },
  {
    "question": "In straight and level flight at constant indicated airspeed, a reduction in pressure altitude:",
    "feedback": "reduces the power required"
  },
  {
    "question": "An aircraft is on approach to an airfield where there is a 30 kt crosswind. A speed of 180 kt CAS and a rate of descent of 1200 fpm is maintained. During the final turn the 30 kt crosswind turns into a headwind. What should the action be to maintain the correct approach path?",
    "feedback": "Reduce the rate of descent and maintain 180 kt CAS"
  },
  {
    "question": "for this question use CAP 698, Figure 4.1\nDuring an approach to land on runway 07 the controller informs the flight crew that the weather has changed significantly since the last report and the wind is now 220°(M)/25KT. Considering that both runway 07 and 25 are fully operational and available, which of the following options provides the greatest performance safety margin?",
    "feedback": "There is a tailwind of approximately 22 KT on runway 07; the crew should request landing on runway 25 instead"
  },
  {
    "question": "What is the minimum width of a clearway?",
    "feedback": "500 ft"
  },
  {
    "question": "(for this question use Performance Manual MEP1, Fig. 3.3)\nGiven the following information, what is the Field Length Limited Take-Off Mass?\nTORA: 2200 ftTODA: 2200 ftASDA: 2200 ftRunway Surface: PavedRunway Condition: DryRunway Slope: 2.0% upAerodrome PA: 4000 ftAerodrome Temperature: +10°CTailwind Component: 5 kt",
    "feedback": "4250 lb"
  },
  {
    "question": "Calcuclate the single engine service ceiling from the given values and graph:\nOAT: 30°CAnti-ice: OffWeight: 8300 lbsQNH: 1037 hPa",
    "feedback": "4300 ft"
  },
  {
    "question": "Given that the characeteristics of a three engine turbojet aeroplane are as follows:\nThrust: 50000 Newton/engineg: 10 m/s2Drag: 72569 NMinimum gross gradient 2nd segment: 2.7 %\nThe maximum take-off mass under 2nd segment conditions is:(SIN (Angle of climb) = (Thrust - Drag) / Weight)",
    "feedback": "101596 kg"
  },
  {
    "question": "(For this Question use Performance Manual SEP1 Fig. 2.3)\nUsing the climb performance chart, for the single engine aeroplane, determine the ground distance to reach a height of 1500 ft above the reference zero in the following conditions:\nGiven : \nO.A.T at Take-off:                     ISA\nAirport pressure altitude:           5000 ft\nAeroplane mass:                      3300 lbs\nSpeed:                                    100 KIAS\nWind component:                     5 kts Tailwind",
    "feedback": "16 665 ft"
  },
  {
    "question": "Compared to a balanced field with no stopway or clearway, adding a stopway will ...... the performance limited takeoff mass and ...... V1.",
    "feedback": "increase, increase"
  },
  {
    "question": "Which one of the following is not affected by a tail wind?",
    "feedback": "the climb limited take-off mass."
  },
  {
    "question": "(for this question use Performance Manual MEP1, Fig. 3.1)\nGiven:\nOAT: 24°CPressure Altitude: 3000 ftRWY: 12LWind 08012KTTake-off Mass: 3800 lbsRunway Surface: Wet grass - firm soilRunway Slope: 2% downslope\nWhat is the minimum runway length, when no stopway and clearway is available?",
    "feedback": "2850 ft"
  },
  {
    "question": "When descending below the optimum altitude for a jet aeroplane at the long range cruise speed:",
    "feedback": "Mach number decreases"
  },
  {
    "question": "Vr  for transport category aircraft must be at least:",
    "feedback": "1.05 x Vmca"
  },
  {
    "question": "What is correct regarding the effect of displacement drag and impingement drag on take-off performance? There is a (1) ...... effect in case of a rejected take-off and a (2) ...... effect for continued take-off.",
    "feedback": "(1) positive, (2) negative"
  },
  {
    "question": "For take-off an aircraft requires a headwind component of at least 10 kt and has a cross wind limitation of 35 kt. If the angle between the wind direction and the runway is 60°, what are the minimum and maximum allowable wind speeds?",
    "feedback": "20 kt and 40 kt"
  },
  {
    "question": "Which of the following statements is correct ?",
    "feedback": "A stopway means an area beyond the take-off runway, able to support the aeroplane during an aborted take-off."
  },
  {
    "question": "A higher pressure altitude at ISA temperature",
    "feedback": "decreases the field length limited take-off mass."
  },
  {
    "question": "Which wind  component are you allowed to use when determining the required \nrunway length for landing?",
    "feedback": "50% head wind and 150 % tail wind."
  },
  {
    "question": "During climb with all engines, the altitude where the rate of climb reduces to 100 ft/min is called:",
    "feedback": "Service ceiling"
  },
  {
    "question": "Which of the following statements is correct?",
    "feedback": "Induced drag decreases with increasing speed."
  },
  {
    "question": "The required landing distance available in category A for landing is equal to",
    "feedback": "A landing distance available which, multiplied by 0.60 gives the landing distance, the landing distance being the distance from 50 ft. to complete stop."
  },
  {
    "question": "The lift coefficient decreases during a glide with constant Mach number, mainly because the :",
    "feedback": "IAS increases."
  },
  {
    "question": "For a single engine aeroplane, calculate the net glide distance following an engine failure. Given:\nAltitude: 9500 ftTerrain elevation: 500 ftGross gradient: 11%TAS: 250 ktTailwind: 50 kt\nstill air distance = (height difference (ft) x 100) / net gradient (%), ground distance = still air distance x (GS/TAS)",
    "feedback": "15.5 NM"
  },
  {
    "question": "If there is a tail wind, the climb limited TOM will:",
    "feedback": "not be affected"
  },
  {
    "question": "Given a jet aircraft. Which order of increasing speeds in the performance diagram is correct?",
    "feedback": "Vs, Vx, Maximum range speed"
  },
  {
    "question": "Compare the take-off performance for the same aircraft with the same mass at airport A (elevation 10 feet AMSL) with take-off performance at airport B (elevation 5330 feet AMSL). Assume the same temperature at both airports. At airport B, the take-off distance will be (1) ...... and the climb gradient will be (2) ......:",
    "feedback": "(1) longer, (2) reduced"
  },
  {
    "question": "The optimum cruise altitude increases",
    "feedback": "if the aeroplane mass is decreased."
  },
  {
    "question": "(For this Question use Flight Planning & Monitoring SEP1 Fig. 2.4) Using the Range Profile Diagramm, for the single engine aeroplane, determine the range, with 45 minutes reserve, in the following conditions: \n\nGiven :\nO.A.T.:                       ISA +16°C\nPressure altitude:        4000 ft\nPower:                       Full throttle / 25,0 in/Hg./ 2100 RPM",
    "feedback": "865 NM"
  },
  {
    "question": "(For this Question use Performance Manual MEP1 Fig. 3.7)\n\nGiven :\nO.A.T : -20 °C\nPressure Altitude:  14000 ft\nGross Mass:  4000 lbs\nMixture: full rich\nOther conditions as associated in the header of the graph\n\nWhat is the two engine rate of climb for the conditions given?",
    "feedback": "1300 ft/min"
  },
  {
    "question": "(For this Question use Performance Manual MRJT1)\nWith regard to the drift down performance of the twin jet aeroplane, what is meant by \"equivalent gross weight at engine failure\" ?",
    "feedback": "The equivalent gross weight at engine failure is the actual gross weight corrected for OAT higher than ISA +10°C."
  },
  {
    "question": "Calcuclate the single engine service ceiling from the given values and graph:\nOAT: -20°CAnti-ice: OnWeight: 6250 lbsQNH: 1030 hPa",
    "feedback": "14500 ft"
  },
  {
    "question": "Which of the following combinations will give the most limiting weight if identical slope and wind component values exist?",
    "feedback": "an up-sloping runway with a tailwind component"
  },
  {
    "question": "If there is a tail wind, the climb limited TOM will:",
    "feedback": "not be affected."
  },
  {
    "question": "What happens with descent gradient and RoD during a glide with constant IAS below the tropopause?",
    "feedback": "Descent gradient is constant, RoD decreases"
  },
  {
    "question": "The critical engine inoperative",
    "feedback": "increases the power required because of the greater drag caused by the windmilling engine and the compensation for the yaw effect."
  },
  {
    "question": "A jet aeroplane descends with constant Mach number. Which of the following speed limits is most likely to be exceeded first?",
    "feedback": "Maximum Operating Speed"
  },
  {
    "question": "Which statement regarding the relationship between traffic load and range is correct?",
    "feedback": "The traffic load can be limited by the desired range."
  },
  {
    "question": "A jet aeroplane is flying long range cruise. How does the specific range / fuel flow change, compared to the Maximum Range Cruise?",
    "feedback": "Decrease / increase."
  },
  {
    "question": "What are the advantages of using a reduced thrust setting for take-off?",
    "feedback": "Reduce costs"
  },
  {
    "question": "Refer to the figure:\nA pilot is considering the possibility of having to land on a flooded runway and is evaluating the aircraft configuration and the selection of the landing speeds. Given the following information, choose the lowest (smallest) possible flap setting that would avoid dynamic hydroplaning on landing.\nTake-off mass: 45000 kgTyre pressure: 200 psi",
    "feedback": "Flaps 30"
  },
  {
    "question": "In the event that the take-off mass is obstacle limited and the take-off flight path includes a turn, the bank angle should not exceed",
    "feedback": "15 degrees up to height of 400 ft."
  },
  {
    "question": "A twin engined aeroplane (mass = 51'500 kg) is established on a climb. The lift-to-drag ratio is 12. Each engine produces 60'000 newtons of thrust. The OEI gradient of climb is: (assume g = 10 m/s^2)",
    "feedback": "3,3%"
  },
  {
    "question": "(For this Question use Performance Manual SEP1 Fig. 2.4) Using the Landing Diagramm, for single engine aeroplane, determine the landing distance required (from a screen height of 50 ft), in the following conditions:  Given :  Pressure altitude: 4000 ft OAT: 5°C Aeroplane mass: 3530 lbs Headwind component: 15 kts Flaps: Approach Runway: tarred and dry",
    "feedback": "1350 ft"
  },
  {
    "question": "The speed V2 is defined for jet aeroplane as",
    "feedback": "take-off climb speed or speed at 35 ft."
  },
  {
    "question": "\"Maximum endurance\"",
    "feedback": "is achieved in unaccelerated level flight with minimum fuel consumption."
  },
  {
    "question": "The stalling speed or the minimum steady flight speed at which the aeroplane is controllable in landing configuration is abbreviated as",
    "feedback": "VSO."
  },
  {
    "question": "(For this Question use Performance Manual SEP1 Fig. 2.2)\nWith regard to the take off performance chart for the single engine aeroplane determine the take off distance to a height of 50 ft.\n\nGiven :\nO.A.T :                            -7°C\nPressure Altitude:             7000 ft\nAeroplane Mass:               2950 lbs\nHeadwind component:       5 kt\nFlaps:                             Approach setting\nRunway:                          Tarred and Dry",
    "feedback": "approximately : 2050 ft"
  },
  {
    "question": "A take-off performance is calculated with the use of given conditions. If subsequently, the OAT drops, the aircraft's climb performance will (1) ......, because the excess thrust will be (2) ...... .",
    "feedback": "(1) improve, (2) increased"
  },
  {
    "question": "(For this Question use Performance Manual SEP1 Fig. 2.1)\nCalculate the maximum estimated stall speed at 3400 lb:",
    "feedback": "68 kt"
  },
  {
    "question": "For a jet engine powered airplane which of the following corresponds to the speed for best L/D?",
    "feedback": "Speed for best endurance"
  },
  {
    "question": "(for this question use Performance Manual SEP1, Fig. 2.1)\nGiven:\nPressure Altitude: 1500 ftOutside Air Temperature (OAT): +18°CWind Component: 4 knots tailwindRunway: Hard, drySlope: Zero\nFor a take-off mass of 1270 kg, the take-off distance will be:",
    "feedback": "465 m"
  },
  {
    "question": "The effects of an increased ambient air temperature beyond the flat rating cut-off temperature of the engines on (i) the field length-limited take-off mass and (ii) the climb-limited take-off mass are:",
    "feedback": "(i) decrease (ii) decrease"
  },
  {
    "question": "An increase in atmospheric pressure has, among other things, the following consequences on landing performance:",
    "feedback": "a reduced landing distance and improved go-around performance"
  },
  {
    "question": "Which of the following combinations adversely affects take-off and initial climb performance ?",
    "feedback": "High temperature and high relative humidity"
  },
  {
    "question": "Which is the critical engine in case of an aeroplane with two piston engines (right-hand / clockwise rotating propellers) and an engine failure during take-off?",
    "feedback": "The left engine"
  },
  {
    "question": "During a descent a headwind will:",
    "feedback": "increase the angle of the descent flight path"
  },
  {
    "question": "(for this question use CAP 698, Fig. 3.6)\nGiven the following information, calculate the all-engines obstacle clearance of a multi-engined aeroplane commencing from the end of the take-off with the aircraft at reference zero.\nTake-off Mass: 4000 lbsAirport elevation: 6000 ftOAT: +16°CGround speed: 121 ktObstacle height: 2000 ft AGLObstacle distance: 15200 ft from reference zeroother conditions as per the graph",
    "feedback": "312 ft"
  },
  {
    "question": "A stopway, compared to a balanced condition for take-off, results in a ......",
    "feedback": "higher take-off mass and an increased V1"
  },
  {
    "question": "Which one of the following statements is true concerning the effect of changes of ambient temperature on an aeroplane's performance, assuming all other performance parameters remain constant?",
    "feedback": "A decrease will cause an increase of the climb gradient"
  },
  {
    "question": "Explain the difference, if any, between climb/descent angle and flight path angle:",
    "feedback": "Climb/descent angle is air mass related and the flight path angle is ground related"
  },
  {
    "question": "When calculating landing distance, wind correction factor must not be more than",
    "feedback": "50 % headwind  and 150 % tailwind"
  },
  {
    "question": "(for this question use Performance Manual MRJT1, Fig 4.21)\nDetermine the obstacle limit mass for the following conditions:\nObstacle height: 310 ftBrake release distance: 22000 ftOAT: +35°CPressure altitude: 2150 ftHeadwind: 20 ktsPMC: OnFlaps: 15°",
    "feedback": "51200 kg"
  },
  {
    "question": "A runway is contaminated with 0.5 cm of wet snow. The flight manual of a light twin nevertheless authorises a landing in these conditions.  The landing distance will be, in relation to that for a dry runway:",
    "feedback": "increased"
  },
  {
    "question": "(For this Question use Performance Manual MEP1 Fig. 3.7)\n\nGiven :\nO.A.T : 10 °C\nPressure Altitude:  2000 ft\nGross Mass:  3750 lbs\nMixture: full rich\nOther conditions as associated in the header of the graph\n\nWhat is the two engine rate of climb for the conditions given?",
    "feedback": "1770 ft/min"
  },
  {
    "question": "Complete the following statement regarding the take-off performance of an aeroplane in performance class A. Following an engine failure at (i) ........... and allowing for a reaction time of (ii) ........... a correctly loaded aircraft must be capable of decelerating to a halt within the (iii) .........",
    "feedback": "(i) V1  (ii) 2 seconds  (iii) Accelerate - stop distance available."
  },
  {
    "question": "Vx is defined as :",
    "feedback": "speed for best angle of climb"
  },
  {
    "question": "Given the following information, what is the distance from the end of the TODR to 1500 ft above reference zero for the purpose of obstacle clearance for a performance class B aeroplane?\nCloud base: 300 ft above reference zeroTAS: 101 kt No windAll engines rate of climb at take-off power: 1830 ft/minSingle engine rate of climb at take-off power: 400 ft/min",
    "feedback": "5.35 NM"
  },
  {
    "question": "When the outside air temperature increases, then",
    "feedback": "the field length limited take-off mass and the climb limited take-off mass decreases."
  },
  {
    "question": "Which statement with respect to the stepped climb is correct?",
    "feedback": "Executing a desired stepped climb at high altitude can be limited by buffet onset at g-loads larger than 1."
  },
  {
    "question": "The combination of factors that most requires a low-angled flap setting for take-off is:",
    "feedback": "high field elevation, distant obstacles in the climb-out path, long runway and a high ambient temperature"
  },
  {
    "question": "Which statement regarding V1 is correct?",
    "feedback": "V1 is not allowed to be greater than VR."
  },
  {
    "question": "Vx and Vy with take-off flaps will be:",
    "feedback": "lower than that for clean configuration."
  },
  {
    "question": "(For this Question use Performance Manual SEP1 Fig. 2.1)\nWith regard to the take off performance chart for the single engine aeroplane determine the take off speed for (1) rotation and (2) at a height of 50 ft.\n\nGiven :\nO.A.T :                             ISA+10°C\nPressure Altitude:             5000 ft\nAeroplane mass:              3400 lbs\nHeadwind component:       5 kt\nFlaps:                              up \nRunway:                          Tarred and Dry",
    "feedback": "71 and 82 KIAS"
  },
  {
    "question": "From 500 ft above the destination aerodrome to FL050, a multi-engine piston (MEP) aeroplane performs a steady climb, maintaining a constant speed of 120 kt IAS. During this climb, the \"power required vs. TAS\" curve will move (1) ...... and the \"power available vs. TAS\" curve will move (2) ......",
    "feedback": "(1) up and right, (2) down and right"
  },
  {
    "question": "You are crossing the threshold at a landing screen height of 67 ft. Compared to the standard screen height, what will be the effect on the landing distance?",
    "feedback": "Landing distance increases"
  },
  {
    "question": "At a given mass, the reference stalling speed of a twin engine turbo-prop aeroplane is 100 kt in the landing configuration. The minimum speed a pilot is permitted to maintain on short finals is:",
    "feedback": "123 kt"
  },
  {
    "question": "The diagram depicts a take-off distance versus V1 speed graph (AE=All Engines, EF=Engine Failure). Which speed corresponds to the balanced V1?",
    "feedback": "Speed D"
  },
  {
    "question": "(For this Question use Performance Manual SEP1 Fig. 2.4)\nWith regard to the landing chart for the single engine aeroplane determine the landing distance from a height of 50 ft .\n\nGiven :\nO.A.T :                         ISA +15°C\nPressure Altitude:          0 ft\nAeroplane Mass:           2940 lbs\nHeadwind component:   10 kt\nFlaps:                          Landing position (down) \nRunway:                      short and wet grass- firm soil\nCorrection factor (wet grass):  1.38",
    "feedback": "approximately :1794 feet"
  },
  {
    "question": "Determine the one engine-out climb gradient of a four-engined aeroplane, given:\nAeroplane mass: 358000 kgThrust per engine: 245000 NDrag: 455000 N(assume the acceleration due to gravity is 10 m/s2)",
    "feedback": "7.8 %"
  },
  {
    "question": "Refer to the Regulated Take-Off Mass (RTOM) table for runway 23L from take-off position VB. In each RTOM chart box, the following information is provided for a given wind component /outside temperature combination:\nMTOM/limitation code/V1/VR/V2 (+100 kt). Given the following information, determine the RTOM for departure.\nFor this question do not interpolate. Choose the most conservative figures at all times:\nW/V 14014KTOAT +10°CQNH 1008 hPaRunway WETEngine anti-ice ONPacks OFFQuick line-up",
    "feedback": "77110 kg"
  },
  {
    "question": "According to CS-25, the final take-off speed VFTO ......",
    "feedback": "may not be less than 1.18 VSR and must provide the minimum required climb gradient"
  },
  {
    "question": "(for this question use CAP 698, Figure 4.7)\nGiven the following information, what is the Maximum Take-Off Mass (MTOM) eventually limited by VMBE for the MRJT aeroplane?\nAirfield elevation: 111 ftSlope: 0.5 % upslopeQNH: 1013.25 hPaOAT: 41°CV1: 149 ktHeadwind: 10 kt",
    "feedback": "In excess of 68000 kg"
  },
  {
    "question": "The speed VSR is defined as:",
    "feedback": "as reference stall speed and may not be less than 1-g stall speed"
  },
  {
    "question": "During climb to the cruising level, a headwind component",
    "feedback": "decreases the ground distance flown during that climb."
  },
  {
    "question": "The take-off distance required increases",
    "feedback": "due to slush on the runway."
  },
  {
    "question": "The tangent from the origin to the power required against true airspeed curve, for a jet aeroplane, determines the speed for:",
    "feedback": "maximum endurance"
  },
  {
    "question": "Vne is defined as the",
    "feedback": "never exceed speed, which must not be higher than 0.9 times Vd"
  },
  {
    "question": "During take off, the time between critical engine failure and V1 (recognition time) is assumed to be approximately:",
    "feedback": "2 seconds"
  },
  {
    "question": "The Accelerate Stop Distance Available ASDA is the length of the take off run available plus the length ......",
    "feedback": "of the stopway, if provided"
  },
  {
    "question": "CS-23 and CS-25 use the term \"net take off flight path\" to describe certain performance elements. The net take off flight path (gradient) is the:",
    "feedback": "Actual flight path of the aeroplane reduced by a safety margin"
  },
  {
    "question": "For single-engined piston Performance Class B aeroplanes, which option provides the correct labels for the points on the power curve?",
    "feedback": "(1) Take-off/Climb, (2) Max. Endurance (Cruise), and (3) Max. Range (Cruise)"
  },
  {
    "question": "The graph shows take-off/rejected take-off distance for an aeroplane in given conditions. The balanced field is shown at distance:",
    "feedback": "A"
  },
  {
    "question": "Which of the following statements is correct? The climb gradient is:",
    "feedback": "Always larger than the angle of climb"
  },
  {
    "question": "A twin-engine, Class B aeroplane is flying straight and level when it loses one engine. The thrust required will (1) ...... and the excess thrust will (2) ......:",
    "feedback": "(1) increase, (2) decrease by more than 50 %"
  },
  {
    "question": "During a cruise flight of a jet aeroplane at constant flight level and at the maximum range speed, the IAS / the drag will:",
    "feedback": "decrease / decrease."
  },
  {
    "question": "The speed V2 is",
    "feedback": "the take-off safety speed."
  },
  {
    "question": "In relation to the net take-off flight path, the required 35 ft vertical distance to clear all obstacles is",
    "feedback": "the minimum vertical distance between the lowest part of the aeroplane and all obstacles within the obstacle corridor."
  },
  {
    "question": "If, after experiencing an engine failure when cruising above the one-engine-inoperative ceiling, an aeroplane is unable to maintain its cruising altitude, the procedure that should be adopted is:",
    "feedback": "Drift Down Procedure."
  },
  {
    "question": "(for this question use Performance Manual SEP1, Figure 2.2)\nWhat is the RTOM for the SEP, given:\nOAT: +40°CPA: 1200 ftDe-factored TOD 2000 ft, 10 kts HWFlaps: Approach setting",
    "feedback": "3500 lbs"
  },
  {
    "question": "Which of the following answers is true?",
    "feedback": "V1 is lower or equal to VR"
  },
  {
    "question": "At a given aerodrome the runway length, pressure altitude and OAT, as well as other data are known, and the flap setting for takeoff is selected to be flaps 10° to get maximum possible takeoff weight at this aerodrome.As the aircraft departs, the flap handle is erroneously set to 20°.  Now the takeoff performance",
    "feedback": "vs RWY increases"
  },
  {
    "question": "The allowable landing weight will:",
    "feedback": "Increase with uphill runway slope."
  },
  {
    "question": "The drift down procedure specifies requirements concerning the:",
    "feedback": "obstacle clearance during descent to the net level-off altitude"
  },
  {
    "question": "Which force compensates the weight in unaccelerated straight and level flight ?",
    "feedback": "the lift"
  },
  {
    "question": "What factors increase the Accelerate Stop Distance Required (ASDR)?",
    "feedback": "Higher V1"
  },
  {
    "question": "An operator shall ensure that the net take-off flight path clears all obstacles. The half-width of the obstacle-corridor at the distance D from the end of the TODA is at least:",
    "feedback": "90m + 0.125D"
  },
  {
    "question": "For this question use CAP 698, Figure 3.10\nGiven the following information for a Performance Class B aeroplane, what is the field-length limited landing mass and 50 ft barrier speed?\nOAT + 15°CAerodrome pressure altitude 6000 ft10 kt headwind componentDefactored landing distance 2075 ftShort field landing technique",
    "feedback": "3950 lbs, 77 kt"
  },
  {
    "question": "Which of the jet engine ratings below is not a certified rating?",
    "feedback": "Maximum Cruise Thrust"
  },
  {
    "question": "Which of the following statements is correct?",
    "feedback": "VTH is the correct speed when crossing the R/W threshold."
  },
  {
    "question": "Refer to the graph\nGiven:\nClimb power: Full throttleFlaps: UpTemperature: ISA + 15°CQNH: 1013 hPaWeight: 2950 lbsAirspeed: 120 kts KIASGear: retracted Wind: 10 kts headwind\nFind the approximate rate of climb for a flight at an altitude of 12000 ft:",
    "feedback": "1160 ft/min"
  },
  {
    "question": "Delays are expected at the arrival aerodrome at which a jet transport aeroplane plans to land. By managing the en-route airspeed, the pilot can increase the flight endurance by flying at ......",
    "feedback": "minimum drag speed (VMD) in clean configuration, which corresponds to the minimum required total thrust"
  },
  {
    "question": "Which of the following sets of factors will increase the climb-limited TOM (every factor considered independently)?",
    "feedback": "Low flap setting, low PA, low OAT."
  },
  {
    "question": "Reduced take-off thrust should normally not be used when:",
    "feedback": "windshear is reported on the take-off path."
  },
  {
    "question": "For a Class A aircraft, following an engine failure during take-off, what is the net take-off flight path?",
    "feedback": "It is the actual flight path reduced by a safety margin"
  },
  {
    "question": "With regard to a take-off from a wet runway, which of the following statements is correct?",
    "feedback": "The screen height can be lowered to reduce the mass penalties."
  },
  {
    "question": "The aeroplane, for which data are provided by the Buffet Onset Boundary Chart, is flying at FL350 through the tropics in the late afternoon. Ahead of the aeroplane is an extended line of thunderstorms. If the 1.4 g buffet range is Mach 0.79 to 0.81, which of the following answers is the most appropriate operational decision?",
    "feedback": "Descend to FL330 where the 1.4 g buffet margin is Mach 0.73 to greater than Mach 0.84 and navigate laterally between the thunderstorm cells"
  },
  {
    "question": "The landing field length required for turbojet aeroplanes at the destination (wet condition) is the demonstrated landing distance plus",
    "feedback": "92%"
  },
  {
    "question": "Which of the following will decrease V1?",
    "feedback": "Inoperative anti-skid."
  },
  {
    "question": "Calculate the V2 for a four engine jet a/c with this performance:\nVsr=106 Kt, Vmca=113 Kt.",
    "feedback": "124,3 Kt."
  },
  {
    "question": "Considering the take-off decision speed V1, which of the following is correct?",
    "feedback": "If an engine failure is recognized before reaching V1, the take-off must be aborted"
  },
  {
    "question": "The endurance for a turbojet aeroplane....",
    "feedback": "increases up to an optimum altitude, then decreases"
  },
  {
    "question": "How does the thrust of fixed propeller vary during take-off run, assuming unstalled flow conditions at the propeller blades ? The thrust",
    "feedback": "decreases while the aeroplane speed builds up"
  },
  {
    "question": "(For this Question use Performance Manual SEP1 Fig. 2.3)\nUsing the climb performance chart, for the single engine aeroplane, determine the rate of climb and the gradient of climb in the following conditions:\nGiven : \nO.A.T at Take-off:                     ISA\nAirport pressure altitude:           3000 ft\nAeroplane mass:                      3450 lbs\nSpeed:                                    IAS 100 kts, TAS 120 kts",
    "feedback": "1130 ft/min and 9,3%"
  },
  {
    "question": "Considering a rate of climb diagram (ROC versus TAS) for an aeroplane. Which of the diagrams shows the correct curves for \"flaps down\" compared to \"clean\" configuration?",
    "feedback": "a"
  },
  {
    "question": "The speed range between low speed buffet and high speed buffet:",
    "feedback": "decreases with increasing mass and increasing altitude"
  },
  {
    "question": "(For this Question use Performance Manual MEP1 Fig. 3.1)\n\nGiven :\nO.A.T : 24 °C\nPressure Altitude:  3000 ft\nTake off Mass:  3800 lbs\nWind:  080/12kt\nRWY: 12L\nHeavy Duty Brakes installed\nOther conditions as associated in the header of the graph\n\nWhat is the ground roll distance under the conditions given?",
    "feedback": "1350 ft"
  },
  {
    "question": "The Density Altitude",
    "feedback": "is used to determine the aeroplane performance."
  },
  {
    "question": "(for this question use Performance Manual MRJT1, Fig. 4.25)\nGiven the following information and assuming a drift down after engine failure, what is the time travelled, ground distance travelled,  and fuel burned from the point of engine failure?\nDrift down from pressure altitude: 33000 ftDrift down to pressure altitude: 16000 ftGross Mass at engine failure: 58050 kgOAT: ISA -20°CTailwind: 25 KTBleed configuration: Engine anti-ice on A/C Auto (High)",
    "feedback": "31 min, 182 NM, 1150 kg"
  },
  {
    "question": "The effect that an increased outside air temperature has on the climb performance of an aeroplane is that it:",
    "feedback": "reduces both the climb gradient and the rate of climb"
  },
  {
    "question": "A turbojet aeroplane in straight and level flight is cruising at FL290. For a given mass and CG position, how will the high speed buffet and low speed buffet as an IAS vary when the flight is operated at FL330?",
    "feedback": "The low speed buffet increases and the high speed buffet decreases"
  },
  {
    "question": "(for this question use Performance Manual SEP1, Fig. 2.4)\nGiven the following information, determine the minimum or maximum wind component for the SEP aircraft to land:\nPressure Altitude: 10000 ftMass: 2860 lbsTemperature: -2°CRunway LDA: 2000 ft",
    "feedback": "Minimum 19 kt headwind"
  },
  {
    "question": "Which of the following statements is correct?",
    "feedback": "The climb limited take-off mass is independent of the wind component"
  },
  {
    "question": "For a jet aeroplane, the speed for maximum range is:",
    "feedback": "that corresponding to the point of contact of the tangent from the origin to the Drag versus TAS curve"
  },
  {
    "question": "Refer to the figure.\nGiven:\nTOW: 320 tWind: 5 kt (tail)PA: 6000 ftOAT: 30°CSlope: -1%\nUse the given values and find speeds V1, VR, V2(rounding to the next whole number)",
    "feedback": "V1 = 143 KIAS, VR = 159 KIAS, and V2 = 169 KIAS"
  },
  {
    "question": "(For this Question use Performance Manual SEP1 Fig. 2.4)\nWith regard to the landing chart for the single engine aeroplane determine the landing distance from a height of 50 ft .\n\nGiven :\nO.A.T : ISA +15°C\nPressure Altitude:  0 ft\nAeroplane Mass:  2940 lbs\nHeadwind component:  10 kt\nFlaps:  Landing position (down) \nRunway: Tarred and Dry",
    "feedback": "approximately : 1300 feet"
  },
  {
    "question": "How is wind considered in the take-off performance data of the Aeroplane Operations Manuals ?",
    "feedback": "Not more than 50% of a headwind and not less than 150% of the tailwind."
  },
  {
    "question": "The MSTOM of a multi-engine piston aeroplane is 12500 lbs. Referring to the given table, find the maximum regulated take-off mass with 10° flaps under the following conditions (dry, level runway, zero wind):\nASDA: 7910 ftTORA: 6090 ftTODA: 6880 ftPA: 2000 ftOAT: 20°C",
    "feedback": "10500 lbs"
  },
  {
    "question": "Determine the ASDA for runway 09, given:\nTORA: 2300 mStopway: 280 mClearway: 480 m",
    "feedback": "2580 m"
  },
  {
    "question": "(for this question use Performance Manual MEP1, Fig. 3.8)\nFind the balked landing climb gradient if the temperature is 20°C and the pressure altitude of the airfield is 4000 ft:",
    "feedback": "8.6 %"
  },
  {
    "question": "The optimum speed for maximum Specific Range (SR) for a propeller-driven aeroplane is minimum....",
    "feedback": "drag speed VMD"
  },
  {
    "question": "A turbojet aeroplane is flying long range cruise speed (LRC). A deviation of +/- 1000 ft from the optimum LRC altitude leads to change in specific range of 2.5 %. If the aircraft is flying 1000 ft above (1) or 2000 ft below (2) the optimum altitude, the specific range would change as follows:",
    "feedback": "(1) - 2.5 %, (2) - 5 %"
  },
  {
    "question": "According to EASA CS 25.119, the landing climb phase on the aircraft is tested using which of the following thrust movements?",
    "feedback": "Movement from flight idle to TOGA thrust"
  },
  {
    "question": "(for this question use Performance Manual MEP1, Fig. 3.2)\nGiven:\nOAT: 25°CPressure Altitude: 3200 ftRWY: 26LWind: 31020KTTake-off Mass: 4400 lbsHeavy Duty Brakes: Installed\nOther conditions as associated in the header of the chart.\nWhat is the accelerate and stop distance under the conditions given?",
    "feedback": "3500 ft"
  },
  {
    "question": "If you were performing the downwind leg at the Addison airport in Texas with a strong tailwind, after turning to final what must you do?",
    "feedback": "Increase engine power to stay on the correct glide path because the headwind will cause your glide path angle to increase"
  },
  {
    "question": "Which of the following statements is correct in relation to a turbojet engine's Specific Fuel Consumption (SFC)?",
    "feedback": "SFC decreases at higher altitudes and colder ambient temperatures"
  },
  {
    "question": "Consider the following information and assume a drift down after engine failure. Refer to the table. What is the time travelled, distance travelled and fuel used from engine failure?\nAltitude at engine failure: 36000 ftWhight (mass) at engine failure: 34000 lb",
    "feedback": "29 minutes, 128 NM, 675 lb"
  },
  {
    "question": "Other factors remaining constant, the effect an increase of altitude, in a standard atmosphere, has on the value of Vx and Vy in terms of TAS is:",
    "feedback": "both will increase"
  },
  {
    "question": "(For this Question use Performance Manual SEP1 Fig. 2.2)\nWith regard to the take off performance chart for the single engine aeroplane determine the take off distance to a height of 50 ft.\n\nGiven :\nO.A.T :                            38°C\nPressure Altitude:            4000 ft\nAeroplane Mass:              3400 lbs\nTailwind component:         5 kt\nFlaps:                             Approach setting\nRunway:                         Dry Grass\nCorrection factor:             1.2",
    "feedback": "approximately : 3840 ft"
  },
  {
    "question": "Which of the following provides maximum obstacle clearance during climb?",
    "feedback": "The speed for maximum climb angle Vx."
  },
  {
    "question": "The length of a clearway may be included in:",
    "feedback": "the take-off distance available."
  },
  {
    "question": "Which combination of circumstances or conditions would most likely lead to a tyre speed limited take-off?",
    "feedback": "A high runway elevation and tail wind."
  },
  {
    "question": "You climb with a climb speed schedule 300/.78. What do you expect in the crossover altitude 29 200 ft (OAT = ISA) ?",
    "feedback": "The rate of climb increases since the constant IAS-climb is replaced by the constant Mach-climb."
  },
  {
    "question": "(for this question use Performance Manual MEP1, Fig. 3.9)\nGiven the following information for a Performance Class B aeroplane, what is the landing distance required?\nPressure Altitude: 3000 ftOAT: 0°CLanding Mass: 4250 lbsHeadwind Component: 10 ktRunway Condition: DryRunway Slope: 1% up",
    "feedback": "3400 ft"
  },
  {
    "question": "for this question use CAP 698, Figure 4.9\nGiven:Aircraft: Medium range jet (MRJT)Runway: 27, 0.1 % downslopeTemperature (OAT): +42°CPressure altitude (PA): 111 ftRegulated take-off mass (RTOM): 59300 kgTake-off mass (TOM): 50810 kgWind: 18010 KTFlaps: 15°\nDetermine V1, VR, V2:",
    "feedback": "V1 = 125 kt, VR = 126 kt, V2 = 135 kt"
  },
  {
    "question": "Assuming other factors remaining constant and not limiting, increasing the aerodrome pressure altitude:",
    "feedback": "will cause the maximum permitted take-off mass to decrease"
  },
  {
    "question": "(for this question use Performance Manual MEP1, Fig. 3.1)\nGiven the following information, what is the Field Length Limited Take-Off Mass?\nTORA: 2000 ftTODA: 3000 ft including Stopway/Clearway of 600 ft/400 ftASDA: 2500 ft including Stopway of 600 ftRunway: Paved and dryAirfield PA: 4000 ftAirfield Temperature: +15°CHeadwind Component: 10 kt",
    "feedback": "4300 lbs"
  },
  {
    "question": "The correct formula is:\n(Remark \"<=\" means \"equal to or lower\"",
    "feedback": "VMCG <= VEF < V1"
  },
  {
    "question": "Regarding take-off, the take-off decision speed V1:",
    "feedback": "is the airspeed on the ground at which the pilot is assumed to have made a decision to continue or discontinue the take-off"
  },
  {
    "question": "How does the specific range change when the altitude increases for a jet aeroplane flying with the speed for maximum range?",
    "feedback": "First increases then decreases"
  },
  {
    "question": "Some of the certification requirements for large aeroplanes described in CS-25 are the performance data defined as gradients of the flight path and the net take-off flight path. What is the difference between those two factors?",
    "feedback": "The net take-off flight path gradient is the flight path gradient reduced by prescribed safety margins, which depend on the number of engines"
  },
  {
    "question": "Select the correct option from the statements below:\nWith regard to turbojet aeroplanes, wind (1) ...... endurance and (2) ....... the maximum endurance speed.",
    "feedback": "(1) does not affect, (2) does not affect"
  },
  {
    "question": "for this question use CAP 698, figure 4.23\nOwing to some last-minute airspace closures, a passenger flight over southern Europe has been re-routed from its normal flight plan. The flight crew have noticed that the primary en-route diversion would require a one-engine-inoperative net level-off altitude of 16000 ft to stay above the highest relevant obstacles.\nDetermine the maximum net mass that would allow clearance of the highest relevant obstacles, given:\nMinimum off-route pressure altitude: 16000 ftTemperature: ISA +10°CA/C: AUTO (HIGH)ANTI-ICE: All OFF\n(note: for this question ignore any altimetry issues)",
    "feedback": "54100 kg"
  },
  {
    "question": "(for this question use Performance Manual SEP1, Figure 2.2)\nWith regard to the take-off performance chart for the single engine aeroplane determine the take-off distance to a height of 50 ft. Given:\nOAT: -7°CAltitude: 5800 ftQNH: 973 hPaAeroplane Mass: 2950 lbsHeadwind: 5 ktsFlaps: Approach settingRunway: Tarred and dry",
    "feedback": "1950 ft"
  },
  {
    "question": "ETOPS flight is a twin engine jet aeroplane flight conducted over a route, where no suitable airport is within an area of",
    "feedback": "60 minutes flying time in still air at the approved one engine out cruise speed."
  },
  {
    "question": "An aeroplane is maintaining FL350 at M0.78 (262 kt CAS), when an engine failure forces the pilot to commence a driftdown procedure. The three driftdown strategies below, assume that MCT (Maximum Continuous Thrust) is set on the remaining engine(s) prior to commencing the driftdown, if possible. Which one of the statements is correct?\nStandard strategy: M0.78/300 ktObstacle strategy: Minimum drag speed VMD (241 kt CAS)ETOPS strategy: M0.80/340 kt",
    "feedback": "For the Obstacle strategy, decelerating to VMD before commencing the descent improves the obstacle clearance"
  },
  {
    "question": "Which of the following factors determines the maximum flight altitude in the \"Buffet Onset Boundary\" graph?",
    "feedback": "Aerodynamics."
  },
  {
    "question": "(for this question refer to Performance Manual MRJT1, 2.5.2, and Fig. 4.8)\nCalculate the take-off speeds V1, VR, and V2, given:\nMass: 60000 kgPA: 1500 ftOAT +25°CFlaps: 5°Wind: 5 kts tailSlope: 1% down",
    "feedback": "V1 = 143, VR = 148, V2 = 155"
  },
  {
    "question": "(for this question use Performance Manual MRJT1, Fig. 4.25)\nGiven the following information and assuming a drift down after engine failure, what is the time travelled and fuel burned during the drift down?\nDrift down from pressure altitude: 33000 ftDrift down to pressure altitude: 20000 ftGross Mass at engine failure: 55000 kgConditions: ISA, no wind",
    "feedback": "23 min, 750 kg"
  },
  {
    "question": "Due to the weather conditions, the bleed air system are turned on during the take-off. The take-off distance is ......",
    "feedback": "increased, as less thrust is available"
  },
  {
    "question": "For a performance class B MEP aircraft, calculate the obstacle clearance, given the following data:\nTAS: 133 ktTailwind: 10 ktClimb gradient: 5 %Obstacle height: 400 ftDistance from runway end: 1.5 NM\nGD x TAS/GS X (Climb Grad / 100) = Height",
    "feedback": "74 ft"
  },
  {
    "question": "(For this Question use Performance Manual MEP1 Fig. 3.2)\n\nGiven :\nO.A.T : 25 °C\nPressure Altitude:  3000 ft\nTake off Mass:  4400 lbs\nWind:  310/20 kt\nRWY: 26L\nHeavy Duty Brakes installed\nOther conditions as associated in the header of the graph\n\nWhat is the accelerate and stop distance under the conditions given?",
    "feedback": "3500 ft"
  },
  {
    "question": "The one engine out take-off run is the distance between the brake release point and:",
    "feedback": "the middle of the segment between VLOF point and 35 ft point."
  },
  {
    "question": "(for this question use Performance Manual MEP1, Fig. 3.3)\nWith reference to the graph and given the following data, what distance must you enter the graph with to determine the Field Length Limiting Take-Off Mass FLLTOM)?\nPA: 2000 ftOAT: +30°CWind: 5 kt tailClimb Speed: 100 ktsRWY: 09TORA: 2400 ftASDA: 2500 ftTODA: 2600 ft",
    "feedback": "1923 ft"
  },
  {
    "question": "In accordance to CS-25 which of the following listed speeds are used for determination of V2min?",
    "feedback": "VSR, VMCA"
  },
  {
    "question": "A jet aeroplane is performing a maximum range flight.\nThe speed corresponds to:",
    "feedback": "the point of contact of the tangent from the origin to the Drag versus TAS curve."
  },
  {
    "question": "(for this question use Performance Manual MRJT1, Fig. 4.4)\nFor a twin engine turbojet aeroplane two take-off flap settings (5° and 15°) are certified. Using the chart, what is the maximum allowed take-off mass, given the following conditions:\nAirport Pressure Altitude: 7000 ftOutside Air Temperature (OAT): -10°CField length available: 2400 mWind: CalmRunway slope: LevelPMC: OnA/C: Auto",
    "feedback": "56000 kg"
  },
  {
    "question": "Which of the graphs illustrate the power change with decreasing altitude?",
    "feedback": "Figure 3"
  },
  {
    "question": "With a jet aeroplane the maximum climb angle can be flown at approximately:",
    "feedback": "the maximum CL/CD ratio."
  },
  {
    "question": "Any acceleration in climb, with a constant power setting,",
    "feedback": "decreases the rate of climb and the angle of climb."
  },
  {
    "question": "A four jet-engined aeroplane (mass = 150 000 kg) is established on climb with all engines operating. The lift-to-drag ratio is 14. Each engine has a thrust of 75 000 Newtons. The gradient of climb is: (given: g= 10 m/s²)",
    "feedback": "12.86%."
  },
  {
    "question": "For a given aeroplane mass, a more aft CG position will .......",
    "feedback": "decrease the take-off distance and improve the take-off climb performance"
  },
  {
    "question": "(for this question use Performance Manual SEP1, Fig. 2.4)\nGiven:\nAirport PA: 4000 ftOAT: +20°CHeadwind Component: 15 ktLanding Mass: 3300 lb\nWhat is the ground roll under these conditions?",
    "feedback": "850 ft"
  },
  {
    "question": "You are preparing for departure at an airfield with two runways, one is reported as contaminated and the other is reported as wet. Which of the following statements is correct?",
    "feedback": "A derated thrust take-off is allowed on either runway"
  },
  {
    "question": "Under what circumstances can the improved climb performance procedure be used?",
    "feedback": "If sufficient excess runway is available, the climb limited take-off mass and the climb gradient can be increased by increasing V2"
  },
  {
    "question": "(For this Question use Performance Manual SEP1 Fig. 2.4)\nPlanning a flight in a single engine aeroplane. With regard to the landing chart determine the landing distance required at the destination aerodrome.\nGiven :\nOAT : 0 °C Pressure Altitude: 1000 ft Aeroplane Mass: 3500 lbs Tailwind component: 5 kt Flaps: Landing position (down)  Runway: Tarred and wetRunway Slope: 1% down slope",
    "feedback": "2950 ft"
  },
  {
    "question": "A crew preparing for departure select an assumed temperature of 45°C for the determining of takeoff thrust setting. The OAT is 20°C. What is the performance implication from the difference between the selected temperature and the actual OAT?",
    "feedback": "Taking off with a selected temperature of 45°C and an actual OAT of 20°C would result in the same performance as if the OAT were 45°C"
  },
  {
    "question": "Which one of the following statements concerning drift down is correct?",
    "feedback": "When determining the obstacle clearance during drift down, fuel dumping may be taken into account"
  },
  {
    "question": "How does airplane weight influence best angle of glide?",
    "feedback": "Glide angle is not affected by airplane weight"
  },
  {
    "question": "A jet aeroplane is descending en route from cruise altitude at idle thrust. If ATC requests the crew to descend to a given flight level by a given point such that it requires a steeper descent gradient, this could be achieved by ......",
    "feedback": "increasing the airspeed"
  },
  {
    "question": "At a constant Mach number the thrust and the fuel flow of a jet engine",
    "feedback": "decrease with decreasing ambient pressure at constant temperature."
  },
  {
    "question": "(for this question use Performance Manual MRJT1, Fig. 4.23)\nGiven:\nObstacle pressure altitude: 16000 ftRequired obstacle clearance: 2000 ftEngine anti-ice: OnAir conditioning (A/C): AutoTemperature (OAT): ISA +10°C\nWith reference to the given values and by using the graph, which maximum mass can be used to clear the obstacle with one engine inoperative (OEI)?",
    "feedback": "49250 kg"
  },
  {
    "question": "Refer to the graph\nGiven:\nLanding mass: 3000 lbsAirport elevation: 1500 ftQNH 996 hPaTemperature: 16°CWind: 5 kts tailRunway surface: dry grassRunway upslope: 1%Indicated airspeed: 74 ktsFlaps: 33°\nDetermine the landing distance from 50 ft above the threshold for a commercial aeroplane. Choose the closest answer.",
    "feedback": "1064 m"
  },
  {
    "question": "A twin jet aeroplane is in cruise, with one engine inoperative, and has to overfly a high terrain area. In order to allow the greatest clearance height, the appropriate airspeed must be the airspeed",
    "feedback": "of greatest lift-to-drag ratio."
  },
  {
    "question": "VSR1 is the:",
    "feedback": "Reference stall speed in a specific configuration"
  },
  {
    "question": "Which is the critical engine in case of an aeroplane with two piston engines (left-hand / anti-clockwise rotating propellers) and an engine failure during take-off?",
    "feedback": "the right engine"
  },
  {
    "question": "(For this Question use Flight Planning & Monitoring SEP1 Fig. 2.2.3). Using the Power Setting Table, for the single engine aeroplane, determine the manifold pressure and fuel flow (lbs/hr) with full throttle and cruise lean mixture in the following conditions:\n\nGiven:\nOAT:                          13°C\nPressure altitude:        8000 ft\nRPM:                         2300",
    "feedback": "22,4 in.Hg and  69,3 lbs/hr"
  },
  {
    "question": "In which of the flight conditions listed below is the thrust required equal to the drag?",
    "feedback": "In level flight with constant IAS"
  },
  {
    "question": "Which statement with respect to the stepped climb is correct?",
    "feedback": "Performing a stepped climb based on economy can be limited by the 1.3-g buffet onset requirements"
  },
  {
    "question": "A jet aeroplane is climbing at constant Mach number below the tropopause. Which of the following statements is correct?",
    "feedback": "IAS decreases and TAS decreases."
  },
  {
    "question": "(for this question use Performance Manual MRJT1, Fig. 4.4)\nWhat is the maximum brake release mass when the following data is giiven?\nPressure altitude: 6000 ftField length available 7500 ftUpslope: 2%Tailwind: 5 ktsFlaps: 15°OAT: - 20°CA/C: AutoAnti-ice: OffPMC: Off",
    "feedback": "50340 kg"
  },
  {
    "question": "Which statement regarding the influence of a runway down-slope is correct for a balanced take-off? Down-slope...",
    "feedback": "reduces V1 and reduces take-off distance required (TODR)."
  },
  {
    "question": "An aircraft is climbing at a maximum climb angle with constant speed and thrust. Consider for theoretical purposes that the weight of the aircraft suddenly decreases but the flight otherwise continues as normal. For the pilot to maintain the same speed, all factors remaining the same, the angle of climb must be ......",
    "feedback": "increased, to increase the backward component of weight in order to match the excess thrust"
  },
  {
    "question": "The optimum altitude",
    "feedback": "increases as mass decreases and is the altitude at which the specific range reaches its maximum."
  },
  {
    "question": "The effect of a tailwind on the glide angle and the rate of descent assuming same CAS will be:",
    "feedback": "decreases\t\tand\tremains the same"
  },
  {
    "question": "The vertical interval by which a Class A aeroplane must avoid all obstacles in the drift down path, during the drift down following an engine failure is:",
    "feedback": "2000 ft"
  },
  {
    "question": "(for this question use Performance Manual MRJT1, Fig 4.29)\nGiven:\nOAT: ISA +30°CPA: 4000 ftAC: AutoFlaps: 40°No Icing below +8°C during flight\nDetermine the Landing Climb Limit:",
    "feedback": "52500 kgs"
  },
  {
    "question": "Which is the correct sequence of speeds during take-off?",
    "feedback": "VMCG, V1, VR, V2."
  },
  {
    "question": "With all engines out, a pilot wants to fly for maximum time. Therefore he has to fly the speed corresponding to:",
    "feedback": "the minimum power"
  },
  {
    "question": "Given the following information, what is the all engine climb gradient for a two engine aeroplane?\nThrust per engine: 118000 NewtonsMass: 67000 kgLift to drag ratio: 9:1Assume g = 10 m/s2",
    "feedback": "24.1 %"
  },
  {
    "question": "What is the best combination of slats and flaps for climb performance?",
    "feedback": "Small slat angle, small flap angle"
  },
  {
    "question": "The best rate of climb at a constant gross mass",
    "feedback": "decreases with increasing altitude since the thrust available decreases due to the lower air density."
  },
  {
    "question": "For turboprop aircraft >5700 kg in transport CAT, the runway length requirements for landing at the alternate airport is",
    "feedback": "70 % of runway length available"
  },
  {
    "question": "For a take-off from a contaminated runway, which of the following statements is correct?",
    "feedback": "The performance data for take-off must be determined in general by means of calculation, only a few values are verified by flight tests."
  },
  {
    "question": "Which of the following statements is correct?",
    "feedback": "VR is the speed at which the pilot should start to rotate the aeroplane"
  },
  {
    "question": "Determine the minimum speed at 50 ft above the take-off surface level if the aircraft is an aeroplane with a single engine and a VS1 of 57 kt:",
    "feedback": "69 kt"
  },
  {
    "question": "(for this question use CAP 698, Figure 4.7)\nGiven the following information, what is the Maximum Take-Off Mass (MTOM) eventually limited by VMBE for the MRJT aeroplane?\nAirfield elevation: 1998 ftSlope: 0.2% downQNH: 1013.25 hPaOAT: 38°CV1: 145 ktTailwind: 5 kt",
    "feedback": "Approximately 68000 kg"
  },
  {
    "question": "Which of the following statements is correct?",
    "feedback": "A stopway is an area beyond the take-off runway designated for decelerating and  able to support the aeroplane during an aborted take-off."
  },
  {
    "question": "How is VMCA influenced by increasing pressure altitude?",
    "feedback": "VMCA decreases with increasing pressure altitude."
  },
  {
    "question": "Consider the graphic representation of the power required versus true air speed (TAS), for a jet aeroplane with a given mass. When drawing the tangent out of the origin, the point of contact determines the speed of:",
    "feedback": "maximum endurance."
  },
  {
    "question": "According to the obstacle  requirements the take-off path may by curved, but bank angle must not exceed",
    "feedback": "15°"
  },
  {
    "question": "The speed V1 is defined as",
    "feedback": "take-off decision speed."
  },
  {
    "question": "Given that the characteristics of a three engine turbojet aeroplane are as follows: Thrust = 50 000 Newton / Engine g = 10 m/s² Drag = 72 569 N Minimum gross gradient (2nd segment) = 2.7% SIN(Angle of climb) = (Thrust- Drag) / Weight The maximum take-off mass under 2nd segment conditions is:",
    "feedback": "101 596 kg"
  },
  {
    "question": "Which of the following speeds can be limited by the 'maximum tyre speed'?",
    "feedback": "Lift-off groundspeed."
  },
  {
    "question": "For multiengine airplanes with MTOW < 5700 kg. the landing distance must not exceed:",
    "feedback": "0.7 x runway length of landings distance available"
  },
  {
    "question": "The MSTOM of a multi-engine piston aeroplane is 12500 lbs. Referring to the given table, find the maximum regulated take-off mass with 10° flaps under the following conditions (dry, level runway, zero wind):\nASDA: 5970 ftTORA: 4730 ftTODA: 5320 ftPA: 4000 ftOAT: -10°C",
    "feedback": "9500 lbs"
  },
  {
    "question": "(For this Question use Performance Manual MEP1 Fig. 3.1)\n\nGiven :\nO.A.T : 24 °C\nPressure Altitude:  3000 ft\nTake off Mass:  3800 lbs\nWind:  080/12kt\nRWY: 12L\nHeavy Duty Brakes installed\nOther conditions as associated in the header of the graph\n\nWhat is the take-off distance under the conditions given?",
    "feedback": "1700 ft"
  },
  {
    "question": "A flight is planned with a turbojet aeroplane to an aerodrome with a landing distance available of 2400 m. Which of the following is the maximum landing distance for a dry runway?",
    "feedback": "1 440 m."
  },
  {
    "question": "Changing the take-off flap setting from flap 15° to flap 5° will normally result in :",
    "feedback": "a longer take-off distance and a better climb."
  },
  {
    "question": "You are taking off in a Class A aircraft. Between 200 and 400 ft more bank than the standard regulatory limit is required. What is the vertical obstacle clearance during the turn and is it a gross or a net factor?",
    "feedback": "50 ft, net"
  },
  {
    "question": "At constant thrust and constant altitude the fuel flow of a jet engine",
    "feedback": "increases slightly with increasing airspeed."
  },
  {
    "question": "Refer to CAP 698, fig. 3.9\nDetermine the field-length limited landing mass and 50 ft barrier speed, given:\nOAT: 0°CPressure Altitude: 2000 ftTailwind component: 5 ktDefactored landing distance: 2600 ftNormal landing technique",
    "feedback": "3250 lb, 78 kt"
  },
  {
    "question": "Compared to a more forward position, a Centre of Gravity close to, but not beyond, the aft limit:",
    "feedback": "improves the maximum range"
  },
  {
    "question": "For a propeller aeroplane with a naturally aspirated engine (not turbocharged), how does the maximum TAS in level flight vary with increasing altitude?\nThe maximum achievable TAS will ......",
    "feedback": "decrease steadily"
  },
  {
    "question": "What is the difference between climb angle and climb gradient?",
    "feedback": "The value of the gradient is always higher than the value of the angle"
  },
  {
    "question": "(for this question use Performance Manual MEP1, Fig. 3.6)\nGiven:\nTake-off mass: 4000 lbsTemperature (OAT): -22°CPower: Below max. cont.\nThe single engine service ceiling of the aircraft is approximately:",
    "feedback": "18500 ft"
  },
  {
    "question": "Which of the following statements about performance definitions and safety factors is correct?",
    "feedback": "The net climb gradient is the gross climb gradient minus a safety margin"
  },
  {
    "question": "Refer to the graph\nGiven:\nClimb power: Full throttle/2500 RPMAltitude: 6500 ftTemperature: ISA + 15°CQNH: 1030 hPaWeight: 1250 kg\nFind the rate of climb:",
    "feedback": "1420 ft/min"
  },
  {
    "question": "Why should the temperature of the wheel brakes be checked prior to take off?",
    "feedback": "Because overheated brakes will not perform adequately in the event of a rejected take-off."
  },
  {
    "question": "If an aircraft experiences a headwind component of 5 kt, how will it affect the range?",
    "feedback": "Range will decrease"
  },
  {
    "question": "Given a runway of unrestricted length, with oceanic views and a high pressure altitude, what, for a heavy aircraft at a constant IAS, are the effects on performance factors?",
    "feedback": "Long take-off, a low climb angle, but VMC (IAS) will be reduced"
  },
  {
    "question": "(For this Question use Performance Manual SEP1 Fig. 2.4)\nWith regard to the landing chart for the single engine aeroplane determine the landing distance from a height of 50 ft .\n\nGiven :\nO.A.T :                       ISA\nPressure Altitude:       1000 ft\nAeroplane Mass:         3500 lbs\nTailwind component:    5 kt\nFlaps:                        Landing position (down) \nRunway:                    Tarred and Dry",
    "feedback": "approximately : 1700 feet"
  },
  {
    "question": "If  T/0 weight is limited by Climb Requirements (A/C weight > 5700kg), then it means:",
    "feedback": "That at higher T/0 weight certain climb gradients during the T/O climb cannot be attained in case of an engine failure"
  },
  {
    "question": "VR cannot be lower than:",
    "feedback": "V1 and 105% of VMCA."
  },
  {
    "question": "Required net climb gradients in the 1st segment for  3-engine aircraft with one engine out are:",
    "feedback": "0,3%"
  },
  {
    "question": "The lowest point of the drag or thrust required curve of a jet aeroplane, respectively, is the point for",
    "feedback": "minimum drag."
  },
  {
    "question": "During take-off, what are the consequences of mistakenly using a dry V1 on a wet runway? The actual Accelerate Stop Distance (ASD) required ....",
    "feedback": "will be longer, because of the reduced braking capability"
  },
  {
    "question": "Considering drift down requirement which one of the statements are correct?",
    "feedback": "Service ceiling at alternate airport must be at least 1500 AGL"
  },
  {
    "question": "Compared with balanced-field calculations for an aerodrome with no stopway or clearway, the use of a clearway in the take-off calculations will:",
    "feedback": "increase the field-length-limited take-off mass"
  },
  {
    "question": "Maximum endurance for a Turboprop aircraft with 10 kt headwind is achieved at (1) ...... and the maximum endurance speed (2) ......",
    "feedback": "(1) VMP, (2) remains the same"
  },
  {
    "question": "A turbojet airplane is flying at its cruising altitude and the outside air temperature increases. The following is going to happen:\n(SR=specific range, SFC=specific fuel consumption)",
    "feedback": "SR decreases, SFC increases"
  },
  {
    "question": "(For this Question use Performance Manual MEP1 Fig. 3.7)\n\nGiven :\nO.A.T : -20 °C\nPressure Altitude:  18000 ft\nGross Mass:  4000 lbs\nMixture: leaned to 25°F rich of peak EGT\nOther conditions as associated in the header of the graph\n\nWhat is the two engine rate of climb for the conditions given?",
    "feedback": "1050 ft/min"
  },
  {
    "question": "A single-engined piston aeroplane is flying at an altitude of 5000 ft wich a constant tailwind component of 15 KT. Given the following information, if the engine fails at this altitude, what would be the expected net glide distance over ground with an elevation of 300 ft?\nAeroplane gross gradient: 10 %TAS: 120 KT\nAssume 1 NM=6080 ft and ground distance = still air distance x (GS/TAS)",
    "feedback": "8.3 NM"
  },
  {
    "question": "(for this question use Performance Manual SEP1, Figure 2.1)\nWith regard to the take-off performance chart for the single engine aeroplane determine the take-off distance to a height of 50 ft. Given:\nOAT: -7°CPressure Altitude: 7000 ftAeroplane Mass: 2950 lbsHeadwind: 5 ktsFlaps: UpRunway: Tarred and dry",
    "feedback": "2050 ft"
  },
  {
    "question": "Which of the following is true according to EASA regulations for turbopropeller powered aeroplanes not performing a steep approach?",
    "feedback": "Maximum Landing Distance at the destination aerodrome and at any alternate aerodrome is 0,7 x LDA (Landing Distance Available)."
  },
  {
    "question": "The distances X, Y, Z and W are defined as:",
    "feedback": "LDA, TORA, ASDA, TODA"
  },
  {
    "question": "If the take-off mass of an aeroplane is brake energy limited a higher uphill slope would",
    "feedback": "increase the maximum mass for take-off."
  },
  {
    "question": "From FL050 to 500 ft above the destination aerodrome, a multi-engine piston (MEP) aeroplane performs a steady descent, maintaining a constant speed of 120 kt IAS. During this descent, the \"power required vs. TAS\" curve will move (1) ...... and the \"power available vs. TAS\" curve will move (2) ......",
    "feedback": "(1) down and left, (2) up and left"
  },
  {
    "question": "Vmca is defined as the minimum speed at which directional control can be maintained in flight with an engine failure in a defined configuration which include:",
    "feedback": "zero yaw"
  },
  {
    "question": "What is the maximum bank angle in segments 1 and 2 for a standard take-off procedure and what, if any, is the effect on stall speed and V2?\nThe maximum bank angle is....",
    "feedback": "15° only, leading to a small increase in stall speed and, potentially, an increase in V2"
  },
  {
    "question": "In high density the landing TAS and distance will be:",
    "feedback": "Lower / shorter"
  },
  {
    "question": "The minimum value of V2 must exceed \"air minimum control speed\" by:",
    "feedback": "10%"
  },
  {
    "question": "A runway is contaminated by a 0,5 cm layer of wet snow. The take-off is nevertheless authorized by a light-twin's flight manual.  The take-off distance in relation to a dry runway will be:",
    "feedback": "increased"
  },
  {
    "question": "Is the V1 speed on a wet runway higher or lower than on a dry runway?",
    "feedback": "Lower, because on a wet runway an aircraft takes longer to stop in the event of an aborted takeoff"
  },
  {
    "question": "Is there any difference between the vertical speed versus forward speed curves for two identical aeroplanes having different masses ? (assume zero thrust and wind)",
    "feedback": "Yes, the difference is that for a given angle of attack both the vertical and forward speeds of the heavier aeroplane will be larger."
  },
  {
    "question": "(For this Question use Performance Manual MEP1 Fig. 3.3)\nGiven:\nPA at aerodrome: 6000 ftRunway slope: 2% upRunway surface: asphaltRunway condition: wetHeadwind: 6 ktsTemperature (OAT): 10°C\nFind the field limited take-off mass if the TORA is 1700 ft, TODA is 2600 ft, and ASDA is 1900 ft",
    "feedback": "4200 lb"
  },
  {
    "question": "(for this question use Performance Manual MRJT1, Fig. 4.23)\nWith regard to the figure, why are the temperature lines broken at 17000 ft?",
    "feedback": "The air condition is turned off below 17000 ft"
  },
  {
    "question": "(for this question use Performance Manual MEP1, Fig. 3.1)\nGiven:\nOAT: 11°CPressure Altitude: 2000 ftWind: 10 kts (head)Take-off mass: 4350 lbs\nOther conditions as associated in the header of the graph.\nWhat is the take-off ground roll required?",
    "feedback": "1350 ft"
  },
  {
    "question": "Which graph illustrates the movement of the total drag curve as density altitude decreases?",
    "feedback": "Figure 2"
  },
  {
    "question": "Which statement is correct for a descent without engine thrust at maximum lift to drag ratio speed?",
    "feedback": "The higher the gross mass the greater is the speed for descent."
  },
  {
    "question": "In case of an engine failure which is recognized at or above V1",
    "feedback": "the take-off must be continued."
  },
  {
    "question": "Compared with still air, the effect a headwind has on the values of the maximum range speed and the maximum gradient climb respectively is that:",
    "feedback": "the maximum range speed increases and maximum gradient climb speed is not affected"
  },
  {
    "question": "During a flight from London to New York, the Captain asks the First Officer why a final step climb from FL320 to FL360 ten minutes before the top of descent might not be a good idea. The correct answer of the First Officer should be:",
    "feedback": "A climb to FL360 might consume more fuel than would be saved by being at that level for a short period"
  },
  {
    "question": "For a jet transport aeroplane, which of the following is the reason for the use of 'maximum range speed' ?",
    "feedback": "Minimum specific fuel consumption."
  },
  {
    "question": "The climb gradient of an aircraft after take-off is 6% in standard atmosphere, no wind, at 0 ft pressure altitude.\nUsing the following corrections:\n \"± 0,2 % / 1 000 ft field elevation\"\n \"± 0,1 % / °C from standard temperature\"\n \" - 1 % with wing anti-ice\"\n \" - 0,5% with engine anti-ice\"\nThe climb gradient after take-off from an airport situated at 1 000 ft, 17° C; QNH 1013,25 hPa, with wing and engine anti-ice operating for a functional check is :",
    "feedback": "3,9 %"
  },
  {
    "question": "What effect has a downhill slope on the take-off speeds? The slope:",
    "feedback": "decreases the take-off speed V1"
  },
  {
    "question": "(For this question use Performance Manual SEP1 Figure 2.4 ) With regard to the graph for landing performance, what is the minimum headwind component required in order to land at Helgoland airport (non EASA AIR OPS)? Given: Runway length: 1300 ft Runway elevation: MSL Weather: assume ISA conditions Mass: 3200 lbs Obstacle height: 50 ft",
    "feedback": "10 kt."
  },
  {
    "question": "What is correct regarding the vertical obstacle clearance requirement for a Performance Class A aeroplane?\nIf, in the engine-out take-off flight path, the bank angle is more than 15°, all relevant obstacles must be cleared by at least (1)...., in relation to the (2) .... take-off flight path.",
    "feedback": "(1) 50 ft, (2) net"
  },
  {
    "question": "What is the effect of an engine failure of a multi-engine piston aeroplane in a steady climb at VX and on the angle of climb, with the propeller of the failed engine in the feathered position?",
    "feedback": "VX increases and the angle of climb decreases"
  },
  {
    "question": "Which of the following is true with regard to VMCA (air minimum control speed)?",
    "feedback": "Straight flight can not be maintained below VMCA, when the critical engine has failed."
  },
  {
    "question": "For a single engine aeroplane, calculate the net glide distance following an engine failure. Given:\nAltitude: 9000 ftTerrain elevation: 250 ftGross gradient: 11%TAS: 101 ktTailwind: 3 kt\nstill air distance = (height difference (ft) x 100) / net gradient (%), ground distance = still air distance x (GS/TAS)",
    "feedback": "12.9 NM"
  },
  {
    "question": "The minimum climb gradient required on the 2nd flight path segment after the take-off of a jet aeroplane is defined by the following parameters:\n1 Gear up\n2 Gear down\n3 Wing flaps retracted\n4 Wing flaps in take-off position\n5 N engines at the take-off thrust\n6 (N-1) engines at the take-off thrust\n7 Speed over the path equal to V2 + 10 kt\n8 Speed over the path equal to 1.23 Vsr\n9 Speed over the path equal to V2\n10 At a height of 35 ft above the runway\n\nThe correct statements are:",
    "feedback": "1, 4, 6, 9"
  },
  {
    "question": "The MSTOM of a multi-engine piston aeroplane is 12000 lbs. Referring to the given table, find the maximum regulated take-off mass with 10° flaps under the following conditions (dry, level runway, zero wind):\nASDA: 5980 ftTORA: 4730 ftTODA: 5320 ftPA: 1000 ftOAT: 10°C",
    "feedback": "10500 lbs"
  },
  {
    "question": "Reduced take-off thrust should normally not be used when:",
    "feedback": "anti skid is not usable."
  },
  {
    "question": "Regarding clearways, which of the following answers is correct?",
    "feedback": "A clearway is an area of land or water beyond the runway that must be under the control of the airport authority"
  },
  {
    "question": "For a piston-engined propeller aircraft, the speed for maximum endurance which gives the greatest endurance time is:",
    "feedback": "Found at low altitude"
  },
  {
    "question": "The correct definition of TODA",
    "feedback": "TORA plus clearway"
  },
  {
    "question": "Which of the following statements, concerning the obstacle limited take-off mass for performance class A aeroplane, is correct?",
    "feedback": "It should be determined on the basis of a 35 ft obstacle clearance with the respect to the \"net take-off flight path\"."
  },
  {
    "question": "(for this question use Performance Manual MRJT1, Fig. 4.3)\nGiven:\nPressure Altitude: 33000 ftIndicated Mach Number: 0.87Indicated TAT: -20°C\nWhat is the temperature deviation from Standard?",
    "feedback": "-3.5°C"
  },
  {
    "question": "You are on a VFR flight with a multi-engine piston airplane and you have just departed. At 500 ft above the departure aerodrome elevation, you perform a climb to FL050, while maintaining a constant indicated airspeed of 120 kt. What will happen with the power required and power available curves during this climb?\nThe \"power required versus TAS\" curve moves (1) ...... and the \"power available versus TAS\" curve moves (2) ......",
    "feedback": "(1) up and right, (2) down and right"
  },
  {
    "question": "Calculate the relative direction of the wind to the runway:\nW/V 330/30Runway 02Wind angle = 50°",
    "feedback": "Headwind 19 kt, crosswind 23 kt"
  },
  {
    "question": "A jet aeroplane is flying long range cruise. How does the specific range / fuel flow change, compared to the High Speed Cruise?",
    "feedback": "Increase/decrease"
  },
  {
    "question": "What will be the effect on an aeroplane's performance if aerodrome pressure altitude is decreased?",
    "feedback": "It will decrease the take-off distance required."
  },
  {
    "question": "The landing field length required for jet aeroplanes at the alternate (wet condition) is the demonstrated landing distance plus",
    "feedback": "92%"
  },
  {
    "question": "Consider a performance Class A turbojet airplane. Which of the following configurations refers to the second segment of the net take-off flight path?\n1) Landing gear retracted2) Maximum continuous thrust on the remaining engine(s)3) Flaps and slats extended4) The speed according to the best lift-to-drag ratio",
    "feedback": "1, 3"
  },
  {
    "question": "Refer to the Regulated Take-Off Mass (RTOM) table for runway 23L from take-off position VB. In each RTOM chart box, the following information is provided for a given wind component /outside temperature combination:\nMTOM/limitation code/V1/VR/V2 (+100 kt). Given the following information, determine the RTOM for departure.\nFor this question do not interpolate. Choose the most conservative figures at all times:\nW/V 05004KTOAT +21°CQNH 1028 hPaRunway DRYEngine anti-ice OFFPacks ONQuick line-up",
    "feedback": "75350 kg"
  },
  {
    "question": "(for this question use Performance Manual MRJT1, Fig. 4.4)\nWhat is the maximum brake release mass, given there is no slope and no wind?\nFlap setting: 15°OAT: +25°CAerodrome pressure altitude: 2000 ftField length available: 8000 ft",
    "feedback": "61000 kg"
  },
  {
    "question": "A pilot performs two landings onto the same runway. Both are from 3° approaches, with the same conditions present.\nLanding 1: The aeroplane passed the runway threshold at a height of almost 100 ft and the correct landing airspeedLanding 2: The aeroplane passed the runway threshold at 50 ft but with an airspeed 5 knots higher than the correct landing airspeed.\nChoose the correct statement from the answers below:",
    "feedback": "Both landings result in a greater landing distance than expected, where landing 2 is less predictable as it depends on how excess energy is dissipated during the flare and subsequent ground roll"
  },
  {
    "question": "With one or two engines inoperative the best specific range at high altitudes is (assume altitude remains constant):",
    "feedback": "reduced"
  },
  {
    "question": "With regard to a large jet transport aeroplane, which of the following is a suitable definition of Specific Range over the Ground?",
    "feedback": "The number of nautical ground miles per unit of fuel"
  },
  {
    "question": "In addition to other requirements, the approach climb requirement is based on:",
    "feedback": "One engine out, flaps approach and gear up"
  },
  {
    "question": "With a positive rate of climb, the difference between the climb angle and the climb gradient is that the gradient ....",
    "feedback": "is stated as a percent, climb angle is stated in degrees"
  },
  {
    "question": "The minimum climb gradient required on the 2nd flight path segment after the take-off of a jet aeroplane is defined by the following parameters:\n1) Undercarriage up2) Undercarriage down3) Wing flaps retracted4) Wing flaps in take-off position5) N engines at the take-off thrust6) (N-1) engines at the take-off thrust7) Speed over the path equal to V2 + 10 kts8) Speed over the path equal to 1.3 VS9) Speed over the path equal to V210) At a height of 35 ft above the runway\nThe correct statements are:",
    "feedback": "1, 4 , 6, 9"
  },
  {
    "question": "On a reciprocating engined aeroplane, to maintain a given angle of attack, configuration and altitude at higher gross mass",
    "feedback": "an increase in airspeed and power is required."
  },
  {
    "question": "(For this Question use Flight Planning & Monitoring SEP1 Fig. 2.2)Using the Power Setting Table, for the single engine aeroplane, determine the cruise TAS and fuel flow (lbs/hr) with full throttle and cruise lean mixture in the following conditions:\n\nGiven:\nOAT:                          13°C\nPressure altitude:        8000 ft\nRPM:                         2300",
    "feedback": "160 kt and  69,3 lbs/hr"
  },
  {
    "question": "The drift down requirements are based on:",
    "feedback": "the obstacle clearance during a descent to the new cruising altitude if an engine has failed."
  },
  {
    "question": "For this question use CAP 698, Fig 4.5 MRJT\nGiven the following data, find the climb-limited take-off mass for a medium-range jet transport (MRJT) aeroplane:\nAirport OAT: 35°CAirport Pressure Altitude: 3000 ftTake-off flap setting: Flap 5A/C air conditioning: Packs OFFEngine anti-icing system: OFFPMC: OFF",
    "feedback": "55900 kg"
  },
  {
    "question": "For turbojet aircraft weighing more than 5700 kg in transport CAT when landing on wet runways, the runway length must be at least",
    "feedback": "115 % of the runway length established under normal conditions"
  },
  {
    "question": "When approaching a wet runway, with the risk of hydroplaning, what technique should the pilot adapt?\n(Note: VP= aquaplaning speed)",
    "feedback": "Positive touch down, full reverse and brakes as soon as possible"
  },
  {
    "question": "(For this Question use Performance Manual MEP1 Fig. 3.2)\n\nGiven :\nO.A.T : -10 °C\nPressure Altitude:  4000 ft\nTake off Mass:  4600 lbs\nWind:  180/10 kt\nRWY: 12R\nHeavy Duty Brakes installed\nOther conditions as associated in the header of the graph\n\nWhat is the accelerate and stop distance under the conditions given?",
    "feedback": "3550 ft"
  },
  {
    "question": "If all engines are operating for a class B multi-engine airplane, the take-off flight path is equal to the gross gradient of the actual flight path ......",
    "feedback": "multiplied by 0.77"
  },
  {
    "question": "A performance class B multi-engined aeroplane, is used for commercial air transport. The take-off distance calculations must take into account ......",
    "feedback": "at most only 50 % of the headwind"
  },
  {
    "question": "(for this question use Performance Manual MEP1, Fig 3.6)\nGiven the following information, what will be the approximate single engine service ceiling when the power setting is limited to \"MAX CONT\"?\nTake-off Mass: 4000 lbsAtmospheric Conditions: ISA",
    "feedback": "18300 ft"
  },
  {
    "question": "Given:\nRunway direction: 050°(M)Max. tailwind component: 10 ktsCurrent wind direction: 170°(M)\nCalculate the maximum allowed wind speed for the take-off:",
    "feedback": "20 kt"
  },
  {
    "question": "Determine the one engine-out climb gradient of a four-engined aeroplane, given:\nAeroplane mass: 315000 kgThrust per engine: 245000 NDrag: 435000 N(assume the acceleration due to gravity is 10 m/s2)",
    "feedback": "9.5 %"
  },
  {
    "question": "As long as an aeroplane is in a steady climb:",
    "feedback": "VX is always less than VY"
  },
  {
    "question": "(for this question use Performance Manual MRJT1, Fig.4.28)\nGiven the following information, what is the Field Length Limited Mass?\nRunway Length: 1600 m (dry)Airport PA: 1800 ftHeadwind: 20 ktsFlaps: 30°Anti-skid: OperativeSpoilers: Automatic",
    "feedback": "58000 kg"
  },
  {
    "question": "VMCG is determined during flight testing using aerodynamic controls:",
    "feedback": "no nosewheel steering and no crosswind"
  },
  {
    "question": "Which statement is correct?",
    "feedback": "VR must not be less than 1.05 VMCA and not less than V1."
  },
  {
    "question": "The first segment of the take-off flight path ends",
    "feedback": "at completion of gear retraction."
  },
  {
    "question": "The stopway is included in:",
    "feedback": "the accelerate-stop distance available"
  },
  {
    "question": "Which of the following factors leads to the maximum flight time of a glide?",
    "feedback": "Low mass."
  },
  {
    "question": "What happens when flying at the 'backside of the power curve'?",
    "feedback": "The speed is unstable."
  },
  {
    "question": "The landing reference speed VREF has, in accordance with international requirements, the following margins above reference stall speed in landing configuration (VSR0):",
    "feedback": "23%"
  },
  {
    "question": "(for this question use Performance Manual MRJT1, Fig. 4.23)\nGiven;\nAircraft Mass: 52000 kgTemperature: ISA +20°CEngine Anti-Ice: OnAir Conditioning (A/C): Off\nUsing the data, determine the net level off altitude:",
    "feedback": "15400 ft"
  },
  {
    "question": "The graph shows take-off/rejected take-off distances and V1 speeds for an aeroplane in given conditions. The balanced V1 is shown at speed",
    "feedback": "D"
  },
  {
    "question": "(For this Question use Performance Manual MEP1, figure 3.4)\nWith regard to the graph for the light twin aeroplane, if the brakes are released before take-off power is achieved, the accelerate stop distance will be:",
    "feedback": "longer than the graphical distance"
  },
  {
    "question": "When compared to still air conditions, a constant headwind component:",
    "feedback": "increases the angle of flight path during climb"
  },
  {
    "question": "Stepped climbs are used on long distance flights:",
    "feedback": "to fly a profile as close as possible to the optimum altitude as the aeroplane mass reduces"
  },
  {
    "question": "To achieve the maximum range over ground with headwind the airspeed should be",
    "feedback": "higher compared to the speed for maximum range cruise with no wind."
  },
  {
    "question": "(For this Question use Performance Manual MEP1 Fig. 3.1)\n\nGiven :\nO.A.T : 24 °C\nPressure Altitude:  3000 ft\nTake off Mass:  3800 lbs\nWind:  060/04kt\nRWY: 30R\nHeavy Duty Brakes installed\nOther conditions as associated in the header of the graph\n\nWhat is the ground roll distance under the conditions given?",
    "feedback": "1670 ft"
  },
  {
    "question": "Minimum control speed on ground, VMCG, is based on directional control being maintained by:",
    "feedback": "primary aerodynamic control only."
  },
  {
    "question": "The correct definition of stopway is:",
    "feedback": "An area beyond TORA where an aircraft may be stopped safely"
  },
  {
    "question": "The speed for best rate of climb is called",
    "feedback": "VY."
  },
  {
    "question": "What is VS1g ?",
    "feedback": "The 1-g stall speed at which the aeroplane can develop lift equal to its weight"
  },
  {
    "question": "If the climb speed schedule is changed from 280/.74 to 290/.74 the new crossover altitude is",
    "feedback": "lower."
  },
  {
    "question": "In accordance with CS-25 the take-off safety speed V2min for turbo-propeller powered aeroplanes with more than three engines may not be less than:",
    "feedback": "1.08 Vsr"
  },
  {
    "question": "The take-off runway performance requirements for transport category aeroplanes are based upon:",
    "feedback": "failure of critical engine or all engines operating which ever gives the largest take off distance."
  },
  {
    "question": "Given the information, what landing flap configuration should be used to be within the landing limits?\n\nEstimated Landing Mass: 54500 kg\nStructural-limited Landing Mass: 66300 kg",
    "feedback": "Flaps 30"
  },
  {
    "question": "The effect of increasing the flap setting, from zero to the recommended take-off setting, on the length of the Take-off Distance Required (TODR) and the Field-Length-Limited Take-off Mass (TOM) is:",
    "feedback": "Decreased TOD required and increased field length limited TOM."
  },
  {
    "question": "What is the effect on a take-off distance if both the aerodrome pressure altitude and the aerodrome temperature increase?",
    "feedback": "Take-off distance will increase"
  },
  {
    "question": "A jet aeroplane is climbing at a constant IAS and maximum climb thrust, how will the climb angle / the pitch angle change?",
    "feedback": "Reduce / decrease."
  },
  {
    "question": "The induced drag of an aeroplane at constant mass in un-accelerated level flight is greatest at:",
    "feedback": "the lowest achievable speed in a given configuration"
  },
  {
    "question": "Drift down is the procedure to be utilised:",
    "feedback": "after engine failure if the aeroplane is above the one-engine-inoperative cruise ceiling"
  },
  {
    "question": "You are taking off from Lanzarote airport and the reported wind is 03010KT. The slope of both runways is the same and the following information is provided:\nRWY 03: Facing the mountains with a TORA of 2400 m and the aircraft will clear an obstacle with 297 ft and it is 4330 m awayRWY 21: Facing the ocean with a TORA of 2400 m and no obstacles in the climb pathRWY 03: 82 tonnesRWYX 21: 84 tonnes\nWhy is the mass for a take-off on runway 03 more limiting?",
    "feedback": "RWY 03 is obstacle limited because it will have to maintain a higher climb gradient"
  },
  {
    "question": "Considering TAS for maximum range and maximum endurance, other factors remaining constant,",
    "feedback": "both will increase with increasing altitude."
  },
  {
    "question": "A turbojet is flying at a constant IAS and pressure altitude. Given that a ± 1° C of ISA deviation results in a change in fuel flow of ± 0.2 %, determine how much the specific fuel consumption would change if the OAT is ISA +10° C rather than ISA:",
    "feedback": "2 % increase in SFC"
  },
  {
    "question": "In unaccelerated climb",
    "feedback": "thrust equals drag plus the downhill component of the gross weight in the flight path direction."
  },
  {
    "question": "refer to the figure.\nGiven:Airport elevation: 3000 ftTemperature: ISA +10°CQNH: 1030 hPaLanding mass: 8400 lb\nFind the available rate of climb of a twin piston engine aeroplane in case of a balked landing, for the given conditions.",
    "feedback": "1630 ft/min"
  },
  {
    "question": "Given:\nRunway 23 leftW/V 0505KTOAT -2°CQNH 985 hPaAnti-ice ONPacks OFFWeather: Fog\nUsing the table provided, determine the RTOM for an aircraft that uses the quick lineup technique given the above conditions without interpolation:(do not interpolate, always choose the most conservative figures)",
    "feedback": "76980 kg"
  },
  {
    "question": "A single-engined piston aeroplane is flying at an altitude of 5000 ft with a constant tailwind component of 15 kt. Given the following information, if the engine fails at this altitude, what should be the expected net glide distance over ground with an elevation of 300 ft?\nAeroplane gross gradient: 10%TAS: 120 kt1 NM = 6080 ftstill air distance = (height difference / net gradient) x 100. Ground distance = Still Air Distance x (GS/TAS)",
    "feedback": "8.3 NM"
  },
  {
    "question": "Given: VS= Stalling speed VMCA= Air minimum control speed  VMU= Minimum unstick speed (disregarding engine failure) V1= take-off decision speed VR= Rotation speed V2 min.= Minimum take-off safety speed VLOF: Lift-off speed  The correct formula is:",
    "feedback": "VS< VMCA< V2 min"
  },
  {
    "question": "Which condition is least favourable handling-wise during take-off for a twin engine aircraft with the engines wing mounted, both being right hand props?",
    "feedback": "A left engine failure, with a left quartering wind"
  },
  {
    "question": "Consider a Class A Medium Range Jet Transport aeroplane that is approved to be operated with increased bank angle limits. The maximum permitted bank angle for the portion of the net take-off flight path between 200 ft and 400 ft is:",
    "feedback": "20°"
  },
  {
    "question": "Refer to the graph\nGiven:\nClimb power: Full throttleFlaps: UpTemperature: ISA + 15°CQNH: 1013 hPaWeight: 2950 lbsAirspeed: 120 kts KIASGear: retracted Wind: 10 kts headwind\nFind the approximate rate of climb for a flight at an altitude of 12000 ft:",
    "feedback": "1160 ft/min"
  },
  {
    "question": "In the figure, the curves B and A represent:",
    "feedback": "the climb limited take-off weight and the field length limited take-off weight"
  },
  {
    "question": "What happens when an aeroplane climbs at a constant Mach number?",
    "feedback": "The lift coefficient increases."
  },
  {
    "question": "A pilot is cleared to perform a Continuous Descent Arrival (CDA) into an airport. The descent profile has been calculated and the descent has been started. During the descent, the pilot notices that the headwind is stronger than calculated. In order to remain on the descent profile, a (1) ....... in groundspeed has to be expected and, therefore, the rate of descent has to be (2) .......",
    "feedback": "(1) decrease, (2) reduced"
  },
  {
    "question": "Given:\nRunway 23 leftRunway condition: dryW/V 23016KTOAT +10°CQNH 1008 hPaEngine anti-ice OFFPacks OFFTake-off mass 71840 kg\nDetermine the appropriate assumed FLEX temperature, V1, VR, and V2:(do not interpolate, always choose the most conservative figures)",
    "feedback": "57°C, V1 139 kt, VR 139 kt, V2 145 kt"
  },
  {
    "question": "During the flight preparation the climb limited take-off mass (TOM) is found to be much greater than the field length limited TOM using 5° flap. In what way can the performance limited TOM be increased? There are no limiting obstacles.",
    "feedback": "By selecting a higher flap setting."
  },
  {
    "question": "CS 25.121 (d)(1) § (i) to (iv) state the pre-requisite conditions for an aeroplane, during certification, demonstrating its one-engine inoperative gradient of climb in the approach phase.\nWhich of the following options states the correct description of one of these prerequisites?",
    "feedback": "The landing gear is retracted"
  },
  {
    "question": "The aerodynamic ceiling",
    "feedback": "is the altitude at which the speeds for low speed buffet and for high speed buffet are the same."
  },
  {
    "question": "Vmu is defined as",
    "feedback": "minimum unstick speed"
  },
  {
    "question": "At maximum landing mass, the structure of the aircraft is designed for a rate of descent of",
    "feedback": "600 fpm"
  },
  {
    "question": "Which of the following represents the maximum value for V1 assuming max tyre speed and max brake energy speed are not limiting?",
    "feedback": "VR"
  },
  {
    "question": "A twin engine aeroplane is flying at the minimum control speed with take-off thrust on both engines. The critical engine suddenly fails.\n\nAfter stabilising the engine failure transient which parameter(s) must be maintainable?",
    "feedback": "Straight flight"
  },
  {
    "question": "(for this question use Performance Manual MEP1, Fig. 3.1)\nGiven:\nOAT: -15°CPressure Altitude: 4000 ftRWY: 12RWind 08012KTTake-off Mass: 4000 lbsRunway Surface: Tarred and dry\nWhat is the minimum runway length, when no stopway and clearway is available?",
    "feedback": "1950 ft"
  },
  {
    "question": "(For this Question use Performance Manual MEP1 Fig. 3.1)\n\nGiven :\nO.A.T : 24 °C\nPressure Altitude:  3000 ft\nTake off Mass:  3800 lbs\nWind:  060/04kt\nRWY: 30R\nHeavy Duty Brakes installed\nOther conditions as associated in the header of the graph\n\nWhat is the take-off distance under the conditions given?",
    "feedback": "2000 ft"
  },
  {
    "question": "An aeroplane operating under the 180 minutes ETOPS rule may be up to :",
    "feedback": "180 minutes flying time to a suitable airport in still air with one engine inoperative."
  },
  {
    "question": "The maximum speed in horizontal flight occurs when:",
    "feedback": "the maximum thrust is equal to the total drag"
  },
  {
    "question": "(for this question use Performance Manual MRJT1, Fig. 4.11)\nGiven:\nPressure Altitude: 6000 ftPMC: OnTemperature (OAT): 30°CA/C packs: Auto\nDetermine %N1:",
    "feedback": "96.1"
  },
  {
    "question": "A 'Balanced Field Length' is said to exist where:",
    "feedback": "The accelerate stop distance is equal to the take-off distance available."
  },
  {
    "question": "The take-off distance available is",
    "feedback": "the length of the take-off run available plus the length of the clearway available."
  },
  {
    "question": "Stalling speed in landing configuration are certified with:",
    "feedback": "flap in landing configuration and gear down"
  },
  {
    "question": "(for this question use Performance Manual MEP1, Fig. 3.3)\nGiven:\nAerodrome PA: 5500 ftAmbient Temperature: 5°CWind Component: 5kt headwindRunway Slope: 3% uphillRunway Surface: TarmacRunway Condition: WetTORA: 1800 ftASDA: 2000 ftTODA: 2800 ft\nCalculate the Field Length Limited Take-Off Weight for a maximum effort take-off (short field)",
    "feedback": "4500 lbs"
  },
  {
    "question": "A jet aeroplane is climbing with constant IAS. Which operational speed limit is most likely to be reached?",
    "feedback": "The Maximum operating Mach number."
  },
  {
    "question": "(For this Question use Performance Manual SEP1 Fig. 2.4)\nYou are planning a flight in a single engine aeroplane. With regard to the landing chart determine the landing distance required at your planned destination airport.\nGiven :OAT: 27 °C Pressure Altitude: 3000 ft Aeroplane Mass: 2900 lbs Tailwind component: 5 kt Flaps: Landing position (down)  Runway: Dry grass 5 cm long",
    "feedback": "3040 ft"
  },
  {
    "question": "Which one of the following statements concerning drift down is correct?",
    "feedback": "When determining the obstacle clearance during drift down, fuel dumping may be taken into account."
  },
  {
    "question": "An aeroplane carries out a descent from FL 410 to FL 270 at cruise Mach number, and from FL 270 to FL 100 at the IAS reached at FL 270. How does the angle of descent change in the first and in the second part of the descent? Assume idle thrust and clean configuration and ignore compressibility effects.",
    "feedback": "Increases in the first part; is constant in the second."
  },
  {
    "question": "Two identical turbojet aeroplane (whose specific fuel consumptions are considered to be equal) are at holding speed at the same altitude.\nThe mass of the first aircraft is 130 000 kg and its hourly fuel consumption is 4300 kg/h. The mass of the second aircraft is 115 000 kg and its hourly fuel consumption is:",
    "feedback": "3804 kg/h."
  },
  {
    "question": "For planning purposes, determine the net distance travelled. Given the following data:\nAltitude: 8000 feetAirport elevation: 1500 ftTAS: 100 ktsHeadwind: 10 ktsGross gradient of descent 8 %\nstill air distance (ft) = height difference  /  net gradient x 100Ground distance = still air distance x (GS / TAS)1 NM = 6080 ft",
    "feedback": "12.03 NM"
  },
  {
    "question": "Which speed provides maximum obstacle clearance during climb?",
    "feedback": "The speed for which the ratio between rate of climb and forward speed is maximum."
  },
  {
    "question": "Johannesburg is at approximately 5500 ft AMSL, and the temperature can reach 30°C in summiner. what effect might these conditions have on the maximum landing mass compared to standard atmosphere conditions at an aerodrome at mean sea level?",
    "feedback": "The maximum landing mass would be lower because the actual landing distance would increase"
  },
  {
    "question": "When flying the \"Backside of Thrust curve\" means",
    "feedback": "a lower airspeed requires more thrust."
  },
  {
    "question": "The speed to obtain the maximum Specific Range (SR) of a turbojet aeroplane is ......",
    "feedback": "1.32 x minimum drag (VMD) speed"
  },
  {
    "question": "The MSTOM of a multi-engine piston aeroplane is 12500 lbs. Referring to the given table, find the maximum regulated take-off mass with 0° flaps under the following conditions (dry, level runway, zero wind):\nASDA: 5980 ftTORA: 4730 ftTODA: 5320 ftPA: 3000 ftOAT: -20°C",
    "feedback": "11000 lbs"
  },
  {
    "question": "The correct order of speeds is:",
    "feedback": "VS < VMCA < V2MIN"
  },
  {
    "question": "What is the effect of tail wind on the time to climb to a given altitude?",
    "feedback": "The time to climb does not change."
  },
  {
    "question": "Given that: VEF= Critical engine failure speed  VMCG= Ground minimum control speed VMCA= Air minimum control speed  VMU= Minimum unstick speed V1= Take-off decision speed VR= Rotation speed V2 min.= Minimum take-off safety speed The correct formula is:",
    "feedback": "VMCG<=VEF < V1"
  },
  {
    "question": "The climb limited take-off mass can be increased by",
    "feedback": "a lower flap setting for take-off and selecting a higher V2."
  },
  {
    "question": "In a steady descending flight (descent angle GAMMA) equilibrium of forces acting on the aeroplane is given by: (T = Thrust, D = Drag, W = Weight)",
    "feedback": "T + W *sin GAMMA = D"
  },
  {
    "question": "For Performance Class B aeroplanes in commercial air transport operations, unless otherwise specified in the Aircraft Flight Manual, what factor must be applied to the take-off distance if the runway has an upslope of 1%?",
    "feedback": "1.05"
  },
  {
    "question": "You are in descent on a ILS with a constant CAS, compared with a nil wind situation, a tailwind will:",
    "feedback": "increase descent rate"
  },
  {
    "question": "Determine what the performance limitation is for take-off, given an OAT of +65°C and a headwind of 20 kt:",
    "feedback": "Obstacle and second segment climb"
  },
  {
    "question": "(for this question use Performance Manual MEP1, Fig. 3.8)\nGiven:\nAerodrome Pressure Altitude: 4000 ftOAT: 20°CLanding Mass: 4513 lbs\nWhat is the balked landing climb gradient in still air conditions?",
    "feedback": "8.6%"
  },
  {
    "question": "Maximum and minimum values of V1 are limited by :",
    "feedback": "VR and VMCG"
  },
  {
    "question": "The maximum mass for landing could be limited by",
    "feedback": "the climb requirements with one engine inoperative in the approach configuration."
  },
  {
    "question": "(for this question use Performance Manual SEP1, Figure 2.2)\nWith regard to the take-off performance chart for the single engine aeroplane determine the take-off distance to a height of 50 ft. Given:\nOAT: -7°CPressure Altitude: 7000 ftAeroplane Mass: 2950 lbsHeadwind: 5 ktsFlaps: Approach settingRunway: Tarred and dry",
    "feedback": "1950 ft"
  },
  {
    "question": "Normal procedures associated with take-off and landing on contaminated runways are to be found in ......",
    "feedback": "Part B of the Operations Manual"
  },
  {
    "question": "The \"maximum tyre-speed\" limits:",
    "feedback": "VLOF in terms of ground speed"
  },
  {
    "question": "The long range cruise speed is selected because:",
    "feedback": "the higher speed achieves 99% of the maximum still-air range"
  },
  {
    "question": "For a jet aeroplane which of the following statements is correct?",
    "feedback": "VB is best angle of climb speed"
  },
  {
    "question": "Define Vef, the critical engine failure speed:",
    "feedback": "the speed at which the critical engine is assumed to fail during take-off"
  },
  {
    "question": "Vy is defined as :",
    "feedback": "speed for best rate of climb"
  },
  {
    "question": "On a long distance flight the gross mass decreases continuously as a consequence of the fuel consumption. The result is:",
    "feedback": "The specific range and the optimum altitude increase."
  },
  {
    "question": "Given the following information, calculate the net glide distance for a single-engined aeroplane operating under performance class B.\nAeroplane altitude: 10000 ftTerrain elevation: 500 ftGross glide gradient: 10%TAS: 200 ktHeadwind component: 20 kt1 NM = 6080 ftstill air distance = (height difference / net gradient) x 100. Ground distance = Still Air Distance x (GS/TAS)",
    "feedback": "13.4 NM"
  },
  {
    "question": "Assuming constant L/D ratio, which of the diagrams provided correctly shows the movement of the \"Thrust Required Curve .(M1>M2).",
    "feedback": "c"
  },
  {
    "question": "What is the effect of increased mass on the performance of a gliding aeroplane?",
    "feedback": "The speed for best angle of descent increases."
  },
  {
    "question": "CS-23 and CS-25 use the term \"net take-off flight path\" to describe certain performance elements. The net take-off flight path is the....",
    "feedback": "actual flight path of the aeroplane reduced by a safety margin"
  },
  {
    "question": "A higher outside air temperature (OAT)",
    "feedback": "decreases the brake energy limited take-off mass."
  },
  {
    "question": "A performance class B multi-engined aeroplane, is used for commercial air transport. The take-off distance calculations must take into account ......",
    "feedback": "at least 150 % of the reported tailwind component"
  },
  {
    "question": "(for this question use Performance Manual MRJT1, Fig. 4.30)\nGiven\nAerodrome PA: 3000 ftOutside Air Temperature (OAT): + 30°FRunway Slope: 1.5% downWind: 10 kts headFlaps: 40°\nUsing the data, determine the Maximum Quick Turnaround Mass:",
    "feedback": "56375 kg"
  },
  {
    "question": "A pilot is used to land at high speeds on a very long runway. Now, the pilot lands on a short runway, using the same technique. What can happen?",
    "feedback": "The aircraft will have too much kinetic energy and might overshoot the runway"
  },
  {
    "question": "You are flying a medium jet aircraft with the autopilot maintaining a constant vertical speed. While flying a Continuous Descent Approach (CDA), the autothrust maintains a constant airspeed (CAS). You select the approach flaps as the aircraft gradually slows down from minimum clean speed of 213 kt to 180 kt, therefore, the ......\n(Other factors should not be considered to answer this question)",
    "feedback": "vertical speed must be reduced to maintain the trajectory, and when the approach speed stabilises, the autothrust will demand more thrust to maintain the speed"
  },
  {
    "question": "A jet aeroplane has three configurations available for take-off:\nT/O 1: 1 stage of slats and flapsT/O 2: 2 stages of slats and flapsT/O 3: 3 stages of slats and flaps\nThe runway is not limiting but the given departure requires a climb gradient of 6.8 % to 2000 ft. Which T/O configuration will be the most appropriate to achieve the best climb gradient?",
    "feedback": "T/O 1 because it results in greater climb speeds and greater rate of climb than when using T/O 2"
  },
  {
    "question": "A jet aeroplane equipped with old engines has a specific fuel consumption of 0.06 kg per Newton of thrust and per hour and, in a given flying condition, a fuel mileage of 14 kg per Nautical Mile. In the same flying conditions, the same aeroplane equipped with modern engines with a specific fuel consumption of 0.035 kg per Newton of thrust and per hour, has a fuel mileage of:",
    "feedback": "8.17 kg/NM."
  },
  {
    "question": "Following a take-off determined by the 50ft (15m) screen height, a light twin climbs on a 10% over-the-ground climb gradient.  It will clear a 900 m high obstacle in relation to the runway (horizontally), situated at 10 000 m from the 50 ft clearing point with an obstacle clearance of:",
    "feedback": "115 m"
  },
  {
    "question": "The decision speed at take-off (V1) is the calibrated airspeed:",
    "feedback": "below which take-off must be rejected if an engine failure is recognized, above which take-off must be continued."
  },
  {
    "question": "Which of the following options best describes the relationship between fuel flow and TAS, for propeller-driven aeroplanes?",
    "feedback": "With increasing TAS, fuel flow will increase, when flying above the minimum power speed"
  },
  {
    "question": "(For this Question use Performance Manual SEP1 Fig. 2.2)\nWith regard to the take off performance chart for the single engine aeroplane determine the maximum allowable take off mass .\n\nGiven :\nO.A.T :                             ISA\nPressure Altitude:             4000 ft\nHeadwind component:       5 kt\nFlaps:                              approach \nRunway:                          Tarred and Dry\nFactored runway length:    2000 ft\nObstacle height:               50 ft",
    "feedback": "3240 lbs"
  },
  {
    "question": "The induced drag of an aeroplane",
    "feedback": "decreases with increasing airspeed."
  },
  {
    "question": "Reduced take-off thrust should normally not be used when:",
    "feedback": "the runway is contaminated."
  },
  {
    "question": "Approaching in turbulent wind conditions requires a change in the landing reference speed (VREF):",
    "feedback": "Increasing VREF"
  },
  {
    "question": "What is the maximum angle of bank allowed when planning a curved flight path during climbout (A/C weight > 5700 kg)?",
    "feedback": "15°"
  },
  {
    "question": "What is true about a clearway?",
    "feedback": "A clearway can be water or land and must be under the control of the aerodrome authority"
  },
  {
    "question": "Dry snow ......",
    "feedback": "if compacted by hand to form a snow ball, will fall apart again upon release"
  },
  {
    "question": "Refer to CAP 698, Fig. 4-23\nGiven the information provided below, the pilot of a jet-engine aircraft must determine which of the following en-route alternate airports are the most appropriate diversion airports in case of an engine failure during the cruise phase.\nTemperature: ISA +10°C or belowAnti-Ice: Engine anti-ice onAircraft cruise mass: 43000 kg\nRequired airport altitude for:Airport 1: 21000 ftAirport 2: 23000 ftAirport 3: 24500 ftAirport 4: 19500 ft",
    "feedback": "1, 4"
  },
  {
    "question": "The result of a higher flap setting up to the optimum at take-off is",
    "feedback": "a shorter ground roll."
  },
  {
    "question": "If a departure procedure requires 4.6 % climb gradient to 1300 ft, to clear an obstacle, what is the minimum ROC, given the following?\nTAS: 125 KTSHeadwind component: 25 KTS",
    "feedback": "460 ft/min"
  },
  {
    "question": "(For this Question use Performance Manual SEP1 Fig. 2.1)\nWith regard to the take off performance chart for the single engine aeroplane determine the take off distance to a height of 50 ft .\n\nGiven :\nO.A.T :                            30°C\nPressure Altitude:            1000 ft\nAeroplane Mass:             3450 lbs\nTailwind component:        2.5 kt\nFlaps:                             up \nRunway:                         Tarred and Dry",
    "feedback": "approximately : 2470 feet"
  },
  {
    "question": "The speed V1 is defined as:",
    "feedback": "take-off decision speed"
  },
  {
    "question": "(For this Question use Performance Manual SEP1 Fig. 2.4)\nPlanning a flight in a single engine aeroplane. With regard to the landing chart determine the landing distance required at your planned destination aerodrome.\nGiven :\nOAT: ISA Pressure Altitude: 1000 ft Aeroplane Mass: 3500 lbs Tailwind component: 5 kt Flaps: Landing position (down)  Runway: Tarred and wetRunway Slope: 2% upslope",
    "feedback": "2880 ft"
  },
  {
    "question": "Which of the following represents the minimum for V1?",
    "feedback": "VMCG"
  },
  {
    "question": "Consider flying at cruise altitude in a turbojet aeroplane. An increase in ambient temperature is experienced. What will be the effect on the Specific Range?(SFC means Specific Fuel Consumption)",
    "feedback": "SR will decrease"
  },
  {
    "question": "The determination of the maximum mass on brake release, of a certified turbojet aeroplane with 5°, 15° and 25° flaps angles on take-off, leads to the following values, with zero wind: Flap angle: 5° 15° 25° Runway limitation (kg): 66 000 69 500 71 500 2nd segment slope limitation: 72 200 69 000 61 800 Wind correction: Head wind:+120kg / kt Tail wind: -360kg / kt Given that the tail wind component is equal to 5 kt, the maximum mass on brake release and corresponding flap angle will be:",
    "feedback": "67 700 kg / 15 deg"
  },
  {
    "question": "A scenic VFR flight is planned with a paying passenger. What is the lateral obstacle clearance required during the take-off climb out?",
    "feedback": "You look out of the cockpit and avoid obstacles by flying around them"
  },
  {
    "question": "Given the following information, calculate the net glide distance for a single-engined aeroplane.\nAeroplane altitude: 9000 ftTerrain elevation: 500 ftGross glide gradient: 10%TAS: 210 ktHeadwind component: 42 kt1 NM = 6080 ftstill air distance = (height difference / net gradient) x 100. Ground distance = Still Air Distance x (GS/TAS)",
    "feedback": "11 NM"
  },
  {
    "question": "(for this question use Performance Manual MEP1, Fig. 3.6)\nGiven:\nPower setting: Limited to MAX CONTTake-off mass: 4750 lbs\nWhat approximate temperature can be assumed if the pilot is flying at the single engine service ceiling at 12000 ft?",
    "feedback": "+8°C"
  },
  {
    "question": "At which minimum height will the second climb segment end?",
    "feedback": "400 ft above field elevation."
  },
  {
    "question": "For a piston engined aeroplane, the speed for maximum range is :",
    "feedback": "that which gives the maximum lift to drag ratio."
  },
  {
    "question": "What does VREF stand for? It is the speed in a specified:",
    "feedback": "Landing configuration, at the point where the aeroplane descends through 50 ft, and is used to determine the landing distance for manual landings"
  },
  {
    "question": "What is the vertical speed of a three engine turbojet aeroplane with one engine inoperative (N-1) and a mass of 75 000 kg?\n\nUsing the following:\ng  = 10 m/s² \n1 kt = 100 ft/min\nSIN( Angle of climb) = (Thrust- Drag)/ Weight",
    "feedback": "+1267 ft / min."
  },
  {
    "question": "A pilot performing a CAT flight suspects a fuel leak in a fuel tank and decides to divert to an alternate aerodrome. What is the flown speed that should be selected from the point of diversion to the alternate aerodrome?",
    "feedback": "VMD"
  },
  {
    "question": "A twin engined aeroplane (mass = 51'500 kg) is established on a climb with all engines operating. The lift-to-drag ratio is 12. Each engine produces 60'000 newtons of thrust. The gradient of climb is: (assume g = 10 m/s2)",
    "feedback": "15%"
  },
  {
    "question": "A pilot chooses the take-off speed \"wet V1\" when calculating take-off speeds for a contaminated runway. When compared to V1 for dry conditions, will the chosen \"wet V1\" be higher or lower?",
    "feedback": "Wet V1 would be lower for wet runway conditions"
  },
  {
    "question": "(For this Question use Performance Manual MEP1 Fig. 3.2)\n\nGiven :\nO.A.T : 25 °C\nPressure Altitude:  3000 ft\nTake off Mass:  4400 lbs\nWind:  310/20 kt\nRWY: 24L\nHeavy Duty Brakes installed\nOther conditions as associated in the header of the graph\n\nWhat is the accelerate and stop distance under the conditions given?",
    "feedback": "3750 ft"
  },
  {
    "question": "What is the minimum landing threshold clearance height for calculating landing distance?",
    "feedback": "50 feet"
  },
  {
    "question": "Consider the curve for the thrust required versus speed, for a jet aeroplane. What speed can be obtained from the minimum of this curve? The speed for:",
    "feedback": "Max Endurance, because fuel flow is proportional to thrust at the minimum"
  },
  {
    "question": "(For this Question use Performance Manual MRJT1 Fig.4.28)\nWhat is the minimum field length required for the worst wind situation, landing a twin jet aeroplane with the anti-skid inoperative?\nElevation: 2000 ft\nQNH: 1013 hPa\nLanding mass: 50 000 kg\nFlaps: as required for minimum landing distance\nRunway condition: dry\nWind: \nMaximum allowable tailwind: 15 kt\nMaximum allowable headwind: 50 kt",
    "feedback": "3100 m."
  },
  {
    "question": "Take-off performance data, for the ambient conditions, show the following limitations with flap 10° selected:\n- runway limit: 5 270 kg\n- obstacle limit: 4 630 kg\nEstimated take-off mass is 5 000kg.\nConsidering a take-off with flaps at:",
    "feedback": "5°, the obstacle limit is increased but the runway limit decreases"
  },
  {
    "question": "Refer to the Regulated Take-Off Mass (RTOM) table for runway 23L from take-off position VB. Use the data below to determine the appropriate V1, VFR, and V2 speeds for a reduced thrust take-off on a dry runway.\nFor this question do not interpolate. Choose the most conservative figures at all times:\nW/V 23010KTOAT -3°CQNH 1046 hPaEngine anti-ice ONPacks ONQuick line-upTake-off mass 71180 kgAssumed/FLEX T° 61°C",
    "feedback": "V1 135 kt, VR 136 kt, V2 140 kt"
  },
  {
    "question": "The figure shows a Regulated take-off Mass (RTOM) table for runway 23 L from take-off position VB. Determine the appropriate V1, VR, and V2 speeds for a reduced thrust take-off, given the information below:\nTake-off mass: 67050 kgRunway condition: wetW/V 05006KTOAT 14°CAssumed/FLEX T: 63°CQNH 1003 hPaEngine anti-ice OFFPacks OFF\n(do not interpolate, always choose the most conservative figures)",
    "feedback": "V1 123 kt, VR 126 kt, V2 132 kt"
  },
  {
    "question": "Which of the following statements regarding the reduced thrust take-off technique is correct?",
    "feedback": "Reduced thrust can be used when the actual take-off mass is less than the performance limited take-off mass."
  },
  {
    "question": "On a particular flight the value of V1 used on take-off exceeds the correct value of V1. If an engine fails at a speed immediately above the correct value of V1 then:",
    "feedback": "The accelerate/stop distance will exceed the accelerate/stop distance available"
  },
  {
    "question": "Which of the graphs illustrate the movement of the total drag curve when the undercarriage is extended?",
    "feedback": "Figure 4"
  },
  {
    "question": "How will the power required vary with IAS for increasing density altitude for a propeller aeroplane in the climb?",
    "feedback": "Power required will increase"
  },
  {
    "question": "(for this question use Performance Manual SEP1, Fig. 2.2)\nGiven the following information, what is the rotation speed?\nOutside Air Temperature (OAT): + 25°CAirport Pressure Altitude: 2500 ftHeadwind Component: 5 ktTake-Off Mass: 3600 lbFlap Setting: Approach",
    "feedback": "67 kts"
  },
  {
    "question": "V2 has to be equal to or higher than",
    "feedback": "1.1 VMCA."
  },
  {
    "question": "(for this question use Performance Manual MRJT1, Fig. 4.22)\nDuring a flight with all engines operating at FL350 with M .74 and a gross mass of 55000 kg in ISA conditions, one engine suddenly becomes inoperative. The Level Off Altitude will be:",
    "feedback": "21900 ft"
  },
  {
    "question": "Refer to the graph.\nGiven:\nPressure Altitude: 4000 ftTemperature: 22°CSlope: 2% upWind: 5 kts tailwind\nFind the corresponding landing distance required:",
    "feedback": "730 m"
  },
  {
    "question": "(for this question use Performance Manual SEP, Figure 2.1)\nAn extract of the flight manual of a single engine propeller aircraft is reproduced in the diagram. Given the following conditions:\nPressure Altitude: 1 500 ftOutside Temperature: +18°CWind Component: 4 knots tailwindTake-off mass: 2800 lbsRunway Surface: Hard, dryRunway Slope: 0%\nThe take-off distance will be:",
    "feedback": "1500 ft"
  },
  {
    "question": "To minimize the risk of hydroplaning during landing the pilot should:",
    "feedback": "make a \"positive\" landing and apply maximum reverse thrust and brakes as quickly as possible"
  },
  {
    "question": "A climb gradient required  is 3,3%. For an aircraft maintaining 100 kt  true airspeed  , no wind, this climb gradient corresponds to a rate of climb of approximately:",
    "feedback": "330 ft/min"
  },
  {
    "question": "With regard to the effect of altitude on the speed for maximum endurance for a propeller-driven aeroplane, as altitude increases, the speed for maximum endurance will ......",
    "feedback": "Feedback not found"
  },
  {
    "question": "With regard to the effect of altitude on the speed for maximum endurance for a propeller-driven aeroplane, as altitude increases, the speed for maximum endurance will ......",
    "feedback": "increase, because the power required increases with altitude"
  },
  {
    "question": "What is the primary advantage of using an increased V2 speed procedure (improved climb) on take-off?",
    "feedback": "The obstacle-limited take-off mass is increased"
  },
  {
    "question": "Due to standing water on the runway the field length limited take-off mass will be",
    "feedback": "lower."
  },
  {
    "question": "What effect has a downhill slope on the take-off speeds? The slope",
    "feedback": "decreases the take-off speed V1."
  },
  {
    "question": "If the airworthiness documents do not specify a correction for landing on a wet runway; the landing distance must be increased by:",
    "feedback": "15 %"
  },
  {
    "question": "Provided all other parameters stay constant. Which of the following alternatives will decrease the take-off ground run?",
    "feedback": "Decreased take-off mass, increased density, increased flap setting."
  },
  {
    "question": "Given the following information, calculate the landing distance required for a class B MEP:\nLDA: 4970 ftSurface type: GrassSurface condition: WetUpslope: 1 %",
    "feedback": "2628 ft"
  },
  {
    "question": "Regarding the obstacle limited take-off mass, which of the following statements is correct?",
    "feedback": "A take-off in the direction of an obstacle is also permitted in tail wind condition."
  },
  {
    "question": "Which of the following statements is true regarding a balanced field lenght?",
    "feedback": "A balanced field length provides the minimum required field length in the event of an engine failure."
  },
  {
    "question": "Which of the following characteristics is correct when describing compacted snow?",
    "feedback": "Snow compressed into a solid mass such that aeroplane tyres will run on it without further compaction of the surface"
  },
  {
    "question": "Which of the following statements are correct or incorrect?\n1) The more stringent airworthiness requirements of CS-25 enable a wider range of operating conditions for these aeroplanes2) Measured performance is the performance achieved by the operator under test conditions for certification",
    "feedback": "1) is correct, 2) is not correct"
  },
  {
    "question": "A turbojet aeroplane is flying long range cruise speed (LRC). A deviation of +/- 1000 ft from the optimum LRC altitude leads to change in specific range of 1.25 %. If the aircraft is flying 1000 ft above (1) or 2000 ft below (2) the optimum altitude, the specific range would change as follows:",
    "feedback": "(1) - 1.25 %, (2) - 2.5 %"
  },
  {
    "question": "Refer to the figure.\nGiven:Aircraft: Multi-engine piston (MEP)Flight: Commercial air transportTake-off distance available (TODA): 2300 ftRunway downslope: 1 %Runway surface and condition: Paved and dryAerodrome field length: Unbalanced\nThe de-factored take-off distance for entering the take-off performance graph is .......",
    "feedback": "2000 ft"
  },
  {
    "question": "The point where Drag coefficient/Lift coefficient is a minimum is",
    "feedback": "the lowest point of the drag curve."
  },
  {
    "question": "What is the maximum quick turnaround mass?",
    "feedback": "It is the maximum mass corresponding to the minimum time you need to wait before commencing another take-off"
  },
  {
    "question": "In certain conditions V2 can be limited by VMCA:",
    "feedback": "Low take-off mass, large flap extension, low field elevation."
  },
  {
    "question": "Which statement is correct?",
    "feedback": "The climb limited take-off mass depends on pressure altitude and outer air temperature"
  },
  {
    "question": "An aircraft has two certified landing flaps positions, 25° and 35°. If a pilot chooses 35° instead of 25°, the aircraft will have:",
    "feedback": "a reduced landing distance and degraded go-around performance"
  },
  {
    "question": "for this question unse CAP 698, Figure 3.1\nGiven the following information, find the ground roll and take-off distance for the multi-engine piston aeroplane:\nOAT + 22°CPressure altitude 4000 ftTake-off mass 4250 lb5 kt tailwind",
    "feedback": "Ground roll 2100 ft, take-off distance 2500 ft"
  },
  {
    "question": "Refer to the graph.\nGiven:\nAircraft Mass: 3200 lbsPressure Altitude: 10000 ftAirspeed (IAS): 100 kts\nFind the approximate rate of climb and the gradient of climb in ISA conditions by using the climb performance chart for the single engine aircraft.",
    "feedback": "800 ft/min and 6.6%"
  },
  {
    "question": "How does the Specific Range (SR) vary in a propeller-driven aeroplane?",
    "feedback": "SR increases slowly with altitude up to full throttle height"
  },
  {
    "question": "How does TAS vary in a constant Mach climb in the troposphere?",
    "feedback": "TAS decreases."
  },
  {
    "question": "Which of the following distances will increase if you increase V1, but VR remains unchanged?",
    "feedback": "Accelerate Stop Distance"
  },
  {
    "question": "The improved climb procedure can be used ......",
    "feedback": "when the runway is long and to clear distant obstacles"
  },
  {
    "question": "(For this question use Performance Manual SEP1, Figure 2.2)\nWith regard to the take-off performance chart for a commercial operation, determine the maximum take-off mass, given:\nOAT: 38°CPressure Altitude: 2500 ftHeadwind: 8 ktsFlaps: 10°TODA=ASDA=TORA: 2150 ftRunway condition: Wet, pavedRunway downslope: 2%",
    "feedback": "approx. 2960 lbs"
  },
  {
    "question": "(For this question use Performance Manual MRJT 1 Figure 4.4 ) For a twin engine turbojet aeroplane two take-off flap settings (5° and 15°) are certified. Given: Field length available= 2400 m Outside air temperature= -10°C Airport pressure altitude= 7000 ft The maximum allowed take-off mass is:",
    "feedback": "56 000 kg"
  },
  {
    "question": "A single engined class B aircraft has the following wind limitations:\nCrosswind: 17 ktHeadwind: 30 ktTailwind: 10 kt\nConsider a take-off from RWY 20 with a wind from 255°. What maximum wind speed allows to stay below the crosswind limit of 17 kt for take-off?(use trigonometry and use 2 decimal places in your calculation)",
    "feedback": "20 kt"
  },
  {
    "question": "What happens to Specific Range (SR) for a heavier aircraft?",
    "feedback": "SR reduces"
  },
  {
    "question": "(For this Question use Performance Manual SEP1 Fig. 2.4) Using the Landing Diagramm, for single engine aeroplane, determine the landing distance required (from a screen height of 50 ft), in the following conditions:  Given :  Pressure altitude: 4000 ft O.A.T.: 5°C Aeroplane mass: 3530 lbs Headwind component: 15 kt Flaps: down Runway: tarred and dry Landing gear: down",
    "feedback": "1400 ft"
  },
  {
    "question": "Maximum endurance for a piston engined aeroplane is achieved at:",
    "feedback": "The speed that approximately corresponds to the maximum climb angle speed."
  },
  {
    "question": "The speed for maximum endurance",
    "feedback": "is always lower than the speed for maximum specific range."
  },
  {
    "question": "(for this question use Performance Manual MRJT1, Fig. 4.24)\nGiven:\nPressure Altitude: 37000 ftTemperature: ISA -10°CGross Mass: 44000 kgEngine Anti-Ice: OnWing Anti-Ice: OffWind: 30 kts headObstacle: 23000 ft AMSL\nUsing the data, determine the drift down time, fuel burn and distance flown to clear the obstacle by the statutory minimum:",
    "feedback": "24 minutes, 700 kg, 122 NM"
  },
  {
    "question": "For an aircraft climbing at a constant IAS and a constant mass the drag will:",
    "feedback": "remain almost constant"
  },
  {
    "question": "Which of the following diagrams correctly shows the movement of the power required curve with increasing altitude .(H1 < H2)",
    "feedback": "Figure d"
  },
  {
    "question": "If all other parameters remain constant, what is the influence of mass on the maximum rate of climb (ROC) speed?",
    "feedback": "The ROC speed increases with increasing mass."
  },
  {
    "question": "Different cruise speed schedules are defined for commercial jet transport aircraft. Assuming that all other factors remain unchanged, what will be the effect of flying at long-range speed compared to maximum range speed?",
    "feedback": "A higher cost index"
  },
  {
    "question": "According to Part CAT, the correct statement regarding the declared runway distances is that ......",
    "feedback": "Feedback not found"
  },
  {
    "question": "According to Part CAT, the correct statement regarding the declared runway distances is that ......",
    "feedback": "they do not account for runway line-up, and are usually adjusted in case of a 90° entry or 180° turnaround"
  },
  {
    "question": "Referring to the figure, find the time taken (I), the fuel used (II) and distance travelled (III) to stabilising height for an aircraft that experiences an engine failure at 40000 ft with an all-up weight at the point of failure of 35000 lbs.",
    "feedback": "(I) 34 minutes, (II) 795 lbs, (III) 155 NM"
  },
  {
    "question": "How does weight influence the speed for max. endurance:",
    "feedback": "Speed for max. endurance increases with increasing weight."
  },
  {
    "question": "In straight horizontal steady flight, at speeds below that for minimum drag:",
    "feedback": "a lower speed requires a higher thrust"
  },
  {
    "question": "A twin engined aeroplane (mass = 68'500 kg) is established on a climb with all engines operating. The lift-to-drag ratio is 14, the AEO gradient of climb is 23.5%. What will be the OEI gradient of climb if one engine fails? (assume g = 10 m/s^2, constant L/D ratio)",
    "feedback": "8,2%"
  },
  {
    "question": "When determining the Maximum Landing Mass of a turbojet powered aeroplane druing the planning phase what factor must be used on the landing distance available (dry runway)?",
    "feedback": "0.60"
  },
  {
    "question": "Which statement concerning the balanced/unbalanced field concept is correct?",
    "feedback": "The balanced field concept provides only one single V1 value"
  },
  {
    "question": "During a descent at constant Mach Number, the margin to low speed buffet will:",
    "feedback": "increase, because the lift coefficient decreases."
  },
  {
    "question": "May anti-skid be considered to determine the take-off and landing data ?",
    "feedback": "Yes."
  },
  {
    "question": "(for this question use Performance Manual, pg. 2.5.2 and Fig. 4.8)\nGiven:\nPressure altitude: 3000 ftOutside Air Temperature (OAT): +30°CRunway Length Limited Take-off Mass (RLTOM): 60000 kgRunway: 2% upslopeFlaps: 5°Wind: 5 kts tailPMC: OnAir Conditioning (AC) Packs: Off\nUsing the above data, determine the VMCG and V1:",
    "feedback": "VMCG = 111 kts, V1 =147 kts"
  },
  {
    "question": "How does the maximum specific range over the ground (SRG) for a propeller driven aeroplane vary with altitude?",
    "feedback": "It increases until the increase in the ground speed is offset by the increase in power required"
  },
  {
    "question": "Initially, a pilot plans to use FLEX thrust setting for take-off. When lining up, the pilot decides to use TOGA thrust instead. What is the effect of using TOGA?",
    "feedback": "Improved performance"
  },
  {
    "question": "In level flight at a given speed, what happens to the drag if the aeroplane mass is increased?",
    "feedback": "It increases"
  },
  {
    "question": "The take-off mass of an aeroplane is restricted by the climb limit. What would be the effect on this limit of an increase in the headwind component?",
    "feedback": "None."
  },
  {
    "question": "Two aircraft of the same weight, configuration and altitude are climbing with the same pitch angle. Assume no compressibility effects and a standard atmosphere. Aircraft A is at Mach 0.75 and aircraft B is at Mach 0.73. Which will have the highest rate of climb?",
    "feedback": "Aircraft A"
  },
  {
    "question": "The Specific Fuel Consumption (SFC) for a propeller engine is ......",
    "feedback": "Fuel flow per unit of power"
  },
  {
    "question": "Which of the following speeds may vary if a stopway or clearway is available?",
    "feedback": "V1"
  },
  {
    "question": "(For this Question use Performance Manual SEP1 Fig. 2.4)\nWith regard to the landing chart for the single engine aeroplane determine the landing distance from a height of 50 ft .\n\nGiven :\nO.A.T : 27 °C\nPressure Altitude:  3000 ft\nAeroplane Mass:  2900 lbs\nTailwind component:  5 kt\nFlaps:  Landing position (down) \nRunway: Tarred and Dry",
    "feedback": "approximately : 1850 feet"
  },
  {
    "question": "Which of the following three speeds of a jet aeroplane are basically identical?\nThe speeds for:",
    "feedback": "holding, maximum climb angle and minimum glide angle."
  },
  {
    "question": "In level flight at a given speed, how is drag affected if aircraft mass increases?",
    "feedback": "It increases"
  },
  {
    "question": "The minimum allowed climb gradient for a twin-engine performance class A airplane in the 3rd take off segment is:",
    "feedback": "Only level acceleration is required"
  },
  {
    "question": "(For this Question use Performance Manual SEP1 Fig. 2.4)\nWith regard to the landing chart for the single engine aeroplane determine the landing distance from a height of 50 ft .\n\nGiven :\nO.A.T :                            0°C\nPressure Altitude:            1000 ft\nAeroplane Mass:             3500 lbs\nTailwind component:        5 kt\nFlaps:                            Landing position (down) \nRunway:                         Tarred and Dry",
    "feedback": "approximately : 1650 feet"
  },
  {
    "question": "When calculating approach speeds, the minimum approach speed in the initial approach phase is usually",
    "feedback": "1,4-1,5 times Vs1"
  },
  {
    "question": "How does runway slope affect allowable take-off mass, assuming other factors remain constant and not limiting?",
    "feedback": "A downhill slope increases allowable take-off mass."
  },
  {
    "question": "Long range cruise is a flight procedure which gives:",
    "feedback": "a specific range which is approximately 99% of maximum specific range and a higher cruise speed"
  },
  {
    "question": "The angle of attack required to attain the maximum still-air range for a turbo-jet aeroplane is:",
    "feedback": "less than that for the maximum lift to drag ratio"
  },
  {
    "question": "Refer to CAP 698, Figure 4.6\nThe medium range jet transport (MRJT) is scheduled to depart from Madrid airport. Using the date below, what is the tyre-speed limited mass for take-off?\nAirport elevation: 1998 ftOAT: +38°CWind: 8 kt tailwindTyres: 225 mphFlaps: 5°Power Management Computer (PMC): ON",
    "feedback": "73900 kg"
  },
  {
    "question": "What is the consequence of using a dry V1 on a wet runway for the Accelerate Stop Distance ASD?",
    "feedback": "The ASD increases, and the runway becomes unbalanced"
  },
  {
    "question": "When V1 has to be reduced because of a wet runway the one engine out obstacle clearance / climb performance:",
    "feedback": "decreases / remains constant."
  },
  {
    "question": "With respect to the optimum altitude, which of the following statements is correct ?",
    "feedback": "An aeroplane sometimes flies above or below the optimum altitude because optimum altitude increases continuously during flight."
  },
  {
    "question": "(for this question use Performance Manual MRJT1, Fig. 4.5)\nGiven:\nClimb Limited Take-Off Mass (CLTOM): 48020 kgAirport pressure altitude: 6000 ftFlaps: 15°CPacks: OffAnti-Ice: OffPMC: On\nWhat is the maximum airport Outside Air Temperature (OAT) at which the take-off can be performed under those conditions?",
    "feedback": "30°C"
  },
  {
    "question": "Which T/O condition is most likely resulting in the poorest climb performance?",
    "feedback": "5000' field elevation, ISA + 20o, T/O flaps 30°"
  },
  {
    "question": "The speed VLO is defined as",
    "feedback": "landing gear operating speed."
  },
  {
    "question": "Which of the following statements is true for a turbo-engined aircraft descending in standard conditions?",
    "feedback": "IAS remains constant, EAS increases, TAS and Mach decrease"
  },
  {
    "question": "You are the pilot flying of a medium jet aeroplane and you are using the autopilot to maintain a constant vertical speed and autothrust is maintaining a constant airspeed (CAS) while flying a Continuous Descent Approach (CDA). As the aeroplane is gradually slowing down from minimum clean speed of 213 kt to 180 kt, you selected approach flaps.\nDisregarding any other factors, the ......",
    "feedback": "vertical speed must be reduced to maintain the trajectory, and when the approach speed stabilises, the autothrust will demand more thrust to maintain the speed"
  },
  {
    "question": "for this question use CAP 698, Figure 4.1\nA flight has been planned to operate at the maximum field-length limited take-off mass (FLLTOM). This was based upon the planned runway being 04 and the forecast wind to be light and variable. During taxi, an aircraft just ahead was cleared to take-off and the reported wind was 27020 KT. What observations should the flight crew raise, given this updated wind?",
    "feedback": "The aircraft performance should be re-calculated prior to take-off because there is now a tailwind of approximately 13 KT"
  },
  {
    "question": "(For this question use Performance Manual MRJT 1 Figure 4.24)\nWith regard to the drift down performance of the twin jet aeroplane, why does the curve representing 35 000 kg gross mass in the chart for drift down net profiles start at approximately 3 minutes at FL370?",
    "feedback": "Because at this mass it takes about 3 minutes to decelerate to the optimum speed for drift down at the original cruising level."
  },
  {
    "question": "Consider standard atmosphere conditions and no loss of performance due to altitude. An aircraft is climbing through FL260 at a constant CAS of 300 kt. The current rate of climb is 2000 ft/min and Mach is 0.76. The pilot decides to switch to a climb with constant Mach 0.76. How will the rate of climb and TAS behave?",
    "feedback": "TAS decreases, rate of climb increases"
  },
  {
    "question": "in a multi engine aeroplane the critical engine is",
    "feedback": "The engine which causes the largest yawing moment upon engine failure"
  },
  {
    "question": "For a turboprop powered aeroplane, a 2200 m long runway at the destination aerodrome is expected to be \"wet\". The \"dry runway\" landing distance, should not exceed:",
    "feedback": "1339 m."
  },
  {
    "question": "What is gross performance?",
    "feedback": "Calculated performance with no safety factor"
  },
  {
    "question": "Which of the following statements with regard to the optimum cruise altitude (best fuel mileage) is correct?",
    "feedback": "An aeroplane sometimes flies above the optimum cruise altitude, because ATC normally does not allow to fly continuously at the optimum cruise altitude."
  },
  {
    "question": "At a higher gross mass on a piston-engined aeroplane, in order to maintain a given angle of attack, configuration and altitude:",
    "feedback": "the airspeed must be increased and the drag will also increase"
  },
  {
    "question": "What happens to jet endurance with altitude?",
    "feedback": "Endurance is maximum at a high levels, low OAT, and design RPM"
  },
  {
    "question": "Some wind limitations may apply in case of contaminated runways. Those limitations are to be found in ......",
    "feedback": "Part B of the Operations Manual"
  },
  {
    "question": "What is the advantage of balancing V1, even in the event of a climb limited take-off?",
    "feedback": "The safety margin with respect to the runway length is greatest."
  },
  {
    "question": "(for this question use Performance Manual MEP1, Fig. 3.6)\nGiven:\nPerformance Class: BTake-off Mass: 4000 lbsCloud Base: 400 ftabove reference zero:Obstacle distance (from end of TODR): 13000 ftObstacle height above reference zero: 600 ftTAS: 102 ktsOAT: +10°CPressure Altitude: 2000 ftWind: Calm\nFind the minimum obstacle clearance above the obstacle:(Note: Take-off power can be used for the entire climb segment)",
    "feedback": "248 ft"
  },
  {
    "question": "An airport has a 3000 metres long runway, and a 2000 metres clearway at each end of that runway. For the calculation of the maximum allowed take-off mass, the take-off distance available cannot be greater than:",
    "feedback": "4500 metres."
  },
  {
    "question": "(For this Question use Performance Manual SEP1 Fig. 2.3) With regard to the climb performance chart for the single engine aeroplane determine the climb speed (ft/min).  Given : O.A.T : ISA + 15°C Pressure Altitude: 0 ft Aeroplane Mass: 3400 lbs Flaps: up Speed: 100 KIAS",
    "feedback": "1290 ft/min"
  },
  {
    "question": "Which data can be extracted from the Buffet Onset Boundary Chart?",
    "feedback": "The values of the Mach number at which low speed and Mach buffet occur at various masses and altitudes."
  },
  {
    "question": "A head wind will:",
    "feedback": "increase the climb flight path angle."
  },
  {
    "question": "If the field length limited take off mass has been calculated using a Balanced Field Length technique, the use of any additional clearway in take off performance calculations may allow",
    "feedback": "a greater field length limited take off mass but with a lower V1"
  },
  {
    "question": "Long range cruise is selected as",
    "feedback": "the higher speed to achieve 99% of maximum specific range in zero wind."
  },
  {
    "question": "(for this question use Performance Manual MEP1, Fig. 3.6)\nGiven:\nMass: 4300 lbHeadwind: 25 ktTemperature: 28°CPressure Altitude: 3000 ft\nFind the approximate all engine rate of climb (ROC) and the single engine rate of climb.",
    "feedback": "All engine ROC 1700 ft/min, single engine rate of climb 335 ft/min"
  },
  {
    "question": "Considering a turbine powered aircraft (certificated under CS 25), when passing 35 feet at the end of the take-off distance, the speed should not be less than",
    "feedback": "1.2 Vs or 1.1 Vmca"
  },
  {
    "question": "The thrust of a jet engine at constant RPM",
    "feedback": "increases in proportion to the airspeed."
  },
  {
    "question": "(For this Question use Performance Manual SEP1 Fig. 2.2) With regard to the take off performance chart for the single engine aeroplane determine the take off distance over a 50 ft obstacle height.  Given : O.A.T : 30°C Pressure Altitude: 1000 ft Aeroplane Mass: 2950 lbs Tailwind component: 5 kt Flaps: Approach setting Runway: Short, wet grass, firm subsoil Correction factor: 1.25 (for runway conditions)",
    "feedback": "2000 ft"
  },
  {
    "question": "Regarding take-off, the take-off decision speed V1:",
    "feedback": "is the airspeed on the ground at which the pilot is assumed to have made a decision to continue or discontinue the take-off."
  },
  {
    "question": "If other factors are unchanged, the fuel mileage (nautical miles per kg) is",
    "feedback": "lower with a forward centre of gravity position."
  },
  {
    "question": "On a dry runway the accelerate stop distance is increased",
    "feedback": "by uphill slope."
  },
  {
    "question": "Which of the following statements are correct or incorrect?\n1) In order to achieve a sufficient level of safety, the weight of a dispatched aeroplane may be limited2) Measured performance is the performance achieved by the manufacturer under test conditions for certification",
    "feedback": "1) and 2) are correct"
  },
  {
    "question": "If the aerodrome pressure altitude increases it will:",
    "feedback": "increase the take-off distance"
  },
  {
    "question": "If the level-off altitude is below the obstacle clearance altitude during a drift down procedure",
    "feedback": "fuel jettisoning should be started at the beginning of drift down."
  },
  {
    "question": "Two identical aeroplanes at different masses are descending at zero wind and zero thrust. Which of the following statements correctly describes their descent characteristics ?",
    "feedback": "At a given angle of attack, both the vertical and the forward speed are greater for the heavier aeroplane."
  },
  {
    "question": "Considering VR, Which statement is correct?",
    "feedback": "VR is the speed at which rotation should be initiated."
  },
  {
    "question": "Which of the following speed schedules, applicable to the same aeroplane, represents the highest cost index?",
    "feedback": "Climb 340 KT/M 0.80, Cruise M 0.80, Descent M 0.80/340 KT"
  },
  {
    "question": "A single-engined piston aeroplane is flying at an altitude of 5000 ft with a constant tailwind component of 15 kt. Given the following information, if the engine fails at this altitude, what should be the expected net glide distance over ground with an elevation of 250 ft?\nL/D: 9.1:1TAS: 120 kt1 NM = 6080 ftstill air distance = (height difference / net gradient) x 100. Ground distance = Still Air Distance x (GS/TAS)",
    "feedback": "7.7 NM"
  },
  {
    "question": "An increase in atmospheric pressure has, among other things, the following consequences on take-off performance:",
    "feedback": "a reduced take-off distance and improved initial climb performance"
  },
  {
    "question": "Which speed represents the maximum endurance speed for a propeller driven aeroplane?",
    "feedback": "Minimum power speed"
  },
  {
    "question": "Consider two jet aircraft of the same type. The take-off mass of Jet 1 is 75000 kg, and for Jet 2 it is 67000 kg. Jet 1 will have a (1) ....... speed for best angle of climb, and a (2) ...... speed for best rate of climb.",
    "feedback": "(1) higher, (2) higher"
  },
  {
    "question": "The approach climb requirement has been established to ensure:",
    "feedback": "minimum climb gradient in case of a go-around with one engine inoperative."
  },
  {
    "question": "For which hydroplaning speed would you use a factor of 9, used in the following formula: (9 x √ tyre pressure)?",
    "feedback": "Dynamic hydroplaning"
  },
  {
    "question": "How is V2 affected if T/O flaps 20° is chosen instead of T/O flaps 10°?",
    "feedback": "V2 decreases if not restricted by VMCA."
  },
  {
    "question": "A two engine turbojet has to initiate a turn in the second segment of the take-off flight path. During the turn there is an obstacle that requires a net climb gradient of 2.0 % in order to clear the obstacle. The bank angle during the turn is 15° and the flight manual gives a decrement for the turn of 0.5 %.\nTaking into account both the Regulation and obstacle clearance, what will be the minimum gross gradient required before commencing the turn?",
    "feedback": "Feedback not found"
  },
  {
    "question": "A two engine turbojet has to initiate a turn in the second segment of the take-off flight path. During the turn there is an obstacle that requires a net climb gradient of 2.0 % in order to clear the obstacle. The bank angle during the turn is 15° and the flight manual gives a decrement for the turn of 0.5 %.\nTaking into account both the Regulation and obstacle clearance, what will be the minimum gross gradient required before commencing the turn?",
    "feedback": "3.3 %"
  },
  {
    "question": "An aircraft has two certified landing flaps positions, 25° and 35°. If a pilot chooses 25° instead of 35°, the aircraft will have:",
    "feedback": "an increased landing distance and better go-around performance"
  },
  {
    "question": "A pilot will commence a drift down procedure after encountering an engine failure ......",
    "feedback": "when cruising above the operating altitude for one engine inoperative"
  },
  {
    "question": "The effect that a tailwind has on the value of the maximum endurance speed is:",
    "feedback": "none"
  },
  {
    "question": "Determine the minimum speed at 50 ft above the take-off surface level if the aircraft is an aeroplane with a single engine and a VS1 of 67 kt:",
    "feedback": "81 kt"
  },
  {
    "question": "Which factor must be applied, if not stated differently in the AFM, for a performance Class B aeroplane when taking off on an runway with 2 % upslope?",
    "feedback": "1.10"
  },
  {
    "question": "Refer to a turbojet aeroplane which is maintaining a constant IAS and pressure altitude.What is the change in the specific fuel consumption if the outside air temperature is 10°C warmer than ISA?\n(Assumption: An ISA deviation of ± 1°C results in a change in fuel flow of ± 0.2 %)",
    "feedback": "The SFC increases by 2 %"
  },
  {
    "question": "The take-off distance of an aircraft is 800m in standard atmosphere, no wind at 0 ft pressure-altitude. Using the following corrections :  \"± 20 m / 1 000 ft field elevation \" \"- 5 m / kt headwind \" \"+ 10 m / kt tail wind \" \"± 15 m / % runway slope \" \"± 5 m / °C deviation from standard temperature \"  The take-off distance from an airport at 2 000 ft elevation, temperature 21°C, QNH 1013.25 hPa, 2% up-slope, 5 kt tail wind is :",
    "feedback": "970 m"
  }
]