[
  {
    "question": "(For this Question use Fuel Planning MRJT1 Figure 4.3.5) The following apply:\nTemperature: ISA +15°CBrake release mass: 62000 kgTrip time: 5 h 20 min\nWhat is the trip fuel?",
    "feedback": "13500 kg"
  },
  {
    "question": "(For this Question use MRJT1 Long Range Cruise Simplified Flight Planning)\nFor a flight of 2800 ground nautical miles the following apply :\nHeadwind component                  15kt\nTemperature                         ISA +15°C\nCruise altitude                     35000ft\nLanding mass                        50000kg\n\nThe trip fuel and trip time respectively are:",
    "feedback": "17600 kg, 6 hrs 50 min"
  },
  {
    "question": "Which equipment failure must not be reported to ATC on a RVSM level?",
    "feedback": "Main hydraulic-pump failure"
  },
  {
    "question": "Given:\nMissed approach at destination: 300 kgClimb to cruising level: 800 kgCruise: 900 kgDescent to the alternate: 100 kgApproach and landing at alternate: 210 kgFuel flow for holding at alternate: 2120 kg/hrMissed approach at alternate: 210 kg\nCalculate the required alternate fuel.",
    "feedback": "2310 kg"
  },
  {
    "question": "Given the following information for a commercial air transport operation, calculate the maximum possible extra fuel to be uplifted.\nMaximum zero fuel mass: 62731 kgActual zero fuel mass: 62700 kgRegulated take-off mass: 76000 kgMaximum landing mass: 66360 kgFuel tank capacity: 16000 kgTaxi fuel: 240 kgTrip fuel: 10000 kgMinimum block fuel: 13100 kg",
    "feedback": "440 kg"
  },
  {
    "question": "Alternate Fuel:",
    "feedback": "Includes the fuel for the missed approach procedure at the destination aerodrome"
  },
  {
    "question": "(for this question use Flight Planning Manual, MRJT1, Figure 4.5.3.2, PA 35000 ft)\nWhat will be the approximate change in ground distance covered per 1000 kg of fuel burnt if the headwind increases from 25 kt to 35 kt?\nAircraft mass at start of cruise leg: 65000 kgCruise level: FL350Cruise speed: Mach 0.74Forecast OAT at FL350: -65°CHeadwind at FL350: 25 kt",
    "feedback": "Reduces by 3 NM"
  },
  {
    "question": "The figure depicts a fuel plan as created by a flight planning tool for a return flight LFPG-EIDW-LFPG. During the pre-flight preparations, the operations department advises the pilot to refuel at LFPG, due to some fuel supply issues at EIDW. In order to reduce the environmental impact, the pilot considers the least possible fuel tankering. What is the minimum amount of fuel tankering to ensure the target fuel for EIDW-LFPG remains on board after landing at EIDW?",
    "feedback": "5506 kg"
  },
  {
    "question": "If a pilot wishes to cancel an IFR flight plan and proceed under VFR in VMC, he must inform ATC and include the phrase:",
    "feedback": "cancelling my IFR flight"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, chart 13-2\nAfter a VOR Y RWY 10 approach the landing is not possible due to strong tailwinds. What is the appropriate procedure to complete the landing?",
    "feedback": "Circle to the south of the airport and land on runway 28"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)4\nWhat is the correct ATIS frequency for LYON SAINT EXUPERY LFLL (N45°43.54 'E005°04.87')?",
    "feedback": "126.17 MHz"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1, fig. 4.5.1)\nGiven: Brake release mass 57500 kg, Temperature ISA -10°C, Average headwind component 16 kt, Initial FL 280\nFind: Climb fuel for enroute climb 280/.74",
    "feedback": "1138 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(HI)2\nYou are cleared to route LANDS END (N50°08.2' W005°38.2') direct to HONILEY (N52°21.4' W001°39.8') and you estimate Lands End at 0957.  TAS: 500 kts W/V 270°(M)/50 kts  What is your approximate mean magnetic track and estimate for Honiley?",
    "feedback": "051°, 1019"
  },
  {
    "question": "Planned and actual data as shown in the Flight Log excerpt.\n\nArriving overhead GAMMA you are cleared for direct routeing to MIKE. The flight time for direct flight GAMMA to MIKE will be 1h 08 min. Provided that flight conditions on the direct leg GAMMA to MIKE remain unchanged and fuel consumption remains unchanged, what fuel remaining should be expected at waypoint MIKE?",
    "feedback": "1272 kg"
  },
  {
    "question": "When completing an ATS flight plan for a flight commencing under IFR but possibly changing to VFR, the letters entered in Item 8 (FLIGHT RULES) would be :",
    "feedback": "Y"
  },
  {
    "question": "The commander decided to load an extra 120 kg of fuel before take-off due to an expected holding as communicated by ATC:\nTake-off fuel: 910 kgTrip fuel: 730 kgZero fuel weight (ZFW): 3230 kgMaximum landing weight (MLW): 3860 kgMaximum take-off weight (MTOW): 4290 kg",
    "feedback": "No need to hold, there is no operational impact"
  },
  {
    "question": "Due to significant weather conditions in the vicinity of the destination aerodrome, the pilot of a commercial air transport flight has to plan two destination alternate aerodromes. Given the following information, what is the alternate fuel required?\nAverage cruise fuel flow: 46 kg/minFuel for missed approach: 400 kgFlight time from missed approach altitude to destination alternate 1: 54 minFlight time from missed approach altitude to destination alternate 2: 44 min",
    "feedback": "2884 kg"
  },
  {
    "question": "A turbojet aeroplane is prepared for a 1300 NM flight at FL 350, with a true airspeed of  460 kt and a head wind of 160 kt. The take-off runway limitation is 174 000 kg, the planned departure mass is 160 000 kg. The departure fuel price is equal to 0.92 times the arrival fuel price (fuel price ratio = 0.92). In order for the airline to optimize its savings, the additional fuel quantity that must be loaded on board is:",
    "feedback": "14 000 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM, Chart E(LO)2\nAn aircraft is en-route from position A (N55°43', W004°17') to position B (N54°53', W002°53'). Using this information, determine the initial track from position A to position B and the distance from position A to the point of crossing latitude N55°00'.",
    "feedback": "Track 136°(T), Distance 58 NM"
  },
  {
    "question": "Refer to Jeppesen GSPRM - VFR Chart ED-4\nDeparture airfield: Regensburg/Germany (EDNR, N49°08.52' E012°04.92')Destination airfield: Strunkovice/Czech Republic (LKSR, N49°04.95' E014°04.55')\nWhat is the magnetic course from EDNR to LKSR?",
    "feedback": "090°"
  },
  {
    "question": "Refer to GSPRM Stuttgart, chart 12-2\nIf you carry out an RNP approach to runway 25 at Stuttgart airport, what will be the distance covered from the Initial Approach Fix IAF to the Rwy 25 threshold?",
    "feedback": "26 NM"
  },
  {
    "question": "For this flight, how does the fuel consumption from Top of Climb to TORDU compare to the planned fuel consumption?\n(all flight logs are in kg)\nThe fuel consumption is ....",
    "feedback": "5 kg/h higher than planned"
  },
  {
    "question": "For non-augmented GNSS operations, why must the availability of the GNSS service be checked before use?",
    "feedback": "There is no indication on the flight deck in the case of the loss of a required satellite signal"
  },
  {
    "question": "Your aircraft has a Maximum Certified Take-off Mass of 140000 kg. Today your calculated Take-off Mass is 130000 kg. What letter should appear in the WAKE TURBULENCE CATEGORY on the flight plan form?",
    "feedback": "H"
  },
  {
    "question": "Given the following information for a commercial air transport operation, calculate the maximum possible extra fuel to be uplifted.\nMaximum zero fuel mass MZFM: 2000 kgActual zero fuel mass AZFM: 2000 kgRegulated take-off mass RTOM: 2900 kgMaximum landing mass MLM: 2600 kgFuel tank capacity: 950 kgTrip fuel TF: 350 kgMinimum block fuel BF: 500 kg",
    "feedback": "400 kg"
  },
  {
    "question": "A flight is being dispatched with the APU inoperative. The expected time of taxi is 10 minutes. What is the required taxi fuel for the given flight considering the fuel policy requirements of the company?",
    "feedback": "200 kg"
  },
  {
    "question": "Refer to the extract from a typical flight plan produced by an airline flight planning tool.\nWhat is the total flight time from Skiathos (LGSK) to Kavala (LGKV)? In order to calculate the total flight time, find the EET to Thessaloniki (TSL):",
    "feedback": "38 minutes"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1)\nHOLDING PLANNING \nThe fuel required for 30 minutes holding, in a racetrack pattern, at PA 1500 ft, mean gross mass 45 000 kg, is :",
    "feedback": "1090 kg"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1, fig. 4.3.5) Given the following : Head wind component 50 kt Temperature ISA + 10°C Brake release mass 65000kg Trip fuel available 18000kg What is the maximum possible trip distance ?",
    "feedback": "2740 NM"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)2, section 6C\nDetermine magnetic course and distance from TRENT VORDME (TNT) to waypoint TIPIL:",
    "feedback": "341° / 7 NM"
  },
  {
    "question": "The calculated fuel for a flight is 2500 kg. However, due to expected delays during flight, the commander decides to order an additional 100 kg of fuel. Due to miscommunication, the refuelling team provides only 2500 kg. In this situation, the refuelling team must:",
    "feedback": "Be informed because those 100 kg are part of the necessary fuel for the flight"
  },
  {
    "question": "On a ATC flight plan, to indicate that you will overfly the way-point ROMEO at 120 kt at flight level 085, you will write :",
    "feedback": "ROMEO / N0120 F085"
  },
  {
    "question": "Determine the minimum planning fuel required for departure, for the following planned flight with a Performance Class A aeroplane.\n(assume the Basic Fuel Scheme without variations applies. A destination alternate is required)\nTrip fuel: 2862 lbContingency fuel: 143 lbDestination alternate fuel: 494 lbFinal reserve fuel: 430 lbTaxi fuel: 100 lbExtra fuel: 0 lbTankering fuel: 971 lb",
    "feedback": "4029 lb"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1 Figure 4.5.3.2)\nFind the fuel flow for the twin jet aeroplane. Given:\nCruise: Mach 0.74 at FL310Mass: 50000 kgTemperature: ISA",
    "feedback": "2300 kg/hr"
  },
  {
    "question": "In the event of a delay of 30 minutes in excess of the EOBT for a controlled flight, which of the following actions is required?",
    "feedback": "The flight plan should be amended or a new flight plan should be submitted and the old flight plan cancelled, whichever is applicable"
  },
  {
    "question": "What are the dimensions of runway 08/26 at Esbjerg?",
    "feedback": "2600 m x 45 m"
  },
  {
    "question": "(For this question use Flight Planning Manual MRJT 1 Figure 4.5.1) Given : mass at brake release 57 500 kg; temperature ISA -10°C; average head wind component 16 kt initial cruise FL 280 Find: climb fuel",
    "feedback": "1138 kg"
  },
  {
    "question": "During an IFR flight in a Beech Bonanza the fuel indicators show that the remaining amount of fuel is 100 lbs after 38 minutes. The total amount of fuel at departure was 160 lbs. For the alternate fuel, 30 lbs is necessary. The planned fuel for taxi is 13 lbs. Final reserve fuel is estimated at 50 lbs. If the fuel flow remains the same, how many minutes can be flown to the destination with the remaining fuel?",
    "feedback": "12 minutes."
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1) Given: Brake release mass 57500 kg, Initial FL 280, average temperature during climb ISA -10°C, average head wind component 18 kt Find: Climb time for enroute climb 280/.74",
    "feedback": "13 min"
  },
  {
    "question": "In the appropriate box of a flight plan form, corresponding to the estimated time of departure, the time indicated is that at which the aircraft intends to :",
    "feedback": "go off blocks"
  },
  {
    "question": "What mean temperature (°C) is likely on a true course of 270° from 025° E to 010°E at 45°N ?",
    "feedback": "-50"
  },
  {
    "question": "Regarding Instrument Approach Procedures (IAPs):\n1) ICAO type B charts provide information for the application of obstacle clearing and marking criteria2) CAT I is an ILS approach procedure to a decision height not lower than 200' (60m), a visibility not less than 2400' (800 m), or an RVR not less than 1800' (550 m)3) An instrument approach can be enhanced by ground based augmentation systems (GBAS)4) A non-precision approach uses lateral and vertical guidance\nThe combination regrouping all of the correct statements is:",
    "feedback": "1, 2, 3"
  },
  {
    "question": "Planned and actual data as shown in the Flight Log excerpt.\n\nProvided that flight conditions on the leg GAMMA to DELTA remain unchanged and fuel consumption remains unchanged, what fuel remaining should be expected at waypoint DELTA?",
    "feedback": "4640 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)1 An aircraft has to fly from the airport Aberdeen Dyce EGPD (N57°12.15' W002°11.89) to the airport at Benbecula EGPL(N57°28.84' W007°21.84'). Given:  Time to climb: 11 min Time to descend: 9 min TAS: 170 kts W/V: 230/50  What is the flight time during the cruise?",
    "feedback": "54 min"
  },
  {
    "question": "Assuming the following data: . Ground distance to be covered: 2 500 NM . Cruise flight level: FL 350 . Cruising speed: Mach 0.82 (true airspeed: 470 kt) . Tailwind component: 40 kt . Planned destination landing mass: 150 000 kg . Temperature: ISA  . CG: 37% . Total anti-ice: OFF . Air conditioning: normal Fuel consumption for such a flight is:",
    "feedback": "27 800 kg"
  },
  {
    "question": "Given:\n. Mass at brake release: 190 000 kg . Selected cruise speed: 0.82 Mach . Flight leg distance: 1 500 NM . Cruise level: optimum . Air conditioning: standard . Anti-icing: OFF . Temperature: ISA . CG: 37%\nAssuming zero wind, the planned flight time from take-off to landing needed to complete this flight will be:",
    "feedback": "209 minutes"
  },
  {
    "question": "In an ATS flight plan Item 15, in order to define a position as a bearing and distance from a VOR, the group of figures should consist of :",
    "feedback": "VOR ident, magnetic bearing and distance in nautical miles"
  },
  {
    "question": "What is general the “most critical fuel scenario” on the B737-300?",
    "feedback": "The two engine fuel scenario"
  },
  {
    "question": "refer to the figure.\nYou are planning a return trip from London. Heathrow to St. John's. Newfoundland. Operations has informed you that the fuel at St. John's is much more expensive and want to know how much extra fuel you can tanker. Given the following information, what quantity of extra fuel is the aircraft able to carry?\nAssume a departure/destination fuel price ratio of 0.915Cruise flight level: FL350Air distance to be covered: 2000 NMMTOM: 205000 kgMLM: 175000 kgPlanned TOM: 185000 kgFuel tank capacity: 40000 kgPlanned T/O fuel: 30000 kgPlanned trip fuel: 18000 kg",
    "feedback": "8000 kg"
  },
  {
    "question": "(For this question Flight Planning Manual MRJT 1 Figure 4.5.3.1) Given: flight time from top of climb to the enroute point in FL280 is 48 min. Cruise procedure is long range cruise (LRC). Temp. ISA -5° C Take-off mass 56 000 kg Climb fuel 1 100 kg Find: distance in nautical air miles (NAM) for this leg and fuel consumption:",
    "feedback": "345 NAM; 2000 kg"
  },
  {
    "question": "Refer to the data sheet below.\n\nThe flight crew of a turbojet aeroplane prepares a flight using the following data:\n- Flight level FL 370 at \"Long Range\" (LR) cruise regime\n- Mass at brake release: 212 800 kg\n- Flight leg ground distance: 2 500 NM\n- Temperatures: ISA\n- CG: 37%\n- Headwind component: 30 kt\n- \"Total anti-ice\" set on \"ON\" for the entire flight\n- No requested climb and descent correction of the fuel consumption\nThe fuel consumption (from take-off to landing) is:",
    "feedback": "34 430 kg"
  },
  {
    "question": "Planned and actual data as shown in the Flight Log excerpt (Fuel Planning Section).\n\nAfter a balked landing at the destination airport, you have to divert to the alternate airport with the gear extended. The re-calculated flight time to the alternate due to the reduced speed is 1h 20 min and the fuel flow will be 720 kg/h. \nFinal Reserve Fuel remains unchanged.\nWhat will be the estimated landing mass at the alternate airport?",
    "feedback": "5669 kg"
  },
  {
    "question": "Determine the revised estimated landing mass at the destination aerodrome, given the following information:\nDOM: 9950 lbTraffic load: 3450 lbRemaining useable fuel: 2500 lbRemaining trip fuel to destination: 1200 lbDestination alternate fuel: 525 lbFinal reserve fuel: 415 lb",
    "feedback": "14700 lb"
  },
  {
    "question": "In an ATS flight plan, Item 15 (route), a cruising pressure altitude of 32000 feet would be entered as :",
    "feedback": "F320"
  },
  {
    "question": "Which of the following is an example of how to identify, on an instrument approach chart, a procedure which necessitates the designation RNP AR APCH?",
    "feedback": "A procedure with a curved final approach segment"
  },
  {
    "question": "Given the following information for a commercial air transport operation, calculate the maximum possible extra fuel, including any fuel penalty, that can be uplifted.\nMTOM: 875000 lbMLM: 652000 lbMZFM: 555100 lbDOM: 394100 lbTraffic load: 109350 lbTrip fuel: 289750 lbPlanned take-off fuel: 315315 lbTaxi fuel: 1600 lbFuel penalty for carrying extra fuel: 470 lb per 1000 lb of extra fuelFuel tank capacity: 377750 lb",
    "feedback": "56235 lb"
  },
  {
    "question": "Refer to Jeppesen GSPRM, VFR chart Friedrichshafen (EDNY) 19-1\nYou are planning a VFR departure from Friedrichshafen aerodrome (EDNY) using runway 24. What is the correct departure procedure via point NOVEMBER?",
    "feedback": "315°(M), flying not above 3000 ft"
  },
  {
    "question": "(For this question use Flight Planning Manual MRJT 1 Figure 4.4) Planning a flight from Paris Charles de Gaulle to London Heathrow for a twin - jet aeroplane. Preplanning: Dry Operating Mass (DOM): 34 000 kg Traffic Load: 13 000 kg The holding is planned at 1 500 ft above alternate elevation. The alternate elevation is 256 ft. The holding is planned for 30 minutes with no reductions. Determine the Estimated Landing Mass at alternate Manchester.",
    "feedback": "48 125 kg."
  },
  {
    "question": "Refer to the flight plan form:\nWhat is your planned cruising level when flying inbound YLOJARVI?",
    "feedback": "4000 ft"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, charts 19-1, 19-2, 19-3\nHow many VFR corridors are published?",
    "feedback": "2"
  },
  {
    "question": "A pilot is planning to follow an IFR route between two airports. One of the segments is across a longer distance of water where the route segment has been given the two limiting altitudes specified below. How can the pilot correctly apply these limiting altitudes?\nMEA: 4500 ftMOCA: 1500 ft",
    "feedback": "Plan to fly at 5000 ft or above to clear obstacles and to have adequate reception of radio navigation aids and communications"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1 Figure 4.3.3a)\nFind the fuel required given the following:\nCruise: FL280/M 0.78Mass: 50000 kgDistance: 200 NMHeadwind component: 30 kts",
    "feedback": "1740 kg"
  },
  {
    "question": "The following NOTAM is given:\nQ) EGPX/QCAAS/IV/B/AE/000/021/5857N00254W002A) EGPAB) FROM: 16/12/30 17:00C) TO: 17/01/31 19:00E) KIRKWALL MAIN VHF TRANSMITTER 118.3 MHZ WITHDRAWN FROM SERVICE DUE FAULT. STANDBY TRANSMITTER IN USE WITH REDUCED RANGE AND COVERAGE.\nIf an aircraft is within the reduced range, what service might not be available from Kirkwall?",
    "feedback": "ATC clearances"
  },
  {
    "question": "An aerodrome has an ILS approach to runway 20 with a decision altitude of 250 feet. If the aerodrome elevation is 110 feet, what is the Category of approach?",
    "feedback": "Category II"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Nantes, charts 19-1, 19-2, 19-3\nYou need to transit around Nantes airport on a VFR flight. Intentions are to be reported to:",
    "feedback": "Nantes Information"
  },
  {
    "question": "An IFR flight is planned across terrain where the maximum elevation is 4385 ft. The forecast temperature is ISA +12°C, and the Minimum Obstacle Clearance required is 1500 ft. A nearby aerodrome (elevation 875 ft) reports a QNH of 1025 hPa.\nWhat is the minimum flight level that could be planned for the cruise?",
    "feedback": "FL60"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1 Figure 4.5.3.2)\nFind the fuel required to fly from B to C given the following:\n\nDistance:                          957 NM\nCruise                             FL310/M 0,74\nTemperature :                      ISA -12°C\nTailwind component :               40 kt\nMass:                              50 100 kg",
    "feedback": "4550 kg"
  },
  {
    "question": "Refer to the following NOTAM and choose the corresponding answer/statement:\nQ) LFFF/QNDAS/IV/BO/AE/000/999/4843N00221E250A) LFPO B) 0303312359 C) 0304010600E) DME U/S",
    "feedback": "At Paris/Orly from the 31st day of March 2003 at 2359 UTC until the 1st day of April 2003 at 0600 UTC, the distance measuring equipment will be unserviceable"
  },
  {
    "question": "Given:\nFuel for missed approach at destination: 300 kgFuel for climb to cruising level: 850 kgCruise distance to alternate: 170 NAMFuel consumption (cruise): 6 kg/NAMFuel for descent to alternate: 120 kgFuel for approach and landing at alternate: 210 kgFuel flow for holding at alternate: 2200 kg/hrFuel for missed approach at alternate: 170 kg\nCalculate the required alternate fuel.",
    "feedback": "2500 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM Amsterdam, charts 10-2, 10-2A, 10-2B, 10-2C\nWhich STAR should be used when arriving at Amsterdam from Paris?",
    "feedback": "HELEN 1A"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1, 4 Holding Fuel Planning, 4.1)\nGiven:\nWeather conditions: ISALanding mass at destination: 55500 kgAlternate fuel: 2500 kgDestination elevation: 1500 ftAlternate elevation: 3500 ftAirplane type: jet (2 engines)Holding pattern: straight & level\nCalculate the required final reserve fuel for a commercial flight:",
    "feedback": "1150 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM ATC section, pages GSP 470 to 472\nWhat is the meaning of the text below, extracted from item 18 OTHER INFORMATION of an ICAO ATS Flight Plan (FPL)?\nEET/EISN0210",
    "feedback": "Crossing EISN FIR boundary after 2 hours and 10 minutes"
  },
  {
    "question": "On an IFR navigation chart, in a 1° quadrant of longitude and latitude, appears the following information \"80\". This means that within this quadrant:",
    "feedback": "the minimum safe altitude is 8000 ft"
  },
  {
    "question": "A twin-jet aeroplane carries out the WASHINGTON-PARIS flight. When it reaches point K (35°N - 048°W) a non-mechanical event makes the Captain consider rerouting to one of the three following fields. The flight conditions are:\n -  from K to BERMUDAS (distance 847NM, headwind component=18 kt)\n - from K to SANTA MARIA (distance 1112 NM, tailwind component=120 kt)\n- from K to GANDER (distance 883 NM, wind component=0).\n\nWith an aeroplane true airspeed of 460 kt, the field selected will be that more rapidly reached:",
    "feedback": "BERMUDAS or GANDER, or SANTA MARIA"
  },
  {
    "question": "Refer to Jeppesen GSPRM - London Heathrow EGLL, chart 11-1  The frequeny, identification and localizer final approach QDM for runway 09L are:",
    "feedback": "110.3 MHz, IAA, 090°"
  },
  {
    "question": "A typical fuel plan with operational impact factors is shown, as produced by a flight planning tool. Since the aeroplane has arrived late, it is planned to fly the next flight at a higher speed. Use the data below to calculate the revised flight time.\nRevised speed: M 0.80Revised weight: 1500 kg upCruising altitude: Planned flight level",
    "feedback": "4 hours 59 minutes"
  },
  {
    "question": "On a ATC flight plan, to indicate that you will overfly the waypoint TANGO at 350 kts at flight level 280, you will write:",
    "feedback": "TANGO/N0350F280"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, chart 10-3A\nWhich of the following statements contains all corresponding altitude and flight level instructions when departing via CATON 2C?",
    "feedback": "At D9.5 ALT at or above 3100 ft, overhead VILNA at or above FL80, overhead NARGO at or above FL110, at CATON at or below FL230"
  },
  {
    "question": "Refer to Jeppesen GSPRM - VFR Chart ED-4\nFor an authorized landing on grass land 5 NM east of RODING VOR (RDG, N49°02', E012°32'), the frequency 120.65 MHz is used to request the latest QNH from a nearby airfield. Which is the corresponding call sign?",
    "feedback": "München Information"
  },
  {
    "question": "The temperature correction in an instrument approach must be applied when it is ......",
    "feedback": "colder than ISA, and the correction is added to the DH"
  },
  {
    "question": "(For this question use Fuel Planning MRJT1, Figures 4.8.1, 4.8.2) An aircraft is tasked to fly a Long Range Cruise (LRC) at FL310, ISA +15 C with a landing weight without tankered fuel of 40000 kg. The sector distance is 1000 NGM, wind component +25 kts. Calculate the break even fuel price at destination if the fuel price at departure is 85 cents/US Gallon:",
    "feedback": "92 cents"
  },
  {
    "question": "An aerodrome with weather reports indicating that the weather conditions are at or above operation minima from one hour prior to one hour after the anticipated arrival is defined as:",
    "feedback": "suitable"
  },
  {
    "question": "A pilot performs an instrument approach providing lateral navigation with a multi-engine aircraft. This approach is called:",
    "feedback": "2D (two-dimensional) instrument approach"
  },
  {
    "question": "A pilot flying a VFR route is forced by weather to descend at Chiemsee Island from the planned cruising altitude of FL085 to FL045. The OAT at FL045 is +9°C, the cruising CAS at that level is 130 kt, and the wind is as forecast. If the pilot flies the correct heading to account for the wind, to the nearest minute, what is the new ETA at Seeshaupt?",
    "feedback": "08:59"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1)\nGiven: Estimated take-off mass 57000 kg, Ground distance 150 NM, Temperature ISA -10°C, Cruise at .74 Mach\nFind: Cruise altitude and expected true air speed",
    "feedback": "25000 ft, 435 kt"
  },
  {
    "question": "Planned and actual data as shown in the Flight Log excerpt (Fuel Planning Section).\n\nAfter a balked landing at the destination airport, you have to divert to the alternate airport with the gear extended. The re-calculated flight time to the alternate due to the reduced speed is 2h 20 min and the fuel flow will be 780 kg/h. \nFinal Reserve Fuel remains unchanged.\nWhat will be the estimated landing mass at the alternate airport?",
    "feedback": "5440 kg"
  },
  {
    "question": "Which statement is correct when flying in still air, or when there is no wind component along the aircraft's heading vector?",
    "feedback": "The correct answers are: The nautical air miles (NAM) flown are equal to the nautical ground miles (NGM) flown, Nautical ground miles (NGM) is the still air distance flown by an aircraft"
  },
  {
    "question": "Trip fuel for a commercial air transport flight includes fuel for ....",
    "feedback": "take-off, climb, cruise including any step climb, descent, approach, and landing"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1) Given : Distance B - C : 1200 NM Cruise Mach 0.78 at FL300 Temperature Deviation from ISA : -14°C Tailwind component : 40 kt Gross mass at B : 50 200 kg The fuel required from B - C is :",
    "feedback": "6150 kg"
  },
  {
    "question": "Planned and actual data as shown in the Flight Log excerpt.\n\nActual Ground Speed (GS) on the leg BETA to GAMMA will be 100 KT. If all other flight parameters remain unchanged, what fuel remaining should be expected at waypoint GAMMA?",
    "feedback": "2600 kg"
  },
  {
    "question": "For flight planning purposes the landing mass at alternate is taken as:",
    "feedback": "Zero Fuel Mass plus Final Reserve Fuel and Contingency Fuel."
  },
  {
    "question": "Refer to Jeppesen GSPRM - Amsterdam, charts 10-3C, 10-3D\nWhich SID is to be used for runway 09?",
    "feedback": "ANDIK 1N"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1, fig. 4.4)\nGiven:\nTwin jet aeroplaneEstimated mass on arrival at the alternate: 50000 kg Elevation at destination aerodrome: 3500 ft Elevation at alternate aerodrome: 30 ft\nFind the Final reserve fuel:",
    "feedback": "1180 kg"
  },
  {
    "question": "Planning a flight from Paris (Charles de Gaulle) to London (Heathrow) for a twin - jet aeroplane. Preplanning: Maximum Take-off Mass: 62 800 kg Maximum Zero Fuel Mass: 51 250 kg Maximum Landing Mass: 54 900 kg Maximum Taxi Mass: 63 050 kg Assume the following preplanning results: Trip fuel: 1 800 kg Alternate fuel: 1 400 kg Holding fuel (final reserve): 1 225 kgContingency (5 % of trip fuel): 90 kg Dry Operating Mass: 34 000 kg Traffic Load: 13 000 kg Catering: 750 kg Baggage: 3 500 kg Find the Take-off Mass (TOM):",
    "feedback": "51 515 kg."
  },
  {
    "question": "Which approach segment starts at the FAF and ends at the MAP?",
    "feedback": "Final approach"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Aerodrome Directory, BILBAO aerodrome (LEBB):\nCheck the correctness of the following statements:\n1) Jet A-1 fuel is available 0645-2330 LT only2) The accelerate-stop-distance available for runway 12 is 8333 feet",
    "feedback": "1) is not correct, 2) is correct"
  },
  {
    "question": "Planned and actual data as shown in the Flight Log excerpt.\n\nActual Ground Speed (GS) on the leg BETA to GAMMA will be 110 KT. If all other flight parameters remain unchanged, what fuel remaining should be expected at waypoint GAMMA?",
    "feedback": "2000 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Amsterdam, chart 10-2\nYou are approaching Amsterdam via REKKEN 2A. Which of the following frequencies is appropriate to receive an ATIS shortly before passing ARTIP?",
    "feedback": "108.4 MHz"
  },
  {
    "question": "The initial great circle course from position A (80°00'N 170°00'E) to position B (75°00'N 011°E) is 177° (G). The final grid course at position B will be :",
    "feedback": "177° (G)"
  },
  {
    "question": "During a flight at night a position has to be reported to ATC. The aeroplane is at a distance of 750 NM from the groundstation and at flight level 350. The frequency to be used is:",
    "feedback": "5649 kHz."
  },
  {
    "question": "(For this question use CAP 697, Simplified Flight Planning, fig. 4.3.6) Planning a flight from Paris Charles de Gaulle to London Heathrow for a twin jet aeroplane with alternate Manchester. Given the following information, find the alternate fuel and the corresponding time:   Tailwind component from Ldonon to Manchester 50 kt Distance from London to Manchester 160 NM  Assume the Estimated Landing Mass at alternate is about 50000 kg",
    "feedback": "1350 kg, 30 minutes"
  },
  {
    "question": "REF AIP ENR 2.1.2.25-1 'MALPENSA CTR' ITEM 3 'ATS COMMUNICATION FACILITIES' REFERRING TO APPROACH CONTROL SERVICE. CALLSIGN 'MILANO RADAR' IN COLUMN 3 'FREQUENCY MHZ' CHG: 118.800 TO READ CH 118.805. 132.700 TO READ CH 132.705 OTHER DATA UNCHANGED: NOTAM LI/A1880/16 >>> END OF BULLETIN <<<\nWhich of the following frequency changes applies to Milano radar?",
    "feedback": "Frequency 118.800 changed to channel 118.805"
  },
  {
    "question": "For pre-flight planning purposes what is the required take-off fuel for an IFR commercial air transport flight with a turbine engine jet aircraft? \n(assume the Basic Fuel Scheme without variations applies)",
    "feedback": "9477 kg"
  },
  {
    "question": "The following information is taken from the operational flight plan of a Medium Range Jet Transport (MRJT) aeroplane. Calculate the minimum required fuel for take-off if the operator has nominated a suitable en-route alternate.\nFlight time: 03:15Flight time from destination to alternate: 00:25Cruise fuel flow: 2490 kg/hHolding fuel flow: 1950 kg/h",
    "feedback": "10348 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)6\nYou are flying on airway L42 from ALGHERO 113.8 ALG (N40°38.29' E008°17.51') to AJACCIO 114.8 AJO (N41°46.24' E008 46.48'). What is the true course and distance for this leg?",
    "feedback": "020°, 73 NM"
  },
  {
    "question": "For pre-flight purposes, what is the total fuel required for the commercial air transport flight in a Medium Range Jet Transport MRJT aeroplane, with no destination alternate, given the following information?\n(assume the Basic Fuel Scheme without variations applies)\nEstimated taxi time: 15 minutes at both departure and destination aerodromesAPU fuel flow: 115 kg/hTaxi fuel flow: 11 kg/minPlanned APU usage at the parking position: 15 minutesTotal trip distance: 315 NMAverage fuel flow: 2878 kg/hTAS: 440 ktAverage headwind component: 16 ktContingency fuel: 5 minutes holding fuelHolding fuel flow: 2200 kg/h Extra fuel: 0 kgDiscretionary fuel: 0 kg",
    "feedback": "4167 kg"
  },
  {
    "question": "In an ATS flight plan Item 15 (route), in terms of latitude and longitude, a significant point at 41°35' north 4°15' east should be entered as :",
    "feedback": "4135N00415E"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, charts 10-3A, 10-3B, 10-3C, 10-3D\nWhich of the following SIDs is assigned for a departure on runway 10?",
    "feedback": "MITOS 2A"
  },
  {
    "question": "For pre-flight planning purposes, what is the total fuel required for a VFR commercial air transport flight with a multi-engined piston aircraft with maximum take-off mass of 5700 kg or less?\n(assume the Basic Fuel Scheme without variations applies)\nStart-up and taxi fuel: 2 USGClimb fuel: 6 USGCruise fuel: 21 USGDestination alternate fuel: 3 USGFuel flow for final reserve fuel: 16 USG/h Extra fuel: 0 USGDiscretionary fuel: 0 USG",
    "feedback": "46 USG"
  },
  {
    "question": "The quantity of fuel which is calculated to be necessary for a jet aeroplane to fly IFR from departure aerodrome to the destination aerodrome is 5352 kg. Fuel consumption in holding mode is 6 000 kg/h. Alternate fuel is 4380 kg. Contingency should be 5% of trip fuel.\nWhat is the minimum required quantity of fuel which should be on board at take-off?",
    "feedback": "13000 kg."
  },
  {
    "question": "Aberdeen Information Page: The East Apron and Eastern TWY have restricted access. The maximum permitted wingspan:",
    "feedback": "is 20 m"
  },
  {
    "question": "Refer to the following NOTAM and choose the corresponding answer/statement:\nSVC TEMPO TWR LCL TFC/CLRNC DELIVERY 121.0 FRI-SAT 1311131400 - 1311141500EST",
    "feedback": "A temporary tower service will be available for controlling local traffic and clearance delivery on frequency 121.0, from Friday 13th at 1400 to Saturday 14th at 1500"
  },
  {
    "question": "RPLs (Repetitive Flight Plans) are used for flights with which of the following properties?",
    "feedback": "IFR flights operated regularly on the same day of consecutive weeks, on at least 10 occasions"
  },
  {
    "question": "An aircraft is flying under VFR on a track of 168°M. The highest obstacle within 5 NM of the intended track of the aircraft is 4200 ft elevation.\nGiven the following information, provided by an aerodrome at 1400 ft elevation, what is the minimum flight level to give 1000 ft obstacle clearance?\nQNH: 1026 hPaTemperature: 12°C below ISA(assume 1 hPa = 30 ft)",
    "feedback": "FL55"
  },
  {
    "question": "On a VFR flight plan, the total estimated time is:",
    "feedback": "the estimated time from take-off to overhead the destination airport"
  },
  {
    "question": "The wind direction and velocity (°/kt) at 60°N 015°W is",
    "feedback": "290/155"
  },
  {
    "question": "Refer to Jeppesen GSPRM Alicante, chart 13-4:\nYou are approaching ALTET (ALT) VOR on radial 243°. What is the minimum altitude?",
    "feedback": "5900 ft"
  },
  {
    "question": "For a flight leg, the following data is assumed:\nTrue course = 130°W/V = 180/30TAS = 200 kt\nDetermine the WCA and GS of this leg.",
    "feedback": "WCA = + 7°, GS = 180 kt."
  },
  {
    "question": "What is the actual daytime for the temporary established restricted area (Zone Réglementée Temporaire, ZRT)?",
    "feedback": "SR-30 - SS+30"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1 Figure 4.5.3.2)  Find the SPECIFIC RANGE for the twin jet aeroplane flying below the optimum altitude (range loss = 6%) and using the following data.  Given: MACH .74 CRUISE, Flight level = 310, Gross mass = 50000 kg, ISA conditions",
    "feedback": "176 NAM/1000 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, charts 19-1, 19-2, 19-3\nWhat is the maximum altitude following the Tabarca route?",
    "feedback": "1500 ft AMSL"
  },
  {
    "question": "During a VFR flight at a navigational checkpoint the remaining usable fuel in the tanks is 60 US gallons. The reserve fuel is 12 US gallons. According to the flight plan the remaining flight time is 1h35min. Calculate the highest acceptable rate of consumption.",
    "feedback": "30.3 US gallons/hour"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Nantes/Atlantique, chart 10-3C\nYou are cleared for the LUSON 3N departure. Your cruising level is FL180. QNH is 993 hPa. You climb at an average TAS of 120 KT and an average ROC 1050 fpm. You experience a mean tailwind of 28 KT during the climb. ATC limits your climb to max 5000 ft until you are 2 NM past SUBAK.\nWhere will you reach your cruising level?",
    "feedback": "8.7 NM before LUSON"
  },
  {
    "question": "The required time for final reserve fuel for turbojet aeroplane is:",
    "feedback": "30 min."
  },
  {
    "question": "Given:\nTrue Air Speed (TAS): 350 ktHead Wind (HWC): 50 ktFuel consumption en route: 1800 kg/hFuel consumption holding: 900 kg/hSuitable alternate at location: X\nCalculate the minimum possible contingency fuel for a commercial flight with a twin engined jet aeroplane from departure to destination:(Note: In-flight re-planning as appropriate)",
    "feedback": "360 kg"
  },
  {
    "question": "What should be considered when using the following NOTAM information from the transmitter during the validity period?\nQ) EDGG/QNNCS/IV/BO/AE/000/999/5049N00648E025 A) ETNN B) FROM: 15/11/11 09:00 C) TO: 16/02/10 21:50 EST E) AD ETNN: MOBILE TACAN NOE CH79Y IN USE. PSN 504947N0063847E 259DEG 859M FROM ARP.",
    "feedback": "The slant range indications are only valid for the position indicated"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Amsterdam, chart 10-2\nWhat is the lost communications procedure when arriving via ARTIP, without an inbound clearance?",
    "feedback": "Proceed as per Flt Plan to ARTIPMaintain last cleared and acknowledged FLTake up the HoldCommence descent to FL 70 at or as near as possible to ETO over the holding fixAfter reaching FL 70 leave the hold and carry out approach procedure to the received and acknowledged RWY or the main RWY according to ATIS"
  },
  {
    "question": "Given:\nMissed approach at destination: 270 kgClimb to cruising level: 700 kgCruise distance to alternate: 165 NAMFuel consumption (cruise): 5.5 kg/NAMDescent to the alternate: 110 kgApproach and landing at alternate: 230 kgFuel flow for holding at alternate: 2100 kg/hrMissed approach at alternate: 200 kg\nCalculate the required alternate fuel.",
    "feedback": "2218 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Amsterdam, chart 10-2A\nYou are cleared to hold at RIVER via PESER 2A arrival. When passing PESER, a fuel check reveals 5000 kg of fuel on board. You decide to divert at 3600 kg of fuel remaining. How long can you hold before you need to divert? Average TAS 260 KT, fuel flow 2400 kg/h, wind 310° 20 KT.",
    "feedback": "29 minutes"
  },
  {
    "question": "Given the following information for a commercial air transport flight, what is the time (in minutes) needed from the destination to the alternate aerodrome? Assume an operation with a Performance Class A aeroplane applying the Basic Fuel Scheme or with a helicopter (basic fuel planning provisions are the same).\nMissed approach at the destination: 5 minClimb to cruise level: 5 minCruise distance: 65 NMCruise TAS: 145 ktWind component: +18 ktAnticipated hold at the alternate: 20 minDescent to the alternate: 4 minApproach to the alternate: 5 min",
    "feedback": "63 min"
  },
  {
    "question": "In the ATS flight plan, for a non-scheduled flight which of the following letters should be entered in Item 8 (Type of Flight) :",
    "feedback": "N"
  },
  {
    "question": "Mark the altitude which is defined as the lowest altitude between radio navigation fixes that assures acceptable navigation signal coverage and meets obstacle clearance requirements between those fixes.",
    "feedback": "Minimum En-route Altitude (MEA)"
  },
  {
    "question": "Which transponder code is correct if you are 40 minutes before entering NAT airspace?",
    "feedback": "as requested by ATC"
  },
  {
    "question": "What is the Polar Track System?",
    "feedback": "Fixed tracks between Europe over the North Pole to Alaska"
  },
  {
    "question": "Refer to Jeppesen GSPRM - London Heathrow EGLL, chart 11-1A  The height indicated by the radio altimeter at DA for a CAT II equipped aircraft is:",
    "feedback": "100 ft"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, chart 10-3\nDeparting on SID ASTRO 4A, you are cleared to FL80, with a restriction to maintain 4000 ft until passing ALT VOR. QNH 1040 hPa, average rate of climb ROC 800 ft/min, ground speed 133 KT. Where is the top of climb (TOC) approximately reached?",
    "feedback": "7 NM before VILNA"
  },
  {
    "question": "Refer to Route Manual chart E(HI)1\nAn aircraft has to fly from from Glasgow (55°52'N 004°27'W) to Benbecula (57°29'N 007°22'W), cruising at 320 kts TAS. Assuming a headwind of 40 kts and cruise fuel consumption of 2300 kg/hr, what is the fuel consumption for this sector?",
    "feedback": "1117 kg"
  },
  {
    "question": "(For this question use Flight Planning Manual SEP1 Figure 2.5)\nGiven:\nCruising: FL75Mixture: leanFull throttle: 2300 RPMTake-off fuel: 444 lbsTake-off from: MSL\nFind endurance in hours:",
    "feedback": "5 hrs 12 mins"
  },
  {
    "question": "The following fuel consumption figures are given for a jet aeroplane:\n-standard taxi fuel: 600 kg.\n-average cruise consumption: 10 000 kg/h.\n-holding fuel consumption at 1500 ft above alternate airfield elevation: 8000 kg/h.\n-flight time from departure to destination:  6 hours \n-fuel for diversion to alternate: 10 200 kg.\nThe minimum ramp fuel load is:",
    "feedback": "77 800 kg"
  },
  {
    "question": "On a given path, it is possible to chose between four flight levels (FL), each associated with a mandatory flight Mach Number (M). The flight conditions, static air temperature (SAT) and headwind component (HWC) are given below:  FL 370 - M = 0.80 Ts = -60°C HWC = 15 kt FL 330 - M = 0.78 Ts = -60°C HWC =   5 kt FL 290 - M = 0.80 Ts = -55°C HWC = 15 kt FL 270 - M = 0.76 Ts = -43°C HWC =   0 kt  The flight level allowing the highest ground speed is:",
    "feedback": "FL270"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1, Figure 4.5.1)\nFind time, fuel, still air distance and TAS for an enroute climb 280/0.74 to FL350. Given:\nBrake release mass: 64000 kgOAT: ISA -10°CAirport elevation: 3000 ft",
    "feedback": "24 min, 1775 kg, 139 NAM, 383 kt"
  },
  {
    "question": "The commander decides to increase the block fuel by 1200 kg due to an expected holding at the destination aerodrome as this equates to approximately 30 minutes of holding. After take-off, the FMS indicates only 27 minutes of extra holding fuel, despite the payload being as originally planned. What is the reason for this?",
    "feedback": "The extra fuel has made the aeroplane heavier, thus the trip fuel is increased"
  },
  {
    "question": "The pilot of a helicopter during the cruise phase is instructed by ATC to adjust the routing, in order to avoid an airspace ahead, because of military activities, increasing the distance to be flown. The required fuel amount due to the increased flown distance is included in the .....",
    "feedback": "Contingency fuel"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1)\nHOLDING PLANNING\nThe fuel required for 45 minutes holding, in a racetrack pattern,\nat PA 5000 ft, mean gross mass 47 000 kg, is :",
    "feedback": "1635 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)2\nThe section of a routing is via airway Y96 from NORBO to TALLA (TLA, N55°30' W003°21'). Find the true course to TLA:",
    "feedback": "096°"
  },
  {
    "question": "Refer to Jeppesen GSPRM Aberdeen, chart 10-1R:\nYou are approaching Aberdeen airport from the southwest. What minimum radar altitudes are you passing?",
    "feedback": "3200 ft to 2800 ft t0 2300 ft"
  },
  {
    "question": "For a long distance flight at FL 390, \"Long Range\" regime, divided into four flight legs with the following characteristics: - segment AB - Ground distance: 2 000 NM. head wind component: 50 kt  - segment BC - Ground distance: 1 000 NM. head wind component: 30 kt  - segment CD - Ground distance: 500 NM. tail wind component: 100 kt  - segment DE - Ground distance: 1 000 NM. head wind component: 70 kt  The air distance of the entire flight is approximately:",
    "feedback": "4 900 NM"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, chart 19-1\nWhat is the compulsory reporting point when approaching Alicante via the South Route?",
    "feedback": "SW"
  },
  {
    "question": "Refer to Jeppesen GSPRM Aberdeen, chart 10-1R:\nYou are approaching Aberdeen (ADN) VORDME on radial 090°. Which sequence of minimum altitudes do you have to observe?",
    "feedback": "2000 ft and 1700 ft"
  },
  {
    "question": "Which of the following statements is (are) correct with regard to the operation of flight planning computers ?\n1. The computer can file the ATC flight plan.\n2. In the event of inflight re-routing the computer produces a new plan.",
    "feedback": "Statement 1 only"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Dubrovnik, charts 19-1, 19-2\nHow many VFR arrivals are published into Dubrovnik?",
    "feedback": "5"
  },
  {
    "question": "Which best describes the significant cloud forecast for the area east of Tunis (36°N 010°E)?",
    "feedback": "5 to 7 oktas CU and AC, base below FL 100, tops FL 180"
  },
  {
    "question": "(For this question use Flight Planning Manual MRJT 1 Figure 4.3.6)\nGiven: estimated dry operating mass 35 500 kg; estimated load 14 500 kg; final reserve fuel 1200 kg; distance to alternate 95 NM; average true track 219°; head wind component 10 kt\nFind :  fuel and time to alternate.",
    "feedback": "1 100 kg;   25 min"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart AT(HI)5\nFind the average true course and distance from Keflavik (BIKF, N63°59.1' W022°36.3') to Amsterdam (EHAM, N52°18.5' E004°45.8'):",
    "feedback": "133°, 1095 NM"
  },
  {
    "question": "(for this question use MRJT1, Figure 4.7.2)\nAn aircraft on an extended range operation (ETOPS) is required never to be more than 120 minutes from an alternate, based on 1 engine inoperative LRC conditions in ISA. Using the table and a given mass of 40000 kg at the most critical point, the maximum air distance to the relevant alternate is:",
    "feedback": "735 NM"
  },
  {
    "question": "It is possible, in flight, to:\n\n1 - file an IFR flight plan\n2 - modify an active IFR or VFR flight plan\n3 - cancel an active VFR flight plan\n4 - close an active VFR flight plan\n\nWhich of the following combinations contains all of the correct statements?",
    "feedback": "1 - 2 - 3 - 4"
  },
  {
    "question": "Refer to Jeppesen GSPRM - VFR Chart ED-4\nDeparture: Ried Kirchheim (LOLK, N48°12.8' E013°20.8')Destination: Freistadt (LOLF, N48°30.9' E014°24.5')\nWhich of the following radio navigation aids is to be used for a direct flight from LOLK to LOLF?",
    "feedback": "Freistadt VOR 113.50 MHz"
  },
  {
    "question": "Given: Maximum allowable take-off mass 64400 kg, Maximum landing mass 56200 kg, Maximum zero fuel mass 53000 kg, Dry operating mass 35500 kg, Traffic load 14500 kg, Trip fuel 4900 kg, Minimum Take-off Fuel 7400 kg\nFind: Maximum allowable take-off fuel",
    "feedback": "11100 kg"
  },
  {
    "question": "During the dispatch planning of a commercial air transport flight towards a busy aerodrome, the Commander observes that single runway operations will be underway upon arrival. To prepare for possible delays, the decision is made to include an extra 15 minutes of endurance fuel. This additional fuel should be incorporated as part of the:",
    "feedback": "Extra fuel"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1, Table 4.1, Figure 4.1)  What is the fuel penalty? Given: M 0.78 Cruise mass=56000 kg FL 310",
    "feedback": "-2 %"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Amsterdam, chart 10-2\nWhat is the clearance limit of the given STAR chart?",
    "feedback": "ARTIP"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1 Fig. 4.1) Find the OPTIMUM ALTITUDE for the twin jet aeroplane.  Given: Cruise mass=50000 kg, .78 MACH",
    "feedback": "35500 ft"
  },
  {
    "question": "The W/V (°/kt) at 60°N 015°W is",
    "feedback": "300/60"
  },
  {
    "question": "(For this question use Flight Planning Manual MRJT 1 Figure 4.4)\nGiven: dry operating mass 35 500 kg; estimated load 12 000 kg, contingency approach and landing fuel 2 500 kg; elevation at departure aerodrome 500 ft; elevation at alternate aerodrome 30 ft.\nFind: final reserve fuel for a jet aeroplane (holding) and give the elevation which is relevant.",
    "feedback": "1 180 kg; alternate elevation"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1) The following apply: Temperature ISA +15°C Brake release mass 62000kg Trip time 5hr 20 min What is the trip fuel ?",
    "feedback": "13500kg"
  },
  {
    "question": "Given:\nmaximum take-off mass 64 400 kg maximum landing mass 56 200 kg maximum zero fuel mass 53 000 kg dry operating mass 35 500 kg estimated load 14 500 kg estimated trip fuel 4 900kg minimum take-off fuel 7 400 kg Find the maximum allowable take-off fuel:",
    "feedback": "11 100 kg"
  },
  {
    "question": "Which describes the worst hazard, if any, that could be associated with the type of feature at 38°N 015°E  ?",
    "feedback": "Engine flame out and windscreen damage"
  },
  {
    "question": "With regard to the given OFP, which statement is correct concerning the flight from the destination to the alternate aerodrome when the wind direction remains constant and the wind speed increases by 10 kt?",
    "feedback": "The flight time will increase by 4 minutes"
  },
  {
    "question": "The approximate mean wind component (kt) along true course 270° at 50°N from 000° to 010°W is",
    "feedback": "40 kt headwind component"
  },
  {
    "question": "The MOC value to be applied in the primary area for the en-route phase of an IFR flight in mountainous areas, where the variation in terrain elevation is 2000 ft, is:",
    "feedback": "300 m"
  },
  {
    "question": "What information can be derived from the following NOTAM extract?\n2) NOTAM LIRAE) REF AIP AD 2 LIRA 6-1/5BOX FREQUENCIES:- APP CALL SIGN \"ROMA DIRECTOR\" CHANGE FREQ 119.200 MHZ to READ: 131.250 MHZ- ROMA ACC CHANGE FREQ 124.800 MHZ TO READ_ 134.200 MHZ",
    "feedback": "LIRA airport has permanently changed frequency to 131.250 MHz"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Dubrovnik, charts 19-1, 19-2\nWhen approaching from the southwest, what is the last compulsory reporting point?",
    "feedback": "B2"
  },
  {
    "question": "What is the Extended Range Entry point (or ETOPS entry point)?",
    "feedback": "The point of the route which is 60 minutes flying time (with approved single engine cruise speed) from an alternate airport"
  },
  {
    "question": "Given the following information for a commercial air transport operation, calculate the maximum possible extra fuel to be uplifted, if the commander wants to climb directly to the optimum altitude of 37000 ft.\nMaximum take-off mass (MTOM) to climb to FL370: 68000 kgMaximum zero fuel mass (MZFM): 62731 kgActual zero fuel mass (AZFM): 59031 kgRegulated take-off mass (RTOM): 76000 kgMaximum landing mass (MLM): 66360 kgTank capacity: 16000 kgTaxi fuel: 240 kgTrip fuel: 4761 kgMinimum block fuel: 8000 kg",
    "feedback": "1209 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, charts 19-1, 19-2, 19-3\nWhen approaching Alicante, what is the procedure if you experience a communication failure?",
    "feedback": "Proceed in the direction of SW reporting point, assume a track east of South Route to S reporting point and maintain a maximum of 800 ft AMSL"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Amsterdam, charts 10-3C, 10-3D\nWhich SID is to be used for runway 04?",
    "feedback": "ANDIK 2F"
  },
  {
    "question": "Refer to GSPRM Stuttgart, charts 10-3P and 10-3C\nThe pilot is advised by ATC to expect either DKB 9B RNAV SID (OVERLAY) or DKB 9B SID. Which of the following applies to DKB 9B RNAV SID (OVERLAY)?",
    "feedback": "On-board GPS is utilized to fly the DKB 9B SID"
  },
  {
    "question": "(For this Question use Flight Planning Manual SEP 1, Fig. 2.4)  Using the Range Profile Diagram, for the single engine aeroplane, determine the range, with 45 minutes reserve, in the following conditions, given:  OAT ISA -15° C Pressure altitude 12000 ft Full throttle 23.0 in/Hg, 2300 RPM",
    "feedback": "902 NM"
  },
  {
    "question": "Refer to Jeppesen GSPRM, chart E(HI)2\nYou have been requested to perform a flight overflying the Rennes VOR (REN) (N48°04' W001°45') and the ORIST waypoint (N50°00' W001°51'). Which airway is to be filed in your flight plan?",
    "feedback": "UY110"
  },
  {
    "question": "For pre-flight planning purposes, what is the minimum fuel required for a commercial air transport flight with a jet aircraft, given the following information?\n(assume the Basic Fuel Scheme without variations applies)\nTrip fuel: 3740 kgFuel to alternate: 936 kgTaxi fuel: 140 kgFuel flow at 1500 feet above destination alternate aerodrome: 2132 kg/hExtra fuel: 0 kgDiscretionary fuel: 0 kg",
    "feedback": "6069 kg"
  },
  {
    "question": "An aircraft is flying at MACH 0.84 at FL 330. The static air temperature is -48°C and the headwind component 52 Kt. At 1338 UTC the controller requests the pilot to cross the meridian of 030W at 1500 UTC. Given the distance to go is 570 NM, the reduced MACH No. should be:",
    "feedback": "0.80"
  },
  {
    "question": "Given the following data for the pre-flight calculations, determine the contingency fuel for a commerial air transport flight from Paris to Barcelona.\n(assume the Basic Fuel Scheme without variations applies)\nTrip fuel: 4560 kgFuel flow at 1500 feet above destination aerodrome: 2304 kg/hFuel penalty when flying 2000 feet lower than optimum altitude: 232 kgExtra fuel: 0 kgDiscretionary fuel: 0 kg",
    "feedback": "228 kg"
  },
  {
    "question": "Given the following information, what is the actual groundspeed for the leg?\nLeg distance: 123 NMEstimated leg time: 39 min.Actual leg time: 41 min.",
    "feedback": "180 kt"
  },
  {
    "question": "Planned and actual data as shown in the Flight Log excerpt.\n\nProvided that flight conditions on the leg GAMMA to DELTA remain unchanged and fuel consumption remains unchanged, what fuel remaining should be expected at waypoint DELTA?",
    "feedback": "4550 kg"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1) Find: Air distance in Nautical Air Miles (NAM) for this leg and fuel consumption Given: Flight time from top of climb at FL 280 to the enroute point is 48 minutes. Cruise procedure is long range cruise. Temperature is ISA -5°C. The take-off mass is 56000 kg and climb fuel 1100 kg.",
    "feedback": "345 NAM; 1994 kg"
  },
  {
    "question": "What is the NAT Track Message?",
    "feedback": "The publication of the Organized Track Message (OTS)"
  },
  {
    "question": "Refer to Jeppesen GSPRM - London Heathrow, chart 10-2D\nThe minimum holding altitude (MHA) and maximum holding speed at WESTCOTT 335 WCO are:",
    "feedback": "FL160 and 250 KT"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1, Table 4.1, Figure 4.1)  What is the fuel penalty? Given: M 0.78 Cruise mass=56000 kg FL 310",
    "feedback": "2 %"
  },
  {
    "question": "According to ICAO, what is the lowest altitude that may be used which provides a minimum clearance of 300 m (1000 ft) above all objects located in the area contained within a sector of a circle of 46 km (25 NM) radius centred on a radio aid to navigation?",
    "feedback": "MSA"
  },
  {
    "question": "Act Hdg 250°\nTAS 140 Kts\nWind 180/60Kt\nGS?",
    "feedback": "132 Kts"
  },
  {
    "question": "What does the abbreviation \"APV\" mean?",
    "feedback": "Approach Procedure with Vertical Guidance. It is an instrument procedure which utilises lateral and vertical guidance but does not meet the requirements established for precision approach and landing operations"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)10\nThe initial magnetic course/distance from KALMAR 111.6 KAL (N56°41.12' E016°17.05') to STURUP 113.0 SUP (N55°32.08' E012°22.78') on airway L990 is:",
    "feedback": "231°, 120 NM"
  },
  {
    "question": "for this question use GSPRM VFR chart ED-4\nAn aircraft is at 9 000 ft at position 47°30'N, 014°00'E and flies VFR towards LOXA Aigen Im Ennstal airport to land. What action must be made by the pilot when approaching LOXA airport?",
    "feedback": "Contact Tower on 118.000 before entering the control zone"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Amsterdam, chart 10-3H\nYou are cleared for the ARNEM 2N departure, magnetic variation is 1°E. Above FL60, you climb with an average TAS of 210 KT and an average ROC of 2400 fpm. The mean wind between FL60 and FL280 is 110/30. ATC limits your climb to FL60 until passing IVLUT\nWhere will you reach your cruising level of FL280 ?",
    "feedback": "At PAM D34.9"
  },
  {
    "question": "Refer to Jeppesen GSPRM - North Atlantic Plotting Chart B777\nGiven an initial true heading at Shannon (52°42' N 008°55'W) of 270° and a compass deviation of +3°, the corresponding compass heading would be:",
    "feedback": "272°"
  },
  {
    "question": "Refer to Jeppesen GSPRM - North Atlantic Plotting Chart B777\nThe distance (NM) from A (64°N006°E) to C (62°N020°W) is",
    "feedback": "710"
  },
  {
    "question": "How many feet you have to climb to reach FL 75? Given: FL 75; departure aerodrome elevation 1500 ft; QNH = 1023 hPa; temperature = ISA; 1 hPa = 30 ft",
    "feedback": "6300 ft."
  },
  {
    "question": "An airway is marked 3500T 2100 a. This indicates that:",
    "feedback": "the minimum obstruction clearance altitude (MOCA) is 3500 ft"
  },
  {
    "question": "Refer to Jeppesen GSPRM, Alicante charts 11-1, 11-2, 13-1, 13-2\nAlicante Arrival ASTRO 1L leads to reporting point VILNA, from where the approaches....",
    "feedback": "ILS Z and VOR Z start"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, chart 10-2G\nWhich of the following is correct for an approach to runway 28?",
    "feedback": "Continuous Descent Arrival via CALLES, KOVAM, and BESOR"
  },
  {
    "question": "Refer to Jeppesen GSPRM - North Atlantic Plotting Chart B777\nThe initial magnetic course from A (64°N006°E) to C (62°N020°W) is",
    "feedback": "271°"
  },
  {
    "question": "Refer to the extract of the OFP:\n\nWhat is the fuel flow at FL 360?",
    "feedback": "6.6 t/h"
  },
  {
    "question": "Refer to Jeppesen GSPRM, Chart ED(4)\nWhile planning a day VFR flight between Freistadt aerodrome LOLF (N48°30.9' E014°24.5') to Dingolfing aerodrome EDPD (N48°40' E012°30'), you need to select visually a conspicuous point for the sector West of E013°45' to record the progress of the flight. Which of the following is the best waypoint?",
    "feedback": "The motorway bridge at N48°36 E13°22'"
  },
  {
    "question": "Athinai (Hellenikon) Approach Chart: What is the variation shown on the chart?",
    "feedback": "3°E"
  },
  {
    "question": "(For this Question use Flight Planning & Monitoring SEP 1, Fig. 2.1) Given:\nTake-off mass: 3500 lbsDeparture aerodrome pressure altitude: 2500 ftOAT: +10°CFirst cruising level: FL140 OAT: -5°C\nFind the time, fuel and still air distance to climb:",
    "feedback": "22 min, 6.7 GAL, 45 NAM"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)2\nOn a flight on airway P600 you are passing TURNBERRY VOR (TRN, N55°19' W004°47') and intersections GIRVA, TUNSO and BLACA. What is the MOCA between GIRVA and TUNSO?",
    "feedback": "5000 ft"
  },
  {
    "question": "(for this question use Flight Planning Manual MRJT1, Figure 3.1)\nGiven the following information, what is the total taxi fuel required for a commercial air transport flight?\nPlanned APU usage at the parking position: 25 minutes prior to taxiPlanned taxi time: 20 minutes at both the departure and destination aerodrome",
    "feedback": "268 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM, chart Alicante 10-2C\nWhile briefing the GERVU 1M STAR, if the training captain asks about the Minimum Enroute Altitude (MEA), the correct response is ....",
    "feedback": "FL075"
  },
  {
    "question": "Planned and actual data as shown in the Flight Log excerpt.\n\nArriving overhead GAMMA you are cleared for direct routeing to MIKE. The flight time for direct flight GAMMA to MIKE will be 1h 10 min. Provided that flight conditions on the direct leg GAMMA to MIKE remain unchanged and fuel consumption remains unchanged, what fuel remaining should be expected at waypoint MIKE?",
    "feedback": "1300 kg"
  },
  {
    "question": "Refer to GSPRM Stuttgart, chart 11-2\nWhat is the MSA for an aircraft approaching from radial 260° when it is 14 NM away from the VOR station?",
    "feedback": "3300 ft"
  },
  {
    "question": "Which of the following is correct when using GNSS/FMC equipment in IFR navigation?",
    "feedback": "The information and calculations provided by the systems are dependent upon the accurate input of data from the crew and/or navigation database"
  },
  {
    "question": "What is the maximum extra fuel that may be uplifted?\nMZFM: 170000 kgMTOM: 223000 kgMLM: 182000 kgPlanned ZFM: 165767 kgTOF: 51616 kgTrip fuel: 45854 kg\nFuel penalty:Take-off: 282.7/1000 kgLanding: 394/1000 kg",
    "feedback": "5617 kg"
  },
  {
    "question": "Assuming the following data: . Ground distance to be covered: 2 000 NM . Cruise flight level: FL 330 . Cruising speed: Mach 0.82 (true airspeed: 470 kt) . Head wind component: 30 kt . Planned destination landing mass: 160 000 kg . Temperature: ISA . CG: 37% . Total anti-ice: ON . Pack flow: HI Time needed to carry out such a flight is:",
    "feedback": "4 h 43 min"
  },
  {
    "question": "Refer to Jeppesen GSPRM, chart ED-4\nAn aircraft on a VFR flight intends to fly overhead aerodrome Straubing (EDMS 48°54'N 012°31'E). Given the following information, what is the minimum indicated altitude required to clear the Straubing EDMS Class F airspace by 500 ft?\nAltimeter temperature error with an OAT -7°C at Straubing EDMS: 240 ftQNH at Straubing EDMS: 998 hPaAltimeter setting: 998 hPa\n(round altitudes and elevations to the nearest 10 ft)",
    "feedback": "4290 ft"
  },
  {
    "question": "(For this Question use Fuel Planning SEP1, Table 2.2.1)\nGiven:\nPower setting: Full Throttle @ 2500 RPMTrip distance (from TOC): 230 NMCruising altitude: 12000 ftTemperature (OAT): ISAClimb additional: 3.6 galApproach additional: 15 minutes (cruise fuel)Ground speed: 140 kts\nCalculate the trip fuel for a commercial VFR flight by using the above data:",
    "feedback": "25.1 gal"
  },
  {
    "question": "(for this question use MRJT1, Figure 4.7.1b)\nYou have a decompression at your cruising altitude. Given the following data, what is your diversion fuel?\nTailwind: 25 kts Distance to diversion airport: 820 NM ISA: +20°C Weight: 55’000 kg Icing conditions: No",
    "feedback": "7270 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM, Chart E(HI)5\nWhich navigation aid is located in position 38°30.5'N, 005°06.0'W ?",
    "feedback": "VOR/DME"
  },
  {
    "question": "What is the advantage of using a GNSS/FMS equipment in flight?",
    "feedback": "The in-flight position of the aircraft can be continuously displayed"
  },
  {
    "question": "What is the course and distance from Locator HP to the threshold of Runway 08?",
    "feedback": "080°(M) / 4.2 NM"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)2\nWhat are the applicable GRID MORAs for a flight from DEAN CROSS 115,2 DCS (N54°43.32'  W003°20.44') to TALLA 113,8 TLA (N55°29.95' W003°21.17') on airway N864?",
    "feedback": "46 and 41"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1, Figure 4.5.3.1)\nFind: Final fuel consumption for this leg\nGiven: Long range cruise, Temperature -63°C, FL 330, Initial gross mass enroute 54100 kg, Leg flight time 29 min",
    "feedback": "1093 kg"
  },
  {
    "question": "(for this question use MRJT1, Figure 4.7.3)\nGiven:\nDiversion fuel available 8500kg Diversion cruise altitude 10000ft Mass at point of diversion 62500kg Head wind component 50kt Temperature ISA -5°C\nThe (a) maximum diversion distance, and (b) elapsed time alternate, are approximately :",
    "feedback": "(a) 860 NM  (b) 3h 20 min"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(HI)1\nAn aircraft has to fly from STN VOR (N58°12.42' W006°10.99') to ADN VOR (N57°18-63' W002°16.04'). What is the average true course for this route?",
    "feedback": "112°"
  },
  {
    "question": "Refer to Jeppesen GSPRM - London Heathrow EGLL, chart 11-4  The frequency, identification and localizer final approach QDM for runway 27R are:",
    "feedback": "110.3 MHz, IRR, 271°"
  },
  {
    "question": "(For this question use Flight Planning Manual MRJT 1) Given:\nEstimated take-off mass: 57 000 kgGround distance 150 NM Outside air temperature (OAT): ISA -10°CCruise at Mach: 0.74\nFind the optimum short distance cruise altitude and expected true airspeed",
    "feedback": "25 000 ft; 435 kt"
  },
  {
    "question": "The cruising speed to write in the appropriate box of a flight plan is:",
    "feedback": "true air speed"
  },
  {
    "question": "For an IFR flight planned to a destination aerodrome without any weather information available, the required fuel would be (airplane with jet engine):",
    "feedback": "To fly to the destination, including one missed approach at the DA, then a flight to one of the two selected alternate airports requiring the most fuel and then for another 30 minutes flying, and contingency fuel"
  },
  {
    "question": "Given the following information for a commercial air transport operation, calculate the maximum possible extra fuel, including any fuel penalty that can be uplifted.\nMaximum take-off mass: 233000 kgMaximum landing mass: 182000 kgMaximum zero fuel mass: 170000 kgDry operating mass: 122550 kgTraffic load: 41936 kgPlanned take-off fuel: 57143 kgTrip fuel: 52139 kgTaxi fuel: 300 kgMax. fuel tank capacity: 110000 kg\nFuel penalty: 394 kg/1000 kg of extra fuel",
    "feedback": "11371 kg"
  },
  {
    "question": "(for this question use Flight Planning Manual MRJT1, Figure 4.5.3.2)\nWhat will be the change in air range available from 1000 kg of fuel for the following situation if the OAT increases from -55°C to -45°C?\nAircraft mass at start of cruise leg: 50000 kgCruise level: FL350Cruise speed: Mach 0.74Forecast OAT at FL350: -55°CWind component at FL350: -25 kt",
    "feedback": "A reduction of 1 NAM"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Amsterdam, chart 11-1\nYou are cleared for an ILS RWY 06 approach via SUGOL. Your last clearance was to descend to FL70. You may leave FL70:",
    "feedback": "After passing SPL"
  },
  {
    "question": "Using the information in the Flight Log extract, what will be the actual fuel consumption from BRAVO to DELTA? The flight conditions on the legs from BRAVO to DELTA and the fuel consumption remain unchanged.",
    "feedback": "780 lb/h"
  },
  {
    "question": "Refer to Jeppesen GSPRM - VFR Chart ED-4\nYou are approaching Mühldorf airfield (EDMY, N48°16.77' E012°30.02') from the east on track 270°. The descent is to be planned to arrive at an altitude of 3500 ft approximately abeam of Altötting airfield.\nAtmospheric conditions = ISA, TAS = 110 KT, average wind = 300°(T)16KT, rate of descent = 500 ft/min, cruising level FL125.\nHow many miles is your top of descent TOD from Mühldorf?",
    "feedback": "35 NM"
  },
  {
    "question": "An aircraft on a track of 130°(M) has to overfly an obstacle of 26500 ft with a clearance of 2000 ft. The QNH is 1003 hPa and the OAT is ISA -15°C. What is the minimum flight level (FL) at which the aircraft may fly in RVSM airspace?\n(assume 1 hPa = 30 ft)",
    "feedback": "FL310"
  },
  {
    "question": "The flight crew of a turbojet aeroplane prepares a flight using the following data: - Flight leg air distance: 2 700 NM - Flight level FL 310, true airspeed: 470 kt - Tailwind component at this level: 35 kt - Initially planned take-off mass (without discretionary fuel on board): 180000 kg - Fuel price: 0.31 Euro/l at departure; 0.27 Euro/l at destination To maximize savings, the commander chooses to carry discretionary fuel in addition to that which is necessary. The optimum quantity of fuel which should be carried in addition to the prescribed quantity is:",
    "feedback": "The fuel transport operation is not recommended in this case"
  },
  {
    "question": "Find the distance to the POINT OF SAFE RETURN (PSR). \nGiven: maximum useable fuel 15000 kg, minimum reserve fuel 3500 kg, Outbound: TAS 425 kt,  head wind component  30 kt, fuel flow 2150 kg/h, Return: TAS 430 kt, tailwind component 20 kt, fuel flow 2150 kg/h",
    "feedback": "1125 NM"
  },
  {
    "question": "RVSM In-Flight procedure: When changing levels, the aircraft shall not overshoot or undershoot the cleared flight level by more than",
    "feedback": "150 ft"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Appendix 2, Flight Plan\nOn an ATC flight plan, the letter \"Y\" is used to indicate that the flight is carried out under the following flight rules.",
    "feedback": "IFR followed by VFR"
  },
  {
    "question": "An aircraft is flying at FL380, M0.77, OAT -52°C. ATC requests a change to FL350, M0.80, OAT -56°C.\nWhat is the change in TAS?",
    "feedback": "13 kt increase"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1, Figure 4.3.6)\nGiven:    Distance to Alternate   450 NM\nLanding mass at Alternate :       45 000 kg\nTailwind component :              50 kt\nThe Alternate fuel required is :",
    "feedback": "2500 kg"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1, LRC) For a flight of 2400 ground nautical miles the following apply : Temperature ISA -10°C Cruise altitude 29000ft Landing mass 45000kg Trip fuel available 16000kg What is the maximum headwind component which may be accepted ?",
    "feedback": "35 kt"
  },
  {
    "question": "Refer to CAP 697, Figure 4.1  With a cruise mass of 64000 kg, cruising at Mach 0.78, what is the optimum altitude?",
    "feedback": "30000 ft"
  },
  {
    "question": "The minimum obstacle clearance (MOC) value to be applied in the primary area of a mountainous area during the enroute phase of an IFR flight is:",
    "feedback": "If variation in terrain elevation is less than 5000 ft: 1500 ft, if variation is greater than 5000 ft: 2000 ft"
  },
  {
    "question": "An aeroplane flies at an airspeed of 380 kt. lt flies from A to B and back to A. Distance AB = 480 NM. When going from A to B, it experiences a headwind component = 60 kt. The wind remains constant. The duration of the flight will be:",
    "feedback": "2h 35min"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1, Figure 4.5.1) Given : Brake release mass : 58 000 kg Temperature : ISA + 15 The fuel required to climb from an aerodrome at elevation 4000 ft to FL300 is :",
    "feedback": "1250 kg"
  },
  {
    "question": "A flight has been diverted off the planned route due to bad weather. ATC clears the flight to re-join the planned route at TUSKA. The pilot wishes to decide early, if there is enough fuel to safely complete the flight or if a fuel diversion is needed, so he/she checks the fuel at 18:06 UTC. Following the data, whatminimum fuel is required at 18:06 UTC to complete the planned flight?\nMinimum fuel at TUSKA to complete the flight: 144 litres Average fuel flow: 45 kg/h ETO TUSKA: 18:43 UTC Fuel density: 0.72 kg/It",
    "feedback": "183 litres"
  },
  {
    "question": "Refer to Jeppesen GSPRM - North Atlantic Plotting Chart B777  The average magnetic course from C (62°N020°W) to B (58°N004°E) is",
    "feedback": "115°"
  },
  {
    "question": "Determine the maximum attainable flight time and range, given the following information:\nAverage fuel flow: 80 lb/hrAvailable fuel: 270 lbTAS: 89 ktWind component: 10 kt tailwind\nThe flight time is (1) .... and the range is (2) ....",
    "feedback": "(1) 3 hours 23 minutes, (2) 335 NM"
  },
  {
    "question": "What is the maximum estimated elapsed time or distance between points on track mentioned in item 15 of the flight plan, for flights outside designated ATS routes?",
    "feedback": "30 min / 200 NM"
  },
  {
    "question": "An aircraft is flying under VFR on a track of 168°(M). The elevation of the highest obstacle within 5 NM of the intended track of the aircraft is 4200 ft. Given the following information, provided by an aerodrome at 1400 ft elevation, what is the minimum flight level which will give an obstacle clearance of 1000 ft?\nQNH: 1026 hPaTemperature: 12°C below ISA\n(assume 1 hPa = 30 ft)",
    "feedback": "FL55"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)1\nA section of a flight is carried out from SUMBURGH (SUM) to ABERDEEN (ADN) along airway Y905. Choose the lowest flight level which can be used for the entire section:",
    "feedback": "FL110"
  },
  {
    "question": "Given the following information, what is the minimum block fuel required for the commercial air transport flight with a Performance Class A aeroplane using the Basic Fuel Scheme with variations for reduced contingency fuel?\nTaxi fuel: 300 kgTrip fuel A to DP: 12000 kgTrip fuel DP to destination: 9000 kgTrip fuel DP to optional refuelling destination: 3000 kgDestination alternate fuel (for both possible destinations): 2000 kgFinal reserve fuel: 1350 kgExtra fuel: 0 kgDiscretionary fuel: 0 kg",
    "feedback": "25100 kg"
  },
  {
    "question": "You are flying at 7000 ft on track 270°(T) and the requested altitude 10 NM before reaching the waypoint is 2000 ft. If the TAS is 168 kt, the average wind is 040°(T)/20 kt and the rate of descent is 1000 ft/min, how far is the ToD from the waypoint?",
    "feedback": "25 NM"
  },
  {
    "question": "Refer to Jeppesen GSPRM, Chart E(LO)2\nGiven the following bearing and range information obtained from POLE HILL POL VORDME (53°45'N, 002°06'W), what is the aircraft's position?\nRadial 017°, Range 85 NM. (Slant range corrections should be ignored)",
    "feedback": "55°06'N, 001°27'W"
  },
  {
    "question": "For pre-flight planning purposes, what is the block fuel required for a 2 hours and 24 min (2.4 hours) cruise time with a class B multi-engined piston aircraft? The departure aerodrome will be used as an alternate, in nil wind condition.\n(assume the Basic Fuel Scheme without variations applies)\nTaxi fuel: 10 LNormal fuel consumption: 95 L/hHolding fuel consumption: 76 L/hClimb fuel: 40 LDeparture and go around fuel: 20 LExtra fuel: 0 LDiscretionary fuel: 0 L",
    "feedback": "657 L"
  },
  {
    "question": "Refer to Jeppesen GSPRM - North Atlantic Plotting Chart B777\nThe average true course from A (64°N006°E) to C (62°N020°W) is",
    "feedback": "260°"
  },
  {
    "question": "The crew of an aircraft flying at FL100 in IMC in mountainous terrain wishes to descend to FL070. Given the following information, what is the true altitude at FL070 that the crew needs to use to confirm terrain clearance before descending to the new level?\nOAT at FL100: -20°CQNH: 975 hPa, reported from a nearby airport close to sea level(pressure correction 1 hPa=30 ft",
    "feedback": "5510 ft"
  },
  {
    "question": "The flight crew of a turbojet aeroplane prepares a flight using the following data: - Flight leg distance: 3 500 NM - Flight level FL 310, true airspeed: 450 kt - Headwind component at this level: 55 kt - Initially planned take-off mass (without discretionary fuel on board): 180 000 kg - Fuel price: 0.30 $/l at destination The commander may carry a fuel quantity of 8 000 kg in addition to that which is necessary. For this fuel transport operation to be cost effective, the maximum fuel price at departure must be:",
    "feedback": "0.27 $/l"
  },
  {
    "question": "Trip fuel for a commercial air transport flight includes fuel for ....",
    "feedback": "take-off to landing, including the expected departure, arrival, approach, climb and descent"
  },
  {
    "question": "NOTAM given:\nQ) EUAD/QOLAS/IV/M/E000/004/5626N00214W001A) EUAD B) FROM: 14 Mar 2017 16:30C) TO: 15 Mar 2017 23:59E) AIR NAV OBST UK0150J492F BLDG INCH CAPE O/S MET MAST SINGLE LGT U/S, PSN 562624.274N 0021429.366W, ELEV 381FT AMSL\nWhich of the following information regarding this NOTAM is correct?",
    "feedback": "The light of an obstacle is unserviceable"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1 Fig. 4.1) Find the OPTIMUM ALTITUDE for the twin jet aeroplane.  Given: Cruise mass=54000 kg, Long range cruise or .74 MACH",
    "feedback": "34500 ft"
  },
  {
    "question": "You are entering the NAT. What is the tolerance of the boundary window?",
    "feedback": "3 minutes"
  },
  {
    "question": "(for this question use Flight Planning Manual MRJT1, Figure 4.5.3.2 for pressure altitude 37000 ft)\nGiven the following information, how much trip fuel is required for a commercial air transport flight?\nRamp mass: 52500 kgTaxi fuel: 150 kgTake-off and climb fuel: 1650 kgCruise distance: 378 NAMAverage wind component in cruise: +20 ktOAT: ISADescent fuel: 275 kgApproach and landing fuel: 80 kgContingency fuel: 5 % of the trip fuelAlternate fuel: 250 kgHolding fuel consumption: 2400 kg/h",
    "feedback": "3905 kg"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1 Fig. 4.2) Find the SHORT DISTANCE CRUISE ALTITUDE for the twin jet aeroplane. Given: Brake release mass=40000 kg, Temperature=ISA + 20°C, Trip distance=150 Nautical Air Miles (NAM)",
    "feedback": "30000 ft"
  },
  {
    "question": "NOTAM excerpt:\n1) FROM 13/2/1 12002) TO 13/2/1 13003) CRD 433kHz U/S\nRegarding the NOTAM excerpt above, which statement is completely correct?",
    "feedback": "On the 1st of February 2013 the station CRD, a non-directional beacon, will be unserviceable for one hour (from 12:00 to 13:00)"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, charts 19-1 and 19-3.\nYou are approaching from the SW, VFR along the coast to recover to land; Alicante TWR is to be contacted at:",
    "feedback": "SW Reporting Point, before entering the ATZ"
  },
  {
    "question": "A0328/13 NOTAMN\nQ) BIRD/QOBCE/IV/M/A/000/999/A) BIRKB) 1312090800 C) 1403012359E) RWY13CONSTRUCTION CRANE ERECTED 39 METRES FROM THR RWY13 AND 135 METRES NORTH OF CENTRELINE RWY 13/31 HEIGHT OF CRANE: 85 FEET MSL.LENGTH OF BOOM: 22 METRES. POSITION OF CRANE: LAT: 64 08 01.6430N LON: 021 57 17.4029W CRANE IS LIT WITH OBS LGT (....)\nWhich statement about this NOTAM is correct?",
    "feedback": "Pilots need to be careful because of a crane reaching up to 85 ft above mean sea level"
  },
  {
    "question": "From which of the following would you expect to find details of the Search and Rescue organisation and procedures (SAR) ?",
    "feedback": "AIP (Air Information Publication)"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1, fig. 4.5.3.2) Find the fuel flow for the twin jet aeroplane with regard to the following data.  Given: MACH .74 cruise, Flight level 310, Gross mass 50000 kg, ISA conditions",
    "feedback": "2300 kg/h"
  },
  {
    "question": "When planning a commercial air transport flight, the trip fuel must include fuel for which of the following?\n1) Taxi, take-off and climb2) Cruise and step climb/descent3) Descent, approach and landing4) Contingencies and missed approach5) Holding for 15 minutes at 1500 ft above destination aerodrome elevation",
    "feedback": "2, 3"
  },
  {
    "question": "Refer to Jeppesen GSPRM, chart ED-4\nYou are planning a VFR flight from Schärding Süben (LOLS 48°24'11\"N 013°26'53\"E) to Pfarrkirchen (EDNP 48°25'12\" N 012°51'53\"E). Which of the following statements are true?\n1) The cruising altitude should be 5500 ft2) Your route follows the river \"Rott\" westwards3) The cruising altitude should be 6500 ft4) You will enter class F airspace during the final approach5) Your route follows the A3 motorway northwards6) You will enter class E airspace during the final approach",
    "feedback": "2, 3, 4"
  },
  {
    "question": "What should be considered when using the following NOTAM information from the transmitter during the validity period?\nQ EDGG/QNVXX/IV/BO/AE/000/999/5116N00645E025 A EDDL B FROM: 14/07/11 15:02 C TO: PERM E DUSSELDORF VOR/DME DUS, 115.5 MHZ/CH 98Y, VOR PART MAY ONLY BE USED FOR THE RADIALS IN THE PUBLISHED EN ROUTE, APPROACH AND DEPARTURE PROCEDURES",
    "feedback": "Use of the transmitter to fix the aircraft position outside of the published procedures is prohibited"
  },
  {
    "question": "Refer to GSPRM Stuttgart, chart 12-2 RNP Rwy 25\nYou are following the RNP Rwy 25 approach and are capable and authorised to fly to the LNAV/VNAV minima. What restriction, if any, apply to this procedure?",
    "feedback": "The temperature must be at or above -15°C if the aircraft uses Baro-VNAV only."
  },
  {
    "question": "Refer to Jeppesen GSPRM - Appendix 2, Flight Plan\nIn the ATS flight plan Item 13, in a flight plan submitted before departure, the departure time entered is the :",
    "feedback": "estimated off-block time"
  },
  {
    "question": "An aircraft is flying over terrain of up to 2000 ft elevation. The Minimum Holding Altitude MHA over this terrain provides, in the holding area, a minimum obstacle clearance of how many metres?",
    "feedback": "300 m"
  },
  {
    "question": "Given: True course (TC) 017°, W/V 340°/30 kt, True air speed (TAS) 420 kt Find: Wind correction angle (WCA) and ground speed (GS)",
    "feedback": "WCA -2°, GS 396 kt"
  },
  {
    "question": "(for this question use Flight Planning Manual MRJT1, Figure 3.1)\nGiven the following information, what is the total taxi fuel required for a commercial air transport flight?\nPlanned APU usage at the parking position: 30 minutes prior to taxiPlanned taxi time: 10 minutes at the departure aerodrome and 15 minutes at the destination aerodrome",
    "feedback": "168 kg"
  },
  {
    "question": "When a pilot fills in a flight plan, he must indicate the wake turbulence category. This category is a function of which mass?",
    "feedback": "maximum certified take-off mass"
  },
  {
    "question": "Refer to the extract of the OFP:\n\nWhat is the total distance between VTSP and your destination?",
    "feedback": "5190 NM"
  },
  {
    "question": "Which best describes the maximum intensity of CAT, if any, forecast for FL330 over TUNIS?",
    "feedback": "Nil"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Stuttgart, chart 11-1\nThe lowest published authorised RVR for an ILS approach, ALS out, aeroplane category B, is:",
    "feedback": "1200 metres"
  },
  {
    "question": "An aircraft is in cruising flight at FL 095, IAS 155kt. The pilot intends to descend at 500 ft/min to arrive overhead the MAN VOR at 2 000 FT (QNH 1 030hPa). The TAS remains constant in the descent, wind is negligeable, temperature standard. At which distance from MAN should the pilot commence the descent?",
    "feedback": "48 NM"
  },
  {
    "question": "Which of the following statements is correct regarding ICAO type A and type B charts?",
    "feedback": "ICAO type A charts provide the data necessary to enable an operator to comply with the operating limitations of Annex 6"
  },
  {
    "question": "\"Integrated range\" curves or tables are presented in the Aeroplane Operations Manuals. Their purpose is",
    "feedback": "to determine the fuel consumption for a certain still air distance considering the decreasing fuel flow with decreasing mass."
  },
  {
    "question": "During an IFR flight TAS and time appear to deviate from the data in the flight plan. The minimum deviations, that should be reported to ATC in order to conform to PANS-RAC, are:",
    "feedback": "TAS 5% and time 3 minutes."
  },
  {
    "question": "A sector distance is 450 NM long. The TAS is 460 kt. The wind component is 50 kt tailwind. What is the still air distance?",
    "feedback": "406 Nautical Air Miles (NAM)"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Amsterdam, chart 16-1\nAt what time from the beacon must a CAT A aircraft start its base turn?",
    "feedback": "1 min"
  },
  {
    "question": "Which of the following statements  regarding filing a flight plan is correct?",
    "feedback": "In case of flow control the flight plan should be filed at least three hours in advance of the time of departure."
  },
  {
    "question": "Refer to Jeppesen GSPRM - North Atlantic Plotting Chart B777\nThe initial magnetic course from C (62°N020°W) to B (58°N004°E) is",
    "feedback": "111°"
  },
  {
    "question": "(For this question use Fuel Planning MRJT1, Fig 4.4) An aircraft weighing 56000 kg is required to carry out an en-route straight and level hold at FL350 for 50 minutes. How much fuel will be used in the hold?",
    "feedback": "1917 kg"
  },
  {
    "question": "What is the height difference between the obstacle and the obstacle clearance altitude described in the following NOTAM?\nE) CRANE WITH OBST LGT 521231N 0000827E HGT 259FT AGL/302FT AMSL. VMC(C)OCA (OCH AAL) FOR ALL INSTRUMENT APPROACHES INCREASED TO 600FT AMSL",
    "feedback": "298 feet"
  },
  {
    "question": "Refer to Jeppesen GSPRM - VFR Chart ED-4\nWhat is the frequency of the navigation aid, located approximately 11 NM south of Munich aerodrome (N48°21.23' E011°47.17')?",
    "feedback": "112.30 MHz"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1, 4 Holding Fuel Planning, 4.1)\nGiven:\nWeather conditions: ISALanding mass at destination: 55500 kgAlternate fuel: 2500 kgDestination elevation: 1500 ftAlternate elevation: 3500 ftAirplane type: jet (2 engines)Holding pattern: racetrack\nCalculate the required final reserve fuel for a commercial flight:",
    "feedback": "1210 kg"
  },
  {
    "question": "Which of the following calculations would be equal to the amount of trip fuel?",
    "feedback": "Trip fuel = TOM - DOM - traffic load - contingency fuel - alternate fuel - final reserve fuel - extra fuel"
  },
  {
    "question": "(For this Question use Flight Planning Manual SEP 1, Fig. 2.4)  At 6000 ft what is the range of the aircraft at full throttle with 2500 RPM set?",
    "feedback": "756 NAM"
  },
  {
    "question": "Given the following information for a commercial air transport operation, calculate the maximum possible extra fuel to be uplifted.\nMaximum zero fuel mass MZFM: 2000 kgActual zero fuel mass AZFM: 2000 kgRegulated take-off mass RTOM: 3000 kgMaximum landing mass MLM: 2200 kgFuel tank capacity: 550 kgTrip fuel TF: 190 kgMinimum block fuel BF: 300 kg",
    "feedback": "90 kg"
  },
  {
    "question": "In the vicinity of Warsaw (52°N 020°E) the tropopause is at approximately",
    "feedback": "FL 330"
  },
  {
    "question": "Refer to the flight plan form and to the excerpt of ICAO DOC 4444:\nWhat does it mean if the letter \"S\" is entered in the ATS flight plan, item 10?",
    "feedback": "VHF RTF, VOR, ILS"
  },
  {
    "question": "(For this Question use Flight Planning Manual SEP 1, Fig. 2.2 Table 2.2.3)  Using the Power Setting Table, for the single engine aeroplane, determine the cruise TAS and fuel flow (lbs/hr) with full throttle and cruise lean mixture in the following conditions given: OAT 13° C Pressure altitude 8000 ft RPM 2300",
    "feedback": "160 kt and 69.3 lbs/hr"
  },
  {
    "question": "An airway is marked 5000 2900a. The notation 5000 is the :",
    "feedback": "minimum enroute altitude (MEA)"
  },
  {
    "question": "The maximum wind velocity (°/KT) immediately north of Tunis (36°N 010°E) is:",
    "feedback": "190/95"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Tromso, chart 12-1\nWhich is correct for a landing on Rwy 01?",
    "feedback": "For a straight-in landing, the decision height for category C aircraft is 983 ft, with a minimum missed approach climb gradient of 4 %"
  },
  {
    "question": "The flight crew of a turbojet aeroplane prepares a flight using the following data:\n- Flight level FL 370 at \"Long Range\" (LR) cruise regime\n- (Prescribed) mass at brake release: 204 500 kg\n- Flight leg ground distance: 2 000 NM\n- Temperatures: ISA\n- Headwind component: 70 kt\n- \"Total anti-ice\" set on \"ON\" for the entire flight\n- no requested climb and descent correction of the fuel consumption\n\nThe fuel required from take-off to landing is:",
    "feedback": "29 440 kg"
  },
  {
    "question": "Given the following information:\nDOM: 4565 kgTraffic load: 2590 kgRemaining usable fuel: 990 kgRemaining trip fuel to destination: 410 kgAlternate fuel: 235 kgFinal reserve fuel: 275 kg\nCalculate the revised estimated landing mass at the destination aerodrome.",
    "feedback": "7735 kg"
  },
  {
    "question": "For a planned flight the calculated fuel is as follows:  Flight time: 3h06min The reserve fuel, at any time, should not be less than 30% of the remaining trip fuel. Taxi fuel: 8 kg Block fuel: 118 kg How much fuel should remain after 2 hours flight time?",
    "feedback": "30 kg trip fuel and 9 kg reserve fuel."
  },
  {
    "question": "Assuming no significant change in fuel consumption, what would be the planned remaining fuel at waypoint 40N 050W?",
    "feedback": "29.7 tonnes"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1)\nGiven : Distance C - D :          3200 NM\nLong Range Cruise at FL 340           \nTemperature Deviation from ISA :  +12°C\nTailwind component :              50 kt\nGross mass at C :                 55 000 kg\nThe fuel required from C - D is :",
    "feedback": "14 500 kg"
  },
  {
    "question": "(For this Question use Flight Planning & Monitoring MEP1, Figure 3.3) A flight has to be made with a multi engine piston aeroplane. For the fuel calculations take 5 US gallons for the taxi, and an additional 13 minutes at cruise condition to account for climb and descent. Calculated time from overhead to overhead is 1h47min. Powersetting is 45%, 2600 RPM. Calculated reserve fuel is 30% of the trip fuel. FL 100. Temperature -5°C. Find the minimum block fuel.",
    "feedback": "47 US gallons."
  },
  {
    "question": "Given: - Take-off mass: 150 000 kg - Planned cruise at FL 350 - Long range MACH - Standard Atmosphere (ISA) - CG: 37 % You have to cover an air distance of 2 000 NM.Your flight time will be:",
    "feedback": "304 minutes"
  },
  {
    "question": "From which of the following would you expect to find the dates and times when temporary danger areas are active?",
    "feedback": "NOTAM and AIP (Air Information Publication)"
  },
  {
    "question": "Refer to the following NOTAM excerpt:\nE) TAXIWAY 'C' CLOSED BTN TWY CD AND TWY CL BOTH EXCLUDED TO ALL OPS DUE TO WIP, TWY AVBL WITH 60MIN PN.\nWhich of the following is correct regarding its content?",
    "feedback": "Taxiways CL and CD are operational"
  },
  {
    "question": "The Commander of a commercial air transport flight has been scheduled for the same flight in three consecutive days. During the first two flights he/she notices that the actual payload is higher than anticipated having as a consequence increased fuel consumption to the destination aerodrome. If during the pre-flight fuel calculation for the third day, the Commander decides to anticipate for a similar event by adding 500 kg of fuel, this should be added as part of the ....",
    "feedback": "discretionary fuel"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1, Fig 4.4)\nMean gross mass is 47000 kg. Find the fuel required for 15 minutes holding in a straight and level flight at 5000 ft.",
    "feedback": "518 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Amsterdam, chart 16-2\nWhat type of approach lighting is available for Rwy 18C?",
    "feedback": "HIALS-II"
  },
  {
    "question": "The fuel breakdown for a flight from VOGO (Goa) to EGCC (Manchester) is shown. The pilots decide to carry an extra 1500 kg of fuel due to weather at the destination. Using a fuel flow of 4.5 tonnes per hour, how much extra holding time in minutes will this extra fuel give at the destination EGCC?",
    "feedback": "15 min"
  },
  {
    "question": "On an ATC flight plan, to indicate that you will overfly the way-point TANGO at 350 kts at flight level 280, you write:",
    "feedback": "TANGO / N0350 F280"
  },
  {
    "question": "The following data for a flight of a twin engine jet aircraft are provided for the calculation:\nMaximum landing mass = 51 300 kgMaximum allowable take off mass = 56 300 kgDry operating mass = 29 100 kgLoad = 11 700 kgTrip fuel = 3000 kgContigency fuel = 215 kgFinal reserve fuel = 1250 kgAlternate fuel = 1300 kgTaxi fuel = 200 kg\nDetermine the maximum possible discretionary fuel that can be uplifted for this flight.",
    "feedback": "7735 kg."
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)3\nThe symbol at Boulogne (N50°37.49' E001°54.43') has the meaning:",
    "feedback": "VOR on 113.80 MHz and a compulsory reporting point"
  },
  {
    "question": "Given:\n. Mass at brake release: 190 000 kg . Selected cruise speed: 0.82 Mach . Flight leg distance: 1 500 NM . Cruise level: optimum . Air conditioning: standard . Anti-icing: OFF . Temperature: ISA . CG: 37%\nAssuming zero wind, the planned Landing Mass at destination will be:",
    "feedback": "171200 kg"
  },
  {
    "question": "Given the following information for a commercial air transport operation, calculate the maximum possible extra fuel to be uplifted.\nMaximum zero fuel mass: 62731 kgActual zero fuel mass: 55031 kgRegulated take-off mass: 76000 kgMaximum landing mass: 66360 kgFuel tank capacity: 16000 kgTaxi fuel: 240 kgTrip fuel: 7931 kgMinimum block fuel: 16000 kg",
    "feedback": "Not able to carry extra fuel"
  },
  {
    "question": "The elevation of the departure airport is 2500 ft.\nAn aircraft has to climb to FL 105 with a rate of climb of 750 ft/min. The QNH is 995 hPa.\nDetermine the climb time",
    "feedback": "10 min."
  },
  {
    "question": "Refer to the following NOTAM. Is a departure from EUAD permitted on March 1st?\nQ)EGTT/QAZCD/IV/NBO/AE/000/022/5456N00249W002A)EUAD B)FROM: 16/0204 09:00 C) TO: 16/03/05 18:00E)AERODROME ATZ DEACTIVATED. ATS NOT AVBL. AD NOT AVBL TO ACFT EXCEPT WITH OUT OF HOURS PERMISSION. IAP NOT AVBL.",
    "feedback": "Yes, but a permission to fly out of hours has to be obtained"
  },
  {
    "question": "(For this question use Flight Planning Manual MEP1 Figure 3.6)\nA flight is to be made to an airport, pressure altitude 3000 ft, in a multi engine piston aeroplane (MEP1). The forecast OAT for the airport is -1° C. The cruising level will be FL 110, where OAT is -10° C.\nCalculate the still air descent distance for:\n145 KIAS\nRate of descent 1000 ft/min\nGears and flaps up",
    "feedback": "20 NM"
  },
  {
    "question": "Which statement is correct regarding the policy on the additional fuel, according to the EU-OPS Regulations for commercial air transport flights?",
    "feedback": "An operation without a destination alternate aerodrome: fuel to hold for 15 minutes at 1500 ft (450 m) above the destination aerodrome in standard conditions"
  },
  {
    "question": "For pre-flight planning purposes, what is the required fuel for take-off for an IFR flight with a turbine engine aircraft?\n(assume the Basic Fuel Scheme without variations applies)\nTaxi fuel (with APU usage included): 50 lbClimb fuel: 300 lbCruise distance: 847 NAMCruise fuel consumption: 6 lb/NAMDescent fuel: 200 lbApproach and landing fuel: 250 lbAlternate fuel: 650 lbContingency fuel: 5 % trip fuelFinal reserve fuel: 2150 lb/hFuel for missed approach at alternate: 450 lbExtra fuel: 0 kgDiscretionary fuel: 0 kg",
    "feedback": "7849 lb"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Aberdeen, chart 10-3 \nAn aircraft departs runway 16, routing via PTH. At D7.0 ADN, the aircraft passes an altitude of 1020 ft MSL. What is the correct procedure for the continuation of the flight?",
    "feedback": "At D8.5 ADN turn right to LAVTI, turn left to GLESK, then to PTH"
  },
  {
    "question": "(For this question use Flight Planning Manual MRJT 1 Figure 4.3.1.a)Given the following data, calculate the trip fuel.\nTrip distance: 500 NMISA deviation: -5°CAverage wind: 25 kt tailwindPressure altitude: 37000 ftEstimated landing weight: 40000 kgLong range cruise",
    "feedback": "2680 kg"
  },
  {
    "question": "The approximate mean wind component (kt) along true course 180° from 50°N to 40°N at 015° W is",
    "feedback": "tail wind 20 kt"
  },
  {
    "question": "Refer to Jeppesen GSPRM - London Heathrow EGLL, chart 11-2  The MDH for a LOC (GS out) for a landing on runway 09R is:",
    "feedback": "405 ft"
  },
  {
    "question": "Given:\nMOCA: 3700 ftCruising level: FL050OAT: ISA -15°CQNH: 1004 hPaAerodrome elevation: 1500 ft\nWhat is the true altitude to make sure that the Minimum Obstacle Clearance Altitude (MOCA) is maintained?",
    "feedback": "4530 ft"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)1\nThe initial magnetic course from TIREE 117.7 TIR (56°30'N 006°53'W) direct to STORNOWAY 115,1 STN (58°12'N 006°11'W) is:",
    "feedback": "016°"
  },
  {
    "question": "Which of the following circumstances would be considered suitable for fuel tankering?\n1) The estimated landing mass is equal to the maximum landing mass2) The weather at the destination is below landing minima3) Unable to climb to the Minimum Obstacle Clearance Altitude (MOCA) should an engine fail4) There is no fuel available at the destination aerodrome",
    "feedback": "2 and 4"
  },
  {
    "question": "Refer to Jeppesen GSPRM, chart E(LO)6\nYou are planning to fly from VALENCIA VOR (N39°29' W000°29') to ALMERIA VOR (N36°49' W002°15').\nWhich is the most acceptable route to fly if LE(R)-63 is not active?",
    "feedback": "VLC-A34-ALT-D-AMR"
  },
  {
    "question": "In standard atmosphere, assuming a mass of 197 000 kg, in order to fly at FL 370 and to be at the optimum altitude, your Mach number should be:",
    "feedback": "0.82"
  },
  {
    "question": "(For this question use Fuel Planning MRJT1, Figures 4.8.1, 4.8.2) An aircraft is planned to fly a Long Range Cruise (LRC) at FL350, ISA -15C at an average gross cruise weight of 55000 kg and a landing weight without tankered fuel of 47500 kg. The wind component is -50 kts and the trip distance 1600 NGM.  Calculate the break even fuel price at the destination airport if the fuel price at the departure airport is 75 cents/US Gallon.",
    "feedback": "90 cents"
  },
  {
    "question": "In case of an engine failure, unable to maintain altitude, how many miles do you have to fly offset of NAT track (new procedure) ?",
    "feedback": "5 NM left or right"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)4\nThe airspace centered over DIJON 111.45 DJL (N47°06.22 'E005°01.07') is the:",
    "feedback": "TMA Basle, 3000 ft MSL to FL65"
  },
  {
    "question": "Planned and actual data as shown in the Flight Log excerpt.\n\nActual Ground Speed (GS) on the leg BETA to GAMMA will be 105 KT. If all other flight parameters remain unchanged, what fuel remaining should be expected at waypoint GAMMA?",
    "feedback": "3260 kg"
  },
  {
    "question": "Given: Maximum allowable take-off mass 64400 kg, Maximum landing mass 56200 kg, Maximum zero fuel mass 53000 kg, Dry operating mass 35500 kg, Traffic load 14500 kg, Trip fuel 4900 kg, Take-off fuel 7400 kg\nFind: Maximum additional load",
    "feedback": "3000 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, chart 10-3C\nAn aircraft is departing on runway 28, with all navaids serviceable. Which of the following refers to the corresponding routing?",
    "feedback": "Minimum altitude at D9.5 ALT 3100 ft, maximum speed during the turn to radial 246 ALT 220KT, MSA between D9.5 ALT and D6.3 ALT 5900 ft, minimum altitude at SUMMO 5000 ft."
  },
  {
    "question": "Refer to Jeppesen GSPRM - VFR Chart ED-4\nWhat is the distance from WALDA 112.80 (WLD, N48°35' E011°08') to MUNICH 112.30 (MUN, N48°11' E011°49')?",
    "feedback": "67 km"
  },
  {
    "question": "With the information given below, calculate the maximum range of a single-engine piston aircraft in commerical air transport, excluding any reserves.\nTotal tank capacity: 300 kgTaxi fuel: 3 kgAlternate fuel: 12 kgContingency fuel: 5 % of tripFuel flow: 35 kg/hGS: 130 kt",
    "feedback": "915 NM"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Appendix 2, Flight Plan\nAn aircraft plans to depart London at 1000 UTC and arrive at Munich (EDDM) at 1215 UTC. In the ATS flight plan Item 16 (destination/EET) should be entered with :",
    "feedback": "EDDM0215"
  },
  {
    "question": "Refer to Jeppesen GSPRM - North Atlantic Plotting Chart B777\nThe initial true course from C (62°N020°W) to B (58°N004°E) is",
    "feedback": "098°"
  },
  {
    "question": "Given the following information, calculate the actual fuel at the destination for the commercial flight.\n(assume the Basic Fuel Scheme without variations applies)\nAssume that the actual fuel consumption is maintained at the same rate.Total distance from A to B: 320 NMFuel remaining after 1 hour 15 minutes: 859 USGDistance travelled after 1 hour 15 minutes: 119 NMAverage TAS: 115 ktWind component: 20 kt headwindTrip fuel: 1280 USGPlanned average fuel flow: 380 USG/hExtra fuel: 0 USGDiscretionary fuel: 0 USG",
    "feedback": "146 USG"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)1\nWhich of the following is a correctly specified navaid to obtain a bearing at Kirkwall (EGPA, N58°58' W002°54')?",
    "feedback": "NDB KW, 395 kHz"
  },
  {
    "question": "You are departing from La Fleche (LFAL) in France in a light twin-engine aircraft, and intend to cross Nantes (LFRS) airfield. Due to the weather you receive a clearance to cross the Nantes Control Zone, Class D airspace, IFR at 2000 ft with your own routing.\nWho is responsible for terrain separation?",
    "feedback": "The Pilot-in-Command is always responsible for terrain separation, except when following vectors under IFR"
  },
  {
    "question": "Finish the endurance/fuel calculation and determine ATC endurance for a twin jet aeroplane, with the help of the table provided. Contingency is 5% of the planned trip fuel and fuel flow for discretionary fuel is 2400 kg/h.",
    "feedback": "ATC endurance: 04:07"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1, 3.1 Simplified Planning Chart Corrections)\nGiven the following information, how much taxi fuel is required for a commercial air transport flight?\nPlanned taxi time: 15 minutes at both, departure and destination aerodromes",
    "feedback": "165 kg"
  },
  {
    "question": "You are flying an aircraft which transports health personnel to an aera of conflict. What information should be entered in field 18 of your flight plan so that your flight will be handled with priority?",
    "feedback": "STS/HOSP"
  },
  {
    "question": "Referring to the given ATC flight plan, who is the operator of the filed flight?",
    "feedback": "BAVARIA"
  },
  {
    "question": "The following NOTAM is given:\nMADRID APPROACH FRQ CHNG FROM 118.400 TO CH 118.405 READ INSTEAD.\nWhat does it mean?",
    "feedback": "In order to read frequency 118.400 MHz you have to set 118.405 MHz"
  },
  {
    "question": "Who is able to perform an ETOPS pre-departure service check on an A330?",
    "feedback": "Only an ETOPS qualified maintenance person can do that"
  },
  {
    "question": "A pilot is planning a VFR flight from Ajaccio (LFKJ) to Maria Di Campo (LIRJ) aerodrome with alternate aerodrome Grosseto (LIRS). Given the following information, what is the required time from Marina Di Campo to Grosseto?\nCruise distance from LIRJ to LIRS: 24 NMClimb fron LIRJ to cruise altitude: 3 minutesDescent to LIRS: 4 minutesCruise TAS: 150 ktWind: 050°(T)/20 ktTrack from LIRJ to LIRS: 090°(T)",
    "feedback": "18 minutes"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, chart 10-3A\nYour departure is via CATON 3A and you are cleared to FL80. Due to a restriction you have to remain at 2000 ft until passing VORDME ALT. QNH is 1040 hPa, ROC is 800 ft/min and GS is 133 KT. When are you reaching the top of climb (TOC)?",
    "feedback": "1 NM before VILNA"
  },
  {
    "question": "(For this Question use Flight Planning & Monitoring SEP1 Fig. 2.4) Using the Range Profile Diagramm, for the single engine aeroplane, determine the range, with 45 minutes reserve, in the following conditions: Given : O.A.T.: ISA -15°C  Pressure altitude: 12000 ft Power: Full throttle / 23,0 in/Hg./ 2300 RPM",
    "feedback": "902 NM"
  },
  {
    "question": "What is the difference between an RNAV STAR and an RNAV STAR overlay? An RNAV STAR overlay ......",
    "feedback": "is the same as a conventional STAR, with RNAV waypoints over the original waypoints"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1 Figure 4.7.3)\n\nGiven:\nDiversion distance                720NM\nTail wind component               25kt\nMass at point of diversion        55000kg\nTemperature                       ISA\nDiversion fuel available          4250kg\nWhat is the OEI minimum pressure altitude at which the above conditions may be met ?",
    "feedback": "25000ft"
  },
  {
    "question": "An aircraft is flying at FL80. The QNH from a station with an elevation of 2500 ft is 1040 hPa. The OAT is -20°C. Calculate the true altitude.",
    "feedback": "8330 ft"
  },
  {
    "question": "Using the information in the flight log extract, calculate the actual fuel used from ALPHA to DELTA. The flight conditions on the leg CHARLIE to DELTA and the fuel consumption remain unchanged.",
    "feedback": "93 lb"
  },
  {
    "question": "The following data for a flight leg from 'A' to 'B' is given:\nDistance = 300 NMWind (true) = 340/40Magnetic course = 300°Variation = 20°ETAS = 440 kt\nDetermine the flight time for this leg.",
    "feedback": "45 min."
  },
  {
    "question": "Refer to Jeppesen GSPRM - Amsterdam, chart 10-2B\nYou are flying from the waypoint MOLIX to SUGOL, with 330 KT TAS, 180/25KT wind, fuel flow 1800 kg/h. Your actual fuel over MOLIX is 3000 kg. ATC asks you to hold over SUGOL for 20 minutes. What is your fuel remaining after the holding?",
    "feedback": "2190 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, chats 11-1, 11-2, 13-1, 13-2\nWhich approaches start overhead VILNA?",
    "feedback": "VOR Z and ILS Z or LOC A"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Nantes, charts 19-1, 19-2, 19-3\nWhat is the elevation of the highest obstacle on the chart?",
    "feedback": "912 ft AMSL"
  },
  {
    "question": "(For this question use Flight Planning Manual MRJT 1 Figure 4.3.6)\nGiven the following information, find the minimum required alternate fuel for an IFR commercial air transport flight with a duration of 8 hours, to a destination for which the operator has nominated two destination alternates ALTN1 and ALTN2. At the destination, meteorological information is available, weather conditions are expected to be above the planning minima within ETA +/- 1 hour, two runways are available and usable, the ceiling will be 1500 ft, and the ground visibility 4 km.\nDistance to ALTN1: 200 NMWind to ALTN1: 50 kt HWCDistance to ALTN2: 275 NMWind to ALTN2: 25 kt TWCLanding mass at alternates: 55.0 t",
    "feedback": "1900 kg"
  },
  {
    "question": "The MOC value to be applied in the primary area for the en-route phase of an IFR flight in mountainous areas, where the variation in terrain elevation is 7000 ft, is:",
    "feedback": "600 m"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1 Figure 4.3.5)\n\nFor a flight  of 2800 ground nautical miles the following apply :\nHead wind component:                 20 kt\nTemperature:                         ISA + 15°C\nBrake release mass                   64700 kg\nThe (a) trip fuel and (b) trip time respectively are :",
    "feedback": "(a) 17200 kg   \n(b) 6 hr 42 min"
  },
  {
    "question": "(For this Question use Flight Planning Manual SEP 1, Fig. 2.2 Table 2.2.3)  Using the Power Setting Table, for the single engine aeroplane, determine the manifold pressure and fuel flow (lbs/hr) with full throttle and cruise lean mixture in the following conditions given: OAT 13° C Pressure altitude 8000 ft RPM 2300",
    "feedback": "22.4 in.Hg and 69.3 lbs/hr"
  },
  {
    "question": "The approximate mean wind velocity expected enroute at FL300 from Oslo to London is:",
    "feedback": "236°/51 KT"
  },
  {
    "question": "During a flight it was found that the wind was 20 kt stronger than forecast.\nIf the distance from destination to the alternate is 57 nm and the forecast wind was 20 kt headwind, with a TAS of 150 kt and assuming that conditions remain the same, what is the new estimated time from destination to the alternate?",
    "feedback": "31 min."
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, charts 19-1, 19-2, 19-3\nHow many VFR procedures are published?",
    "feedback": "5"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1)\nGiven: Brake release mass 57500 kg, Temperature ISA -10°C, Headwind component 16 kt, Initial FL 280\nFind: Still air distance (NAM) and ground distance (NM) for the enroute climb 280/.74",
    "feedback": "62 NAM, 59 NM"
  },
  {
    "question": "For pre-flight planning purposes, what is the minimum Take-off fuel required for the commercial air transport flight with Performance Class A aeroplanes, given the following information?\n(assume the Basic Fuel Scheme without variations applies)\nTrip fuel for a jet aeroplane to fly from the departure aerodrome to the destination aerodrome: 8350 kgFuel consumption in holding mode: 2800 kg/hFuel needed to carry out one go-around and land at the alternate: 4380 kgExtra fuel: 0 kgDiscretionary fuel: 0 kg",
    "feedback": "14548 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, charts 19-1, 19-2, 19-3\nWhat is the elevation of the highest obstacle on the chart?",
    "feedback": "4252 ft AMSL"
  },
  {
    "question": "(For this question use Flight Planning Manual MRJT 1 Figure 4.3.6)\nIn order to get alternate fuel and time, the twin -jet aeroplane operations manual graph shall be entered with:",
    "feedback": "Distance (NM), wind component, landing mass at alternate."
  },
  {
    "question": "Assuming a departure/destination fuel price ratio of 0.91, the commander decides to optimize fuel tankering by using the following data:\n. Cruise flight level: FL 350\n. Air distance to be covered: 2 500 NM\n. Planned take-off mass: 200 000 kg (with the minimum prescribed fuel quantity of 38 000 kg that includes a trip fuel of 29 000 kg)\n. Maximum landing mass: 180 000 kg\n. Maximum take-off mass: 205 000 kg\n. Maximum tank capacity: 40 000 kg\nThe additional fuel quantity will be:",
    "feedback": "0 kg"
  },
  {
    "question": "(For this Question use Flight Planning & Monitoring SEP1 Fig. 2.1)  Given: FL 75 OAT: +5°C During climb: average head wind component 20 kt Take-off from MSL with the initial mass of 3 650 lbs. Find: Time and fuel to climb.",
    "feedback": "9 min. 3,3 USG"
  },
  {
    "question": "Refer to Jeppesen GSPRM, VFR chart ED-4:\nYou are planning a VFR flight from Blaubeuren (EDMC, N48°25' E009°48') to Schwenningen am Neckar (EDTS, N48°04' E008°34') on the most direct routing. The route may include any airspace at these two waypoints, but the remaining portions of the route shall be clear of any airspace classes D, E or F and of any danger or restricted areas.\nWhich of the following landmarks would be suitable to overfly as a turning point?",
    "feedback": "The mast southwest of Balingen (N48°13' E008°49')"
  },
  {
    "question": "Given the following information for a commercial air transport operation, calculate the maximum possible extra fuel to be uplifted.\nMaximum zero fuel mass: 62731 kgActual zero fuel mass: 58000 kgRegulated take-off mass: 76000 kgMaximum landing mass: 66360 kgFuel tank capacity: 16000 kgTaxi fuel: 240 kgTrip fuel: 13500 kgMinimum block fuel: 16000 kg",
    "feedback": "Not able to carry extra fuel"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)15\nThe initial magnetic course from GALATI 108.2 GLT (N45°24.99' E027°55.67') to SUCEAVA 112.3 SCV (N47°40.34' E026°21.65') on airway L621 is:",
    "feedback": "329°"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Aberdeen, chart 10-3 \nAn aircraft departs runway 16, routing via PTH. At D7.0 ADN, the aircraft passes an altitude of 1020 ft MSL. What is the correct procedure for the continuation of the flight?",
    "feedback": "At D8.5 ADN turn right to LAVTI, turn left to GLESK, then to PTH"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, chart 10-2G\nWhich of the following is correct for an approach to runway 10?",
    "feedback": "Continuous Descent Arrival via CALLES and VILNA"
  },
  {
    "question": "The W/V (°/kt) at 40°N 020°W is",
    "feedback": "310/40"
  },
  {
    "question": "(For this question use Flight Planning Manual MEP1 Figure 3.1) A flight is to be made from one airport (elevation 3000 ft) to another in a multi engine piston aeroplane (MEP1). The cruising level will be FL 110. The temperature at FL 110 is ISA - 10° C. The temperature at the departure aerodrome is -1° C. Calculate the fuel to climb with mixture rich.",
    "feedback": "6 US gallons"
  },
  {
    "question": "In the cruise at FL 155 at 260 kt TAS, the pilot plans for a 500 feet/min descent in order to fly overhead MAN VOR at 2 000 feet (QNH 1030). TAS will remain constant during descent, wind is negligible, temperature is standard.\nThe pilot must start the descent at a distance from MAN of:",
    "feedback": "120 NM"
  },
  {
    "question": "Following in-flight depressurisation, a turbine powered aeroplane is forced to divert to an en-route alternate airfield. If actual flight conditions are as forecast, the minimum quantity of fuel remaining on arrival at the airfield will be:",
    "feedback": "at least equivalent to 30 minutes flying time"
  },
  {
    "question": "Mark the correct statement:\nIf a decision point procedure is applied for flight planning,",
    "feedback": "the trip fuel to the destination aerodrome is to be calculated via the decision point."
  },
  {
    "question": "(For this question use Flight Planning Manual MEP1 Figure 3.1)\nWhat is the fuel, time and distance to climb from an aerodrome at sea level up to FL100, where the outside air temperature is 0°C?",
    "feedback": "9 USG, 16 min, 28 NM"
  },
  {
    "question": "For pre-flight planning purpose what is the total fuel required for a commerical air transport flight with a multi-engined piston aircraft under IFR?\n(assume the Basic Fuel Scheme without variations applies)\nTrip fuel: 83 litresDestination alternate fuel: 18 litresTaxi fuel: 5 litresFuel flow: 35 litres per hourExtra fuel: 0 litresDiscretionary fuel: 0 litres",
    "feedback": "136 litres"
  },
  {
    "question": "When completing an ATS flight plan for a European destination, clock times are to be expressed in :",
    "feedback": "UTC"
  },
  {
    "question": "An operator (turbojet engine) shall ensure that calculation up of usable fuel for a flight for which no destination alternate is required includes, taxi fuel, trip fuel, contingency fuel and fuel to fly for:",
    "feedback": "45 minutes at holding speed at 450 m above aerodrome elevation in standard conditions"
  },
  {
    "question": "Given the following planning data, calculate the maximum possible extra fuel in kg, including any fuel penalty that can be uplifted.\nMaximum ramp mass: 77500 kgMaximum take-off mass: 73000 kgMaximum landing mass: 66360 kgMaximum zero fuel mass: 62720 kgDry operating mass: 42845 kgTraffic load: 17460 kgPlanned take-off fuel: 10365 kgTrip fuel: 7890 kgTaxi fuel: 195 kgMax. fuel tank capacity: 21000 kg\nFuel penalty: 135 kg/1000 kg of extra fuel",
    "feedback": "2330 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Nantes, charts 19-1, 19-2, 19-3\nWhat is a valid Special VFR minimum for an operation at Nantes?",
    "feedback": "Departures to the west have to maintain an altitude of not more than 1000 ft AMSL"
  },
  {
    "question": "Which best describes the significant cloud forecast for the area east of Tunis (36°N 010°E)?",
    "feedback": "5 to 7 oktas CU and AC, base below FL 100, tops FL 180"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Appendix 2, Flight Plan\nThe following information is provided in item 15 of an ATS flight plan:\nN0476F330 MODRU Z717 GOBNO UZ717 MAS UM 617 SOGRI UL608 DENUT UL610 GILDA UL620 SAM/N0470F350 UN20 GAPLI/M081F370 DCT BEDRA/M081F390 DCT 48N021W 46N031W 44N041W 40N060W/M081F410 DCT BALOO DCT ANTIG M328 SLEMA DCT ZFP/N0466F410 BR70V TURBO AR10 DHP J79 EYW DCT CANOA UB646 VINKA UB879 CUN DCT\nWhat information is shown for position ZFP?",
    "feedback": "The speed is planned at 466 kt TAS"
  },
  {
    "question": "The planned departure time from the parking area is 1815 UTC\nThe estimated take-off time is 1825 UTC\nThe IFR flight plan must be filed with ATC at the latest at:",
    "feedback": "1715 UTC"
  },
  {
    "question": "A pilot is preparing a commercial flight but during the planning phase the latest weather update at the destination aerodrome leads to a change of the runway which in turn results to a more time consuming arrival section.\nRegarding the trip fuel:",
    "feedback": "It has to be updated accordingly"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Amsterdam, chart 11-1\nWhere or when do you start the inbound turn for the final approach?",
    "feedback": "1 minute after LCTR"
  },
  {
    "question": "Refer to Jeppesen GSPRM Stuttgart, chart 10-3P:\nYou are planning to depart from Stuttgart (EDDS) on the DKB4H departure route and it is required to have a backup conventional navigation system. Which of the following is required?\n1) VORDME receiver2) GPS3) ADF receiver4) STG and LBU navaids serviceable5) STG and DKB navaids serviceable",
    "feedback": "1, 2, 5"
  },
  {
    "question": "The commander is responsible for the fuel. What is true regarding a diversion of a commercial flight?",
    "feedback": "The remaining fuel should be at least the same amount as the required fuel to reach an aerodrome where a safe landing can be made, with final reserve fuel remaining"
  },
  {
    "question": "Determine the maximum attainable flight time and range, given the following information:\nAverage fuel flow: 31.5 kg/hrAvailable fuel: 76 kgTAS: 85 ktWind component: 20 kt tailwind\nThe flight time is (1) .... and the range is (2) ....",
    "feedback": "(1) 2 hours 25 minutes, (2) 253 NM"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Amsterdam, chart 11-3\nWhat is the minimum descent height for an aircraft CAT A when circling to land on runway 18C?",
    "feedback": "711 ft"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(HI)3\nYou are flying overhead ST PETERSBURG (N59°48.4' E030°16.5') on airways to ATLUM (N59°45.9' E027°40.1'). What is the magnetic track and distance after passing UTETA (N59°44.1' E029°01.0')?",
    "feedback": "263°, 41 NM"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Appendix 2, Flight Plan\nWhen completing an ATS flight plan for a flight commencing in accordance with VFR and subsequently changing to IFR the letter entered in item 8 (flight rules) would be:",
    "feedback": "Z"
  },
  {
    "question": "Which of the following statements is (are) correct with regard to the advantages of computer flight plans ?\n1. The computer can file the ATC flight plan.\n2. Wind data used by the computer is always more up-to-date than that available to the pilot.",
    "feedback": "Statement 1 only"
  },
  {
    "question": "(For this Question use Planning MRJT1, Figure 4.3.6)\nWhat is the fuel and time to the alternate? Given:\nDistance to alternate airfield: 300 NGMWind: 50 kts tailLanding mass: 50000 kg",
    "feedback": "1950 kg, 48 min"
  },
  {
    "question": "Given the following data for the pre-flight calculations, determine the trip fuel required for a commercial air transport flight.\n(assume the Basic Fuel Scheme without variations applies)\nTrip distance: 122 NMTAS: 145 ktHeadwind component: 15 ktAverage fuel flow: 4500 kg/hExtra fuel: 0 kgDiscretionary fuel: 0 kg",
    "feedback": "4223 kg"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1 Figure 4.5.3.1)\nFind the fuel required to fly from C to D given:\n\nDistance C-D:                      3200 NM\nCruise                             FL340/LRC\nOAT:                               ISA +12C\nTailwind component :               50 kt\nGross mass at C:                   55 000 kg",
    "feedback": "14500 kg"
  },
  {
    "question": "Planned and actual data as shown in the Flight Log excerpt. Provided that flight conditions on the leg GAMMA to DELTA remain unchanged and fuel consumption remains unchanged, what fuel remaining should be expected at waypoint DELTA? Consider specific gravity 0.79.",
    "feedback": "1535 USG"
  },
  {
    "question": "An aircraft on an IFR flight on a track of 225°(M) has to clear an obstacle of 6600 ft by 1500 ft. If the QNH is 1030 hPa and the temperature is ISA -15°C, what is the lowest Flight Level at which the aircraft may fly to clear the obstacle?\n(assume 1 hPa = 30 ft)",
    "feedback": "FL100"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(HI)2\nTo the east of KOKSY 114.5 KOK (N51°05.7' E002°39.1'):",
    "feedback": "The correct answers are: A plain language inflight weather service is available on 127.8 MHz, a plain language inflight weather service is available on 126.2 MHz"
  },
  {
    "question": "Determine the maximum attainable flight time and range, given the following information:\nAverage fuel flow: 9.6 USG/hrAvailable fuel: 50 USGTAS: 100 ktWind component: 15 kt tailwind\nThe flight time is (1) .... and the range is (2) ....",
    "feedback": "(1) 5 hours 13 minutes, (2) 599 NM"
  },
  {
    "question": "Refer to Jeppesen GSPRM, chart E(LO)6\nYou are planning to fly from VALENCIA VOR (N39°29' W000°29') to ALMERIA VOR (N36°49' W002°15').\nWhich is the most acceptable route to fly when choosing a conventional ATS route and if LE(R)-63 is not active?",
    "feedback": "VLC-G850-AMR"
  },
  {
    "question": "RVSM was first implemented in which airspace?",
    "feedback": "NAT"
  },
  {
    "question": "Refer to Jeppesen GSPRM Alicante, charts 13-3, 13-4, 13-5\nDuring preflight planning a NOTAM states that the ALTET VORDME (ALT) is unserviceable at the time of arrival at Alicante. What VOR approaches are available from MAGAL to Runway 28?",
    "feedback": "Only the VOR X approach"
  },
  {
    "question": "The letter 'L' shall be inserted into item 9 of the ICAO FPL form (wake turbulence category) when the maximum certificated take-off mass of an aircraft is less or equal to:",
    "feedback": "7 000 kg"
  },
  {
    "question": "Refer to the extract of the OFP:\n\nWhat is the time required to reach waypoint LIBDI?",
    "feedback": "70 min"
  },
  {
    "question": "There is a distinction between a conventional STAR and an RNAV STAR overlay. Compared to a conventional STAR, an RNAV STAR overlay:",
    "feedback": "Cannot follow a route defined by ground navigation aids"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, charts 10-2J, 13-2\nAn aircraft is flying on airway A-34 to Alicante (LEAL) and arrives at MAGAL for an approach to runway 10. What is the distance from the IAF to the runway threshold?",
    "feedback": "25.5 NM"
  },
  {
    "question": "Refer to Jeppesen GSPRM Alicante, charts 10-2B, 10-2G:\nYou are going to arrive at Alicante (LEAL) via waypoint CALLES at 17:00 local time. Which of the following STARs is to be expected when runway 10 is in use?",
    "feedback": "CALLES 1L"
  },
  {
    "question": "A pilot of a commercial air transport operations company is planning to conduct an IFR flight from departure aerodrome A, where a VOR approach can only be conducted with visibility below the landing minima, to a destination aerodrome B above the planning minima, but in IMC. Which considerations must be taken into account by the pilot during the pre-flight planning procedure, so as to determine the minimum fuel required, regarding that the above forecast conditions at both aerodromes are expected to remain the same?",
    "feedback": "The pilot must select a take-off alternate aerodrome, which could be the destination aerodrome if operational minima permit, avoiding the need for additional fuel"
  },
  {
    "question": "What is the temperature deviation (°C) from ISA over 50° N 010°E ?",
    "feedback": "+2"
  },
  {
    "question": "For pre-flight planning purposes what is the required fuel for a VFR commercial air transport flight with reciprocating engines?\n(assume the Basic Fuel Scheme without variations applies)\nFuel flow: 120 kg/hTrip time: 4 h 39 minNo alternate selected and good weather expectedExtra fuel: 0 kgDiscretionary fuel: 0 kg",
    "feedback": "706 kg"
  },
  {
    "question": "Given the following information for a commercial air transport flight, what is the time (in minutes) needed from the destination to the alternate aerodrome? Assume an operation with a Performance Class A aeroplane applying the Basic Fuel Scheme or with a helicopter (basic fuel planning provisions are the same).\nMissed approach at the destination: 6 minClimb to cruise level: 8 minCruise distance: 75 NMCruise TAS: 145 ktHeadwind: 10 ktAnticipated hold at the alternate: 12 minDescent to the alternate: 7 minApproach to the alternate: 6 min",
    "feedback": "72 min"
  },
  {
    "question": "Given the following information: \nEDDF (FRANKFURT MAIN)SCHEDULE: DAILY 2200-0400RWY 07R/25L CLSD, NOTAM ED/A0675/16RWY 25L TDZ SLIPPERY WHEN WET NOTAM ED/A0588/16END OF BULLETIN\nWhen can RWY 07R/25L be expected to be operational?",
    "feedback": "Daily from 0400 to 2200"
  },
  {
    "question": "The wind velocity over Italy is",
    "feedback": "a maximum of 110 kt at FL 380"
  },
  {
    "question": "Given:\nFuel flow: 200 l/hourFuel at take-off: 500 lReserve: 30 minutes\nCalculate the time to be entered in an ATS flight plan, item 19, (supplementary information):",
    "feedback": "0230"
  },
  {
    "question": "Aberdeen (Dyce) Aera Chart: What ATIS frequencie(s) is/are available when on the ground?",
    "feedback": "114.30 or 121.85"
  },
  {
    "question": "Which of the following RNP Approaches (RNP APCH) are approaches without vertical guidance?\n1) LNAV2) LPV3) LNAV/VNAV4) LP",
    "feedback": "1, 4"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(HI)6\nThe appropriate ATC frequency on airway UM606 overhead MANAG at FL230 (N48°06.2' E005°10.0') is:",
    "feedback": "134.960 MHz"
  },
  {
    "question": "What is an advantage of using GNSS/FMC equipment in flight?",
    "feedback": "Additional aeronautical information can be stored in the database"
  },
  {
    "question": "Aberdeen (Dyce) Aera Chart: What is the ATIS frequency that may not be used when in flight?",
    "feedback": "121.85"
  },
  {
    "question": "Refer to Jeppesen GSPRM - VFR Chart ED-4\nFind the magnetic track for a flight from Freistadt/Austria (LOLF, N48°30.9' E014°24.5') to Fürstenzell/Germany (EDMF, N48°31.1' E013°20.8'):",
    "feedback": "267°"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1 Paragraph 5.1 and Figure 4.5.1) Planning an IFR-flight from Paris to London for a twin jet aeroplane.  Given: Estimated Take-off Mass (TOM) 52000 kg, Airport elevation 387 ft, FL 280, W/V 280°/40 kt, ISA-Deviation -10°C, Average True Course 340°  Find: Ground distance to the top of climb (TOC)",
    "feedback": "50 NM"
  },
  {
    "question": "(For this Question use MRJT1 Long Range Cruise Simplified Flight Planning)\nFor a flight of 2800 ground nautical miles the following apply :\nTail wind component                 45kt\nTemperature                         ISA - 10°C\nCruise altitude                     29000ft\nLanding mass                        55000kg\nThe (a) trip fuel (b) trip time respectively are :",
    "feedback": "(a) 17100kg\n(b) 6hr 07 min"
  },
  {
    "question": "Refer to Jeppesen GSPRM, Alicante charts 10-2A, 10-2B, 10-2C, 10-2D\nThe following routing is planned between Manchester aerodrome (EGCC) and Alicante aerodrome (LEAL):\nEGCC/23R  SANBA 1R  SANBA  N859  HON  UN859  BALAN  UL152  MAKOX  UN860  VLC  LEAL/10\nWhich Alicante (LEAL) chart will show an appropriate STAR to use in order to program the navigation system with a sensible arrival  prior to departing EGCC?",
    "feedback": "10-2B"
  },
  {
    "question": "An IFR flight is planned across terrain, where the maximum elevation is 5880 ft. The forecast temperature is ISA -18°C and the minimum obstacle clearance required is 2000 ft. A nearby aerodrome (elevation 2075 ft) reports a QNH of 1003 hPa.\nWhat is the minimum flight level that could be planned for the cruise?",
    "feedback": "FL 90"
  },
  {
    "question": "The use of GPS and FMC have made the process of IFR navigation much easier. Some of the advantages these systems can provide are:\n1) Automatic calculation and display of tracks and leg distances2) Additional information such as minimum altitudes and approach procedures3) Estimation of times and fuel at each waypoint entered into the system4) Accurate time and fuel revisions based upon predicted and actual wind\nThe combination regrouping all of the correct statements is:",
    "feedback": "1, 2, 3, 4"
  },
  {
    "question": "For pre-flight purposes, what is the total fuel required for the commercial air transport flight in a Medium Range Jet Transport MRJT aeroplane, with no destination alternate, given the following information?\n(assume the Basic Fuel Scheme without variations applies)\nEstimated taxi time: 10 minutes at both departure and destination aerodromesAPU fuel flow: 115 kg/hTaxi fuel flow: 11 kg/minPlanned APU usage at the parking position: ZeroTotal trip distance: 748 NMAverage fuel flow: 2618 kg/hTAS: 421 ktHead wind component: 24 ktContingency fuel: 5% of the trip fuelAlternate fuel: 550 kgHolding fuel flow: 2250 kg/h Extra fuel: 0 kgDiscretionary fuel: 0 kg",
    "feedback": "6965 kg"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1, figures 4.5.2, 4.5.3.3)\nGiven: \nDistance B - C :                 800 NM\nCruise Mach 0.78 at FL300\nTemperature :                    - 55°C\nHeadwind component :             50 kt\nGross mass at B :                64 500 kg\n\nThe fuel required from B - C is:",
    "feedback": "6000 kg"
  },
  {
    "question": "Given the following information for a commercial air transport operation, calculate the maximum possible extra fuel, including any fuel penalty that can be uplifted.\nMaximum take-off mass: 233000 kgMaximum landing mass: 182000 kgMaximum zero fuel mass: 170000 kgDry operating mass: 122550 kgTraffic load: 43217 kgPlanned take-off fuel: 51616 kgTrip fuel: 45854 kgTaxi fuel: 300 kgMax. fuel tank capacity: 110000 kg\nFuel penalty: 394 kg/1000 kg of extra fuel",
    "feedback": "14597 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(HI)3\nGiven: Leg INSOB (N60°51.3 E021°00.1') to AMUPO (N61°10.0 E022°38.3')\nFind: route designator and total distance.",
    "feedback": "L87, 51 NM"
  },
  {
    "question": "Planned and actual data as shown in the Flight Log excerpt (Fuel Planning Section).\n\nAfter a balked landing at the destination airport, you have to divert to the alternate airport with the gear extended. The re-calculated flight time to the alternate due to the reduced speed is 1h 50 min and the fuel flow will be 840 kg/h. \nFinal Reserve Fuel remains unchanged.\nWhat will be the estimated landing mass at the alternate airport?",
    "feedback": "5890 kg"
  },
  {
    "question": "(For this question use Flight Planning Manual MRJT 1 Figure 4.3.3C)\nGiven: ground distance to destination aerodrome 1 600 NM; headwind component 50 kt;  FL 330; cruise 0.78 Mach; ISA + 20 ° C; estimated landing weight 55000 kg .\nFind: simplified flight planning to determine estimated trip fuel and trip time.",
    "feedback": "12 400 kg.  03h 55 min"
  },
  {
    "question": "Refer to Jeppesen GSPRM, chart Aberdeen 10-1R\nWhat is the Radar Minimum Altitude for an aircraft on a magnetic bearing of 100° from the Aberdeen aerodrome (EGPD) and at a distance of 13 NM from the aerodrome?",
    "feedback": "2500 ft"
  },
  {
    "question": "Refer to Jeppesen GSPRM, chart ED-4\nAs you approach Linz Airport from the North, what is the best visual aid to use just before entering the Linz TMA?",
    "feedback": "Lighted mast (3547 ft)"
  },
  {
    "question": "Select the correct answer from the statements below:\n1) A two-dimensional (2D) instrument approach operation uses lateral navigation guidance only2) A three-dimensional (3D) instrument approach operation uses both lateral and vertical navigation guidance",
    "feedback": "1) and 2) are correct"
  },
  {
    "question": "Assuming an average fuel flow of 2790 kg/h, complete the fuel log and determine the block fuel required by a jet aircraft to perform the commercial air transport flight.",
    "feedback": "5020 kg"
  },
  {
    "question": "What is SLOP?",
    "feedback": "Strategic offset flying, 1 or 2 NM right of track"
  },
  {
    "question": "A turbojet aeroplane flies using the following data:\nFL330\ncruise speed Long Range (LRC)\nmass: 156 500 kg\ntailwind component at this level: 40 kt\n\nWith a remaining flight time of 1 h 10 min the ground distance that can be covered by  the aeroplane at cruising speed is:",
    "feedback": "539 NM"
  },
  {
    "question": "(for this question use MRJT1, Figures 4.7.1a and 4.7.1b)\nYou have an engine failure and a decompression at the same time. Your data are:   Tailwind: 25 kts Distance to diversion airport: 820 NM ISA: +10°C Weight: 55’000 kg Icing conditions: YES  What is your diversion fuel?",
    "feedback": "8200 kg"
  },
  {
    "question": "An aircraft planning to fly a total distance of 460 NM, after flying for 1 hour 09 minutes it covers 178 NM and its actual fuel remaining is 1019 litres. Given the following information and assuming that the actual fuel consumption remains at the same rate, what will be the actual fuel remaining at destination?\nAverage TAS: 145 ktAverage wind component: 25 kt headwindTrip fuel: 1350 litresPlanned average fuel flow: 360 litres/h",
    "feedback": "342 litres"
  },
  {
    "question": "Refer to Jeppesen GSPRM, chart ED-4\nWhat is the True Course and distance for a direct flight from Scharnstein aerodrome (LOLC N47°54' E013°56') to Trieben aerodrome (LOGI N47°30' E014°30')?",
    "feedback": "137°, 33 NM"
  },
  {
    "question": "Aberdeen (Dyce) Aera chart: What is the elevation of the highest ground within the boundary of Aberdeen Control Zone?",
    "feedback": "1733 ft"
  },
  {
    "question": "Given the following data, what will be the flight time to the destination?\nTime to TOC: 30 min.Average headwind in the cruise: 25 ktCruise leg: 740 NGMTAS: 460 ktLevel: FL380Temperature: ISA -10°CTime from TOD to landing: 22 min.",
    "feedback": "2 h 34 mins"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Amsterdam, chart 16-2\nWhat is the MDH for the NDB approach to runway 18C?",
    "feedback": "702 ft"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(HI)4\nThe identifier of the radio navigation aid or waypoint at N54°04.2' E022°54.0' is:",
    "feedback": "SUW"
  },
  {
    "question": "You are to determine the maximum fuel load which can be carried in the following conditions :\n\n- dry operating mass : 2800 kg\n- trip fuel : 300 kg\n- payload : 400 kg\n- maximum take-off mass : 4200 kg\n- maximum landing mass : 3700 kg",
    "feedback": "800 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Amsterdam, chart 16-2\nWhat is the visibility limit for a circle-to-land manoeuvre when flying at 185 kts, in a category B aircraft?",
    "feedback": "3600 m"
  },
  {
    "question": "For pre-flight planning purposes what is the required take-off fuel for a 2 hour commercial air transport flight with a turbine engine jet aircraft? \n(assume the Basic Fuel Scheme without variations applies, the alternate aerodrome is within one hour of flight time from the destination aerodrome)",
    "feedback": "6560 kg"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1 Figure 4.3.1C)\n\nFor a flight of 1900 ground nautical miles the following apply :\nHead wind component       10 kt\nTemperature               ISA -5°C\nTrip fuel available       15000 kg\nLanding mass              50000kg\nWhat is the minimum cruise level (pressure altitude) which may be planned ?",
    "feedback": "17000 ft"
  },
  {
    "question": "For pre-flight planning purposes what is the required block fuel for an IFR flight with a turbine engine jet aircraft? \n(assume the Basic Fuel Scheme without variations applies)",
    "feedback": "9427 kg"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1) Given: Twin jet aeroplane, Ground distance to destination aerodrome is 1600 NM, Headwind component 50 kt, FL 330, Cruise .78 Mach, ISA Deviation +20°C and Landing mass 55000 kg Find: Fuel required and trip time with simplified flight planning",
    "feedback": "12400 kg, 04 h 00 min"
  },
  {
    "question": "Given:\nTrip fuel: 100 kgPlanned flight time: 1 hr 30 minTaxi fuel: 3 kgBlock fuel: 181 kg\nHow should endurance be shown on the flight plan?",
    "feedback": "0240"
  },
  {
    "question": "What mean temperature (°C) is likely on a course of 360° (T) from 40°N to 50°N at 020°E ?",
    "feedback": "-49"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Amsterdam, chart 10-2\nYou are approaching Amsterdam via REKKEN 2A. Which of the following stations can be used to receive an ATIS shortly before passing ARTIP?",
    "feedback": "SPL"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1, Figure 4.5.1)\nFind the climb fuel from the airport to the cruising level. Given:\nBrake release mass: 62000 kgOAT: ISA -15°CAirport elevation: sea levelCruising level: FL330",
    "feedback": "1550 kg"
  },
  {
    "question": "Weather deviation procedure in NAT: Due to CB ahead of your routing on NAT track BRAVO or ZULU you have to deviate 5 NM left of track. Which is the correct procedure?",
    "feedback": "Deviate 5 NM and inform ATC"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Appendix 2, Flight Plan\nItem 7: RYR796ZItem 8: ISItem 9: B738/MItem 10: SDGHIRWYZ/SB1Item 13: EIDW1520Item 15: N0433F370 LIFFY5A LIFFY UL975 WAL UM16 DOLAS UL603 LAMSOItem 16: EHAM0102 EBBRItem 18: EET/EGTT0009 EHAA0049\nDetermine which statement is correct regarding the flight:",
    "feedback": "The wake turbulence category is medium"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1)\nGiven: twin jet aeroplane, FL 330, Long range cruise, Outside air temperature -63°C, Gross mass 50500 kg\nFind: True air speed (TAS)",
    "feedback": "420 kt"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Nantes LFRS, chart 11-2A  The height indicated by the radio altimeter at DA for a CAT II equipped aircraft is:",
    "feedback": "115 ft"
  },
  {
    "question": "Refer to the extract of the OFP:\n\nWhat is the average fuel flow to reach the top of climb (TOC)?",
    "feedback": "12.5 t/h"
  },
  {
    "question": "Which of the following PBN approaches does the definition describe?\n\"A 3D approach with vertical guidance (APV), like a conventional ILS, but using GNSS augmented by SBAS. No barometric input is used.\"",
    "feedback": "LPV"
  },
  {
    "question": "Athinai (Hellinikon) Landing Chart: What is the position of the Aerodrome Reference Point?",
    "feedback": "37°53.8'N 23°43.7'E"
  },
  {
    "question": "A  commercial air transport flight will need to land at an alternate aerodrome. The Commander must ensure that the remaining fuel upon landing at that aerodrome is not less than the....",
    "feedback": "final reserve fuel"
  },
  {
    "question": "An aircraft on a track of 240°(M) has to overfly an obstacle of 26500 ft with a clearance of 2000 ft. The QNH is 1003 hPa and the OAT is ISA +10°C. What is the minimum flight level (FL) at which the aircraft may fly in RVSM airspace?\n(assume 1 hPa = 30 ft)",
    "feedback": "FL300"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1 Figure 4.3.1C)\n\nFor a flight of 2000 ground nautical miles, cruising at 30000 ft, within the limits of the data given, a headwind component of 25 kt will affect the trip time by approximately:",
    "feedback": "+7.6%"
  },
  {
    "question": "An aircraft has to divert to the alternate aerodrome.\nGiven:\nMissed approach at the destination: 6 minClimb to cruise level: 8 minCruise distance: 350 NMCruise TAS: 265 ktHeadwind: 15 ktDescent to the alternate: 10minApproach to the alternate: 5 min\nCalculate the time from the destination to the alternate aerodrome.",
    "feedback": "113 min"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(HI)4\nYou are flying on airway N623, your position is overhead URIDO (N56°16.8' E024°31.0') at FL 330 on a heading of 128°(M). What is an appropriate ATC frequency at this point?",
    "feedback": "VILNIUS, 133.305 MHz"
  },
  {
    "question": "For a planned flight the calculated fuel is as follows:  Flight time: 2h42min The reserve fuel, at any time, should not be less than 30% of the remaining trip fuel. Taxi fuel: 9 kg Block fuel: 136 kg How much fuel should remain after 2 hours flight time?",
    "feedback": "25 kg trip fuel and 8 kg reserve fuel."
  },
  {
    "question": "Given the following information, calculate the revised estimated landing mass at the destination aerodrome.\nDOM: 9825 lbTraffic load: 2950 lbRemaining usable fuel: 1950 lbRemaining trip fuel to destination: 900 lbAlternate fuel: 475 lbFinal reserve fuel: 400 lb",
    "feedback": "13825 lb"
  },
  {
    "question": "Refer to Jeppesen GSPRM - VFR Chart ED-4\nWhat is the frequency of the Linz ATIS? (LOWL N48°15' E014°11')",
    "feedback": "128.12 MHz"
  },
  {
    "question": "Refer to Jeppesen GSPRM - London Heathrow EGLL, chart 11-1  The Decision Altitude (DA) for an ILS straight-in landing is:",
    "feedback": "279 ft"
  },
  {
    "question": "Determine the amount of final reserve fuel (FINRES) for the commercial air transport jet aircraft.",
    "feedback": "1174 kg"
  },
  {
    "question": "During the planning stage of a flight to Paris Charles de Gaulle Airport, France, you note the following NOTAM:\nQ) LFFF / QGWAU/I/BO/AE/000/999/490/4901N00232E250A) LFPG B) 1910061815 C) 1910062315E) BASIC GNSS UNAVBL SBAS UNAVBL GBAS UNAVBL\nWhat is the time period when GNSS is not available?",
    "feedback": "6 October from 1815 UTC to 2315 UTC"
  },
  {
    "question": "(For this Question use Flight Planning & Monitoring SEP1, Fig. 2.4) Given: Aeroplane mass at start-up 3663 lbs, Aviation gasoline (density 6 lbs/gal)-fuel load 74 gal, Take-off altitude sea level, Headwind 40 kt, Cruising altitude 8000 ft, Power setting full throttle 2300 RPM 20°C lean of peak EGT Calculate the range.",
    "feedback": "633 NGM"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1 Fig. 4.2) Find the SHORT DISTANCE CRUISE ALTITUDE for the twin jet aeroplane. Given: Brake release mass=45000 kg, Temperature=ISA + 20°C, Trip distance=50 Nautical Air Miles (NAM)",
    "feedback": "10000 ft"
  },
  {
    "question": "(For this Question use Flight Planning Manual SEP 1, Fig. 2.2 Table 2.2.3) With regard to the cruise performance chart for the single engine aeroplane determine the cruise TAS, given: OAT ISA - 10°C Cruising pressure altitude 8000 ft Power setting 23 In.Hg/2300 RPM Mixture best performance Flaps up Gear retracted",
    "feedback": "160 kt"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Stuttgart, chart 11-1\nThe lowest published authorised RVR for an ILS approach, glide slope out, aeroplane category A, is:",
    "feedback": "1500 metres, for aircraft up to 5.7 mt MTOW only"
  },
  {
    "question": "(For this Question use Flight Planning Manual SEP 1, Table 2.2.3)\n\nOn a standard day what is the TAS and fuel flow in USG at 10000 ft?",
    "feedback": "157 kts, 11.0 GPH"
  },
  {
    "question": "VFR directory for the Netherlands: What is the local time (LT) in the Netherlands in (i) Winter and (ii) Summer?",
    "feedback": "(i) LT - 1 hour = UTC (ii) LT - 2 hours = UTC"
  },
  {
    "question": "(for this question use Flight Planning Manual MRJT1, Figure 4.5.3.1)\nGiven the following information, what is the trip fuel for a commercial air transport operation?\nPressure altitude: 32000 ftCruise procedure: Long rangeGround distance: 300 NMHWC: 25 ktOAT: ISAMass at start: 40000 kg",
    "feedback": "1481 kg"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1) For a flight of 2800 ground nautical miles the following apply : Head wind component: 20 kt Temperature: ISA + 15°C Brake release mass: 64700 kg The (a) trip fuel, and (b) trip time respectively are :",
    "feedback": "(a) 17000 kg (b) 6hr 45 min"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Charts E(LO)1 and E(LO)2\nYou are flying on airway N560 from RIMOL (N57°32' W004°03') to GLASGOW (GOW, N55°52' W004°27'). Shortly before approaching GOW you are on radial:",
    "feedback": "010° GOW"
  },
  {
    "question": "The commander of a commercial air transport flight is required to carry out in-flight fuel checks at regular intervals. The fuel must be managed so that the expected usable fuel remaining on arrival at the destination aerodrome, which is planned with a destination alternate, is not less than the required ....",
    "feedback": "alternate fuel plus final reserve fuel"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1, Figure 4.4) Given: twin jet aeroplane, Estimated mass on arrival at the alternate 50000 kg, Estimated mass on arrival at the destination 52525 kg, Alternate elevation MSL, Destination elevation 1500 ft Find: Final reserve fuel and corresponding time",
    "feedback": "1180 kg, 30 min"
  },
  {
    "question": "Which describes the maximum intensity of icing, if any, at FL180 in the vicinity of CASABLANCA (33°N 008°W) ?",
    "feedback": "Severe"
  },
  {
    "question": "(For this Question use Planning MRJT1, Figures 4.5.2 and 4.5.3.1)\nWhat is the fuel required using the LRC procedure? Given:\nAeroplane gross mass at top of climb: 61500 kgDistance to be flown: 385 NM at FL350OAT: -54ºCWind component: 40 kts tailwind",
    "feedback": "2150 kg"
  },
  {
    "question": "Given:\nMOCA: 3950 ftCruising level: FL050OAT: ISA -15°CQNH: 1004 hPaAerodrome elevation: 1340 ft\nWhat is the true altitude to make sure that the Minimum Obstacle Clearance Altitude (MOCA) is maintained?",
    "feedback": "4530 ft"
  },
  {
    "question": "The maximum altitude that may be used to transit the whole VFR corridor from REUS to SAN CELONI is:",
    "feedback": "2000 ft"
  },
  {
    "question": "Refer to Jeppesen GSPRM, chart E(LO)2\nDuring an IFR flight you are passing the non-compulsory reporting point TULIP, and your planned route is along airway P1 in a northerly direction. You accidentally change the communication frequency and you have to use the chart to find the correct frequency which you have used before. Which of the following stations and frequencies is the correct one?",
    "feedback": "AMSTERDAM 125.75 MHz"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1) For a flight of 2400 ground nautical miles the following apply : Tail wind component 25 kt Temperature ISA -10°C Cruise altitude 31000ft Landing mass 52000kg The (a) trip fuel and (b) trip time respectively are :",
    "feedback": "(a) 14200kg (b) 5 hr 30 min"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)2\nWhat is the true track between waypoints GASKO and OBOXA, north of POLE HILL 112.1 POL (N53°45' W002°06')?",
    "feedback": "148°"
  },
  {
    "question": "(For this question use Flight Planning Manual MRJT 1 Figure 4.4)\n\nThe final reserve fuel taken from the HOLDING PLANNING table for the twin jet aeroplane is based on the following parameters:",
    "feedback": "pressure altitude, aeroplane mass and flaps up with minimum drag airspeed"
  },
  {
    "question": "On the ground in ZRH the APU on your B737-300 cannot be started. Can you accept the aircraft for an ETOPS flight?",
    "feedback": "No"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)2\nAn aircraft flies from FLEVO (N52°25' E005°35') to LONAM (N53°50' E003°57'), routing via SPIJKERBOOR 113.3 SPY (N52°33' E004°52').\nDuring the flight, the Special Use Airspaces EH(D)06, EH(D)09, and EH(D)41C are crossed. EH(R)8 and EH(R)8a are close by. There are no NOTAMS in force and ATS have not issued any notification of airspace activation.\nWhat is the lowest continuous FL that can be planned to fly the route at 0900 UTC?",
    "feedback": "FL100"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1) The aeroplane gross mass at top of climb is 61500 kg. The distance to be flown is 385 NM at FL 350 and OAT -54.3 °C. The wind component is 40 kt tailwind.Using long range cruise procedure what fuel is required?",
    "feedback": "2150 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Nantes/Atlantique, charts 10-3D, E(LO)4 and E(HI)5\nYou are cleared for the RIMON 3S departure followed by R66 / UM616. Your cruising level is FL280. QNH is 997 hPa. After departure from RWY21 you cross LULID at an altitude of 620 ft. You climb at an average TAS of 220 KT and ROC 2300 fpm. You experience a mean headwind of 28 KT during the climb.\nWhere will you reach your cruising level?",
    "feedback": "1.6 NM after RIMON"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1 Figure 4.7.3)\nGiven:\nDistance to alternate                            950 NM\nHead wind component                              20 kt\nMass at point of diversion                       50000kg\nDiversion fuel available                         5800kg\nThe minimum pressure altitude at which the above conditions may be met is :",
    "feedback": "24000ft"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, charts 19-1, 19-2, 19-3\nWhen crossing the Alicante CTR from NE1 towards SW, on a VFR flight, who should be contacted to inform about the crossing and what would be an appropriate altitude?",
    "feedback": "Valencia Control, between 4500 ft and FL75"
  },
  {
    "question": "How much is the clearance passing the highest obstacle in the following scenario? An aircraft is flying at FL170 in montainous terrain on the northern side of the Apls and the charted minimum grid-area altitude is 16200 feet.\nOutside air temperature at FL170: -29°CQNH: 1000 hPa (given from a mereorological station with an elevation of 13500 feet)(assume 1 hPa = 30 ft)",
    "feedback": "2286 ft"
  },
  {
    "question": "The flight crew has 1 hour flight time remaining of a 4 hours flight towards the destination aerodrome. The FMS displays the message DEST EFOB BELOW MIN and the Commander looks at the FMS data to see that there is an estimated 0.3 tonnes less fuel than required when arriving at the destination. Under normal circumstances for a Commercial Air Transport flight with one destination alternate nominated, what is the minimum fuel to be expected on board when arriving at the destination aerodrome?",
    "feedback": "Alternate fuel plus final reserve fuel"
  },
  {
    "question": "An airway is marked FL 80 1500 a. This indicates that:",
    "feedback": "the minimum enroute altitude (MEA) is FL 80."
  },
  {
    "question": "A repetitive flight plan (RPL) is filed for a scheduled flight: Paris-Orly to Angouleme, Paris Orly as alternate. Following heavy snow falls, Angouleme airport will be closed at the expected time of arrival. The airline decides before departure to plan a re-routing of that\nflight to Limoges.",
    "feedback": "The RPL must be cancelled for that day and a specific flight plan has to be filed."
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1 Figure 4.5.2 and 4.5.3.4)\n\nGiven : Distance B - C :           350 NM\nCruise                             300 KIAS at FL 210\nTemperature :                      - 40°C\nTailwind component :               70 kt\nGross mass at B :                  53 200 kg\nThe fuel required from B - C is :",
    "feedback": "1940 kg"
  },
  {
    "question": "Refer to GSPRM Stuttgart, charts 10-3C and 10-3P\nStuttgart Delivery has approved you to depart via the RNAV SID DKB9B. Which chart is to be used?",
    "feedback": "10-3P"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1 Figure 4.3.5)\n\nFor a flight of 3500 ground nautical miles, the following apply:\nTail wind component                  50 kt\nTemperature                             ISA +10°C\nBrake release mass               65000kg\nThe (a) trip fuel and (b) trip time respectively are :",
    "feedback": "(a) 18100 kg\n(b) 7hr 20 min"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Dubrovnik, charts 19-1, 19-2\nWhat is the distance between reporting points E5 and B2?",
    "feedback": "9 NM"
  },
  {
    "question": "What are the dimensions of runway 08/26 at Esbjerg?",
    "feedback": "2600 m x 45 m"
  },
  {
    "question": "When performing an RNP APCH to an airfield using GBAS, you can expect:",
    "feedback": "CAT I minima"
  },
  {
    "question": "An aircraft is performing a 2D (LNAV) approach under IMC to an aerodrome where the temperature is significantly different from ISA. Which of the following is correct regarding temperature corrections to the MDA?",
    "feedback": "The pilot-in-command is responsible for making a correction if the temperature is much lower than ISA"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Nantes, charts 19-1, 19-2, 19-3\nWhat risk(s) require special attention?",
    "feedback": "Runway incursions can occur, because the holding point is located at a greater distance from the runway"
  },
  {
    "question": "Except when necessary for take-off or landing, or except when specifially authorised by the Competent Authority, an IFR flight shall be flown over high terrain or in mountainous areas at a level which is at least (1) ...... above the highest obstacle located within (2) ..... of the estimated position of the aircraft.",
    "feedback": "(1) 600 m (2000 ft), (2) 8 km"
  },
  {
    "question": "Which of the following are approaches with vertical guidance (APV)?\n1) LNAV2) LPV3) LNAV/VNAV4) LP",
    "feedback": "2, 3"
  },
  {
    "question": "You are cruising at FL380 with a twin-engined jet aeroplane. Due to airspace restrictions ATC instructs you to reduce speed to Mach .753. Given the following information, what is the fuel used for the remainder of the cruise?\nDistance to top of descent: 220 NMAircraft mass: 50000 kgTAT: -42°CAverage wind component: 45 kt tailwind\nConsider a constant aircraft mass of 50000 kg for calculation purposes.",
    "feedback": "837 kg"
  },
  {
    "question": "The following is an extract from a NOTAM briefing for the planned aerodrome of destination of an IFR flight.\nB) FROM: 13/02/01  11:00  C) TO: 13/02/01  12:00E) NDB CLB 433KHZ U/S\nWhich of the following statements is completely correct?",
    "feedback": "The CLB navigation facility, a non-directional beacon, will be out of service for one hour on the 1 February 2013"
  },
  {
    "question": "An aircraft with a maximum certified take-off mass of 7500 kg is taking off and its current mass is only 6500 kg. What is the wake turbulence category of this aircraft?",
    "feedback": "Medium"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)2\nThe magnetic course from DEAN CROSS 115,2 DCS (N54°43' W003°20.4') to POLE HILL 112.1 POL (N53°44.6' W002°06.2') on airway N57 is:",
    "feedback": "145°"
  },
  {
    "question": "Which of the following statements is (are) correct with regard to computer flight plans  1. The computer takes account of bad weather on the route and adds discretionary fuel. 2. The computer calculates alternate fuel sufficient for a missed approach, climb, cruise, descent and approach and landing at the destination alternate.",
    "feedback": "Statement 2 only"
  },
  {
    "question": "For pre-flight planning purposes, what is the required trip fuel for a turbine engine aircraft?\n(assume the Basic Fuel Scheme without variations applies)\nTaxi fuel: 240 kgAPU consumption: 100 kgTake-off and climb fuel: 1550 kgCruise fuel flow: 2820 kg/hCruise time: 2 h 45 minDescent and landing fuel: 280 kgContingency fuel: 5 % or 5 minAlternate fuel: 2200 kgFinal reserve fuel: 1100 kgExtra fuel: 0 kgDiscretionary fuel: 0 kg",
    "feedback": "9585 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, charts 10-2A, 10-2B, 10-2C, 10-2D\nYou are planning a flight from Athens to Alicante. Which STAR is most applicable when choosing the arrival route for your operational flight plan to determine the flight distance and fuel requirements?",
    "feedback": "10-2C"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, chart 13-1\nWhat is the elevation of the highest manmade or natural obstacle depicted on the chart?",
    "feedback": "4252 ft"
  },
  {
    "question": "Which of the following statements is relevant for forming route portions in integrated range flight planning?",
    "feedback": "The distance from take-off up to the top of climb has to be known."
  },
  {
    "question": "Given the following information, assuming conditions stay the same, what is the ETA at DELTA?\nBETA to GAMMA distance: 60 NMActual time en-route: 30 min.Actual time of arrival at GAMMA: 1240 UTCGAMMA to DELTA distance: 34 NM",
    "feedback": "1257"
  },
  {
    "question": "Refer to Jeppesen GSPRM, chart E(LO)6:\nWhile following airways, select the shortest distance route to fly from Mallorca VOR MJV (N39°26', E002°45') to Barcelona VOR BCN (N41°18', E002°06').",
    "feedback": "MJV  A29  ADX  N861  RODRA  B28  BCN"
  },
  {
    "question": "The fuel burn off  is 200 kg/h with a relative fuel density of 0,8. If the relative density is 0,75, the fuel burn will be:",
    "feedback": "200 kg/h"
  },
  {
    "question": "Refer to the following NOTAM. Are you allowed to fly to EUAD?\nQ) EGTT/QA2CA/IV/NBO/AE/022/5 334N0021W003A) EUAD B) FROM:15/12/08 09:42 C) PERME) AERODROME ATZ ACTIVE PERMISSION REQUIRED 0620-0630 UTC FOR NON SKED MOVEMENTS. EUAD AD 23 and AD 2.17 REFER",
    "feedback": "Yes, you can fly to EUAD at any time after 0630 UTC, even though the airfield is open at 0620"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1) Find: Time, Fuel, Still Air Distance and TAS for an enroute climb 280/.74 to FL 350.  Given: Brake release mass 64000 kg, ISA +10°C, airport elevation 3000 ft",
    "feedback": "26 min, 1975 kg, 157 Nautical Air Miles (NAM), 399 kt"
  },
  {
    "question": "Refer to Jeppesen GSPRM, chart Alicante 10-2C\nThe crew of an aircraft inbound to Alicante is given clearance for an arrival via the GERVU 1M STAR.\nThe GERVU 1M ....",
    "feedback": "can be flown with conventional instruments because all waypoints can be identified"
  },
  {
    "question": "(For this Question use Flight Planning & Monitoring SEP1, Fig. 2.5) For a flight departing from MSL at 3663 lbs, cruising at FL80 at 2300 RPM, 20°C lean of peak EGT, in 40 kts headwind, calculate endurance:",
    "feedback": "5.3 hrs"
  },
  {
    "question": "The following data for a flight leg from A to B is given:\nDistance: 300 NMWind (T): 340/40Magnetic course: 300°Variation: 20°ETAS: 440 kt\nDetermine the flight time for this leg.",
    "feedback": "45 min"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1, Figure 4.5.1)\nAn aircraft climbs out from an aerodrome at MSL to FL250, under ISA +20°C conditions. If the brake release weight is 60000 kg, what is the fuel and ground distance covered with a 40 kts tailwind?",
    "feedback": "1300 kg, 81 NGM"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Aberdeen, chart 10-3\nAfter departure from RWY 16 you follow the departure VIA PTH. Variation is 02° W. QNH is 997 hPa. You overfly LAVTI at 2950 ft and continue your climb to your cruising level of FL260. Your average TAS in the climb is 165 KT and you climb at an average ROC of 1850 fpm. The mean wind during your climb is 280°/25 KT.\nWhere will you reach your cruising level?",
    "feedback": "21.4 NM before PTH"
  },
  {
    "question": "(for this question use Flight Planning Manual MRJT1, Figure 3.1)\nGiven the following information, what is the total taxi fuel required for a commercial air transport flight?\nPlanned APU usage at the parking position: 25 minutes prior to taxiPlanned taxi time: 10 minutes at the departure aerodrome and 5 minutes at the destination aerodrome",
    "feedback": "158 kg"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1 Figure 4.3.1C))\n\nGiven:\nDiversion distance                      2400 NM\nWind component                          25 kt tailwind\nTemperature                             ISA - 10°C\nCruise altitude                         31000 ft\nLanding mass                            52000 kg\nThe approximate (a) trip fuel and (b) trip time are respectively:",
    "feedback": "(a) 14100kg\n(b) 5h 28min"
  },
  {
    "question": "In the ATS flight plan item 15, when entering a route for which standard departure (SID) and standard arrival (STAR) procedures exist :",
    "feedback": "both should be entered in the ATS plan where appropriate"
  },
  {
    "question": "Refer to Jeppesen GSPRM - London Heathrow, chart 10-9B\nHow many de-icing areas are available at London Heathrow and on which chart are the de-icing areas depicted?",
    "feedback": "4, 10-9G"
  },
  {
    "question": "For a turbojet aeroplane flying with a mass of 190 000 kg, at Mach 0.82, and knowing that the temperature at flight level FL 370 is - 35° C, the optimum flight altitude calculated is:",
    "feedback": "37400 ft"
  },
  {
    "question": "(for this question use Flight Planning Manual, MRJT1, Figure 4.5.3.1)\nAn aircraft with a mass of 46500 kg is flying in long range cruise at FL280, under ISA conditions. The tailwind experienced during the flight decreases from 25 kt to 10 kt. What will be the impact on ground distance covered per 1000 kg of fuel burnt?",
    "feedback": "Decreases by 7 NM"
  },
  {
    "question": "Which of the following statements are correct interpretations regarding instrument approaches?\n1) APV SBAS is an approach with geometric vertical guidance flown to the LPV DA/H supported by satellite-based augmentation systems, such as EGNOS2) An APV is an instrument approach procedure which is required to meet precision approach standards3) Cat III C is an ILS approach with no decision height and no runway visual range limitations (special authorization required)4) A 3 D instrument approach uses lateral navigation guidance only\nThe combination regrouping all of the correct statements is:",
    "feedback": "1, 3"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Aerodrome Directory\nWhich of the following is correct for AJACCIO (Napoleon Bonaparte) LFKJ aerodrome for a planned landing at 2130LT?",
    "feedback": "100LL and Jet A-1 fuel is available on request (2 hours in advance)"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(HI)1\nThe direct distance from TIREE 117.7 TIR (N56°29.6' W006°52.5'W) to ABERDEEN 114.3 ADN (N57°18.6' W002°16.0) is:",
    "feedback": "156 NM"
  },
  {
    "question": "In the ATS flight plan Item 19, if the number of passengers to be carried is not  known when the plan is ready for filing :",
    "feedback": "\"TBN\" (to be notified) may be entered in the relevant box"
  },
  {
    "question": "Which person is entitled to require the uplift of discrectionary fuel (formerly known as extra fuel)?",
    "feedback": "The commander"
  },
  {
    "question": "Given the following planning data, calculate the maximum possible extra fuel in kg, including any fuel penalty that can be uplifted.\nMaximum ramp mass: 77500 kgMaximum take-off mass: 77000 kgMaximum landing mass: 66360 kgMaximum zero fuel mass: 62720 kgDry operating mass: 42845 kgTraffic load: 17460 kgPlanned take-off fuel: 10365 kgTrip fuel: 7890 kgTaxi fuel: 195 kgMax. fuel tank capacity: 14000 kg\nFuel penalty: 135 kg/1000 kg of extra fuel",
    "feedback": "3440 kg"
  },
  {
    "question": "The planned flight is over a distance of 440 NM. Based on the wind charts at altitude the following components are found: FL50: -30kt; FL100: -50kt; FL180: -70kt. Refer to the details of the aircraft's performance below.  Which of the following flight levels (FL) gives the best range performance?",
    "feedback": "FL 180"
  },
  {
    "question": "(for this question use MRJT1, figure 4.8.2)\nThe surplus burn-off for tankering fuel is 20%. If the price at the departure airfield is 100 cents/gallon, what is the break-even price at the destination airfield?",
    "feedback": "125 cents/gallon"
  },
  {
    "question": "For pre-flight planning purposes, what is the minimum ramp fuel load for the commercial air transport flight with a jet aeroplane, given the following information?\n(assume the Basic Fuel Scheme without variations applies)\nStandard taxi fuel: 600 kgAverage cruise consumption: 10000 kg/hHolding fuel consumption at 1500 ft above alternate airfield: 8000 kg/hFlight time from departure to destination: 6 hoursFuel for diversion to alternate: 10200 kgExtra fuel: 0 kgDiscretionary fuel: 0 kg",
    "feedback": "77800 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Appendix 2, Flight Plan\nItem 9: A332/HItem 10: SDGIRWYZ/SB1Item 13: EDDF1420Item 15: N0379F230 DIK2S DIK UN857 TOLVU/N0387F250 UN857 RAPOR/N0410F280 UN 857 RENSA/N0435F330 UN857 NITEP/N0440F360 UN857 GIMER UT 300 PON UN872 ATLEN/N0452F380 DCT ABUPI DCT XAMAX DCT SRA DCT DEKUS DCT BEXAL UN866 KONBAItem 16: GCTS0425 GCXOItem 18: EET/EBUR0010 LFFF0017 LECM0137 LPPC0202 GMMM0300 GCCC0350\nChoose a correct statement with reference to the above flight plan data:",
    "feedback": "The departure route leads to radio navigation aid DIK"
  },
  {
    "question": "The following data for a flight leg from 'A' to 'B' is given:\nDistance = 300 NMWind (true) = 340/40Magnetic course = 300°Variation = 20°ETAS = 440 kt\nDetermine the flight time for this leg.",
    "feedback": "45 min."
  },
  {
    "question": "(for this question use Flight Planning Manual MRJT1, Figure 4.4)\nGiven the following information, find the final reserve fuel for a commercial air transport flight with a twin-jet aeroplane to a destination (DEST) having one destination alternate (ALTN) required.\nEstimated landing mass at DEST: 60000 kgAlternate fuel: 3000 kgDEST elevation: 0 ftALTN elevation: 3500 ftISA conditions",
    "feedback": "1290 kg"
  },
  {
    "question": "Given the following information, calculate the change in planned trip fuel when applying the updated meteorological conditions. Round up the calculation to the next full kilogram.\nTrip distance: 150 NAMPlanned TAS: 150 ktChange TAS: 1 kt for every 1°C change in OATPlanned average trip fuel consumption: 3 kg/NAMChange of trip fuel required: 0.5% increase for every 10°C increase in OATRevised OAT: 10°C above planned OAT\nThe change in trip fuel will be ....",
    "feedback": "an increase of 3 kg"
  },
  {
    "question": "Given: . Take-off mass: 150 000 kg . Planned cruise at FL 350 . Long range MACH . Standard Atmosphere (ISA) . CG: 37 % Covering an air distance of 2 000 NM, your trip fuel from take-off to landing will be:",
    "feedback": "22 360 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM - VFR Chart ED-4\nWhat is the magnetic course from WALDA 112.80 (WLD, N48°35' E011°08') to MUNICH 112.3 (MUN, N48°11' E011°49')?",
    "feedback": "129°"
  },
  {
    "question": "Considering the following NOTAM, which of the following statements is correct?\nQ) EGTT/QNMAS/IV/BO/E/000/999/5129NO0113WO25B) FROM: 16/04/29 09:59С) ТО: 16/05/27 18:00E) COMPTON DVOR \"CPT\" FREQ 114.35 MHZ/COMPTON DME \"CPT\" CHANNEL 09OY BOTH U/S. PLEASE NOTE BETWEEN 03 MAY AND 12 MAY DUE TO TEST ACTIVITIES TAKING PLACE AT COMPTON, DVOR TEST VOICE MESSAGES MAY BE TRANSMITTED FOR SHORT PERIODS ON THE CPT DVOR FREQUENCY (114.35 MHZ). IF SUCH TRANSMISSIONS ARE INTERCEPTED BY AIRSPACE USERS THE CONTENT OF THESE MESSAGES SHOULD BE IGNORED",
    "feedback": "CPT DVOR/DME is unserviceable during the stated period"
  },
  {
    "question": "Your aircraft is approved for MNPS and RVSM. What do you have to insert in item 10 of the ATC flight plan?",
    "feedback": "W, X"
  },
  {
    "question": "From the options given below select those flights which require flight plan notification:  I - Any Public Transport flight. 2 - Any IFR flight 3 - Any flight which is to be carried out in regions which are designated to ease the provision of the Alerting Service or the operations of Search and Rescue. 4 - Any cross-border flights 5 - Any flight which involves overflying water",
    "feedback": "2+4"
  },
  {
    "question": "You are flying with a GS of 120 kts. During your last check 29 minutes ago, you were on your planned track. Now you find yourself off track by 2.20 NM. How many degrees are you off track?",
    "feedback": "2.17°"
  },
  {
    "question": "(For this Question use Flight Planning & Monitoring SEP1 Fig. 2.2) Given: FL 70 OAT -19°C Lean mixture 23.0 in.Hg (or full throttle) at 2300 RPM   Find the fuel flow in gallons per hour (GPH) and TAS.",
    "feedback": "12.35 GPH TAS: 159 kt"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(HI)7\nAn aeroplane has to fly from SPIJKERBOOR (SPY N52°32.4' E004° 51.2') to REKKEN (N52°08.0' E006°45.8'). Which statement is correct ?",
    "feedback": "The airway UP199 cannot be used, there is one way traffic to the west."
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, charts 19-1, 19-2, 19-3\nWhat is the maximum permissible altitude at reporting point NE?",
    "feedback": "2000 ft AMSL"
  },
  {
    "question": "With reference to the NOTAM excerpt below, when can runway 07L be expected to be in operation?\nDUE WIP RWY 07R/25L CLSD 18 DEC TIL 11 JAN RWY 07L/25R AVBL 0600 TIL 2200 EXC FM 24 TIL 26 DEC",
    "feedback": "January 11th, 0600 UTC"
  },
  {
    "question": "For pre-flight planning purposes, what is the minimum take-off fuel required for the commercial air transport flight in an MRJT aeroplane, given the following information? The operator has nominated a suitable en-route alternate aerodrome.\n(assume the Basic Fuel Scheme without variations applies)\nEstimated flight time: 03:57Estimated flight time to alternate: 00:20Average fuel flow: 2856 kg/hHolding fuel flow: 2600 kg/hExtra fuel: 0 kgDiscretionary fuel: 0 kg",
    "feedback": "13871 kg"
  },
  {
    "question": "Given the following information, calculate the estimated landing mass at the destination for the commercial air transport flight with a Performance Class A aeroplane.\n(assume the Basic Fuel Scheme without variations applies)\nDOM: 9900 lbTraffic load: 3160 lbRemaining useable fuel: 2100 lbRemaining trip fuel to destination: 800 lbDestination alternate fuel: 485 lbFinal reserve fuel: 420 lbExtra fuel: 0 lbDiscretionary fuel: 0 lb",
    "feedback": "14360 lb"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Amsterdam, chart 11-1\nWhich of the following lighting is available for the ILS 06 approach?",
    "feedback": "High intensity approach light system"
  },
  {
    "question": "For pre-flight planning purposes, what is the required fuel for take-off for an IFR flight with a turbine engine aircraft?\n(assume the Basic Fuel Scheme without variations applies)\nTaxi fuel (with APU usage included): 120 lbClimb fuel: 420 lbCruise distance: 720 NAMCruise fuel consumption: 4 lb/NAMDescent fuel: 230 lbApproach and landing fuel: 250 lbAlternate fuel: 650 lbContingency fuel: 5 % trip fuelFinal reserve fuel: 2050 lb/hFuel for missed approach at alternate: 350 lbExtra fuel: 0 kgDiscretionary fuel: 0 kg",
    "feedback": "5644 lb"
  },
  {
    "question": "Refer to the extract of the OFP:\n\nBetween waypoint LADER and NISUN your expected fuel burn will be:",
    "feedback": "2.1 tons"
  },
  {
    "question": "The measured course 042° T. The variation in the area is 6° W and the wind is calm. The deviation card is reproduced in the annex.  In order to follow this course, the pilot must fly a compass heading of:",
    "feedback": "052°"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1 Figures 4.5.2, 4.5.3.4)\nFind the fuel required to fly from C to D given:\n\nDistance C-D:                      540 NM\nCruise                             FL210/300 KIAS\nOAT:                               ISA +20C\nHeadwind component :               50 kt\nGross mass at C:                   60 000 kg",
    "feedback": "4200 kg"
  },
  {
    "question": "Find the true altitude provided that safe altitude in respect of MOCA is maintained while cruising at FL090. Given:\nMOCA: 5600 ftQNH: 1002 hPaAirport elevation: 2480 ftOAT: ISA -10°C",
    "feedback": "8420 ft"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1)\nGiven : Brake release mass :  62 000 kg\nTemperature :                 ISA + 15°C\nThe fuel required for a climb from Sea Level to FL330 is :",
    "feedback": "1700 kg"
  },
  {
    "question": "Consider a twin engine short haul jet.\nDOM: 53000 kgNo alternate requiredHolding fuel consumption: 4000 kg/h\nDue to adverse weather, the flight crew used all the fuel initially planned for any contingencies. What quantity of fuel will remain in the tanks after landing?",
    "feedback": "3000 kg"
  },
  {
    "question": "A commercial air transport operation is to be pre-positioned to a remote operating location in mountainous terrain. The commander wishes to take as much extra fuel as possible. Given the following information, determine the maximum amount of extra fuel (including the fuel penalty) that the commander can upload.\nMTOM: 6250 lbMLM: 4500 lbZFEM: 3825 lbPlanned take-off fuel: 705 lbTrip fuel: 375 lbFuel tank capacity: 1100 lbFuel burn correction per 100 lb of extra fuel based upon TOM + 9.1 lb and LM + 10 lb",
    "feedback": "379 lb"
  },
  {
    "question": "Given:\nDry operating mass (DOM)= 33510 kg\nLoad= 7600 kg\nTrip fuel (TF)= 2040 kg\nFinal reserve fuel= 983 kg\nAlternate fuel= 1100 kg\nContingency fuel= 5% of trip fuel\nWhich of the listed estimated masses is correct?",
    "feedback": "Estimated landing mass at destination= 43295 kg."
  },
  {
    "question": "If the fuel flow in the cruise was exactly as the crew expected when planning the flight, what is the expected fuel remaining for the fuel check overhead TORDU at 19:42?(all flight logs are in kg)",
    "feedback": "263 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM - De Kooy, chart 10-9\nWhat is the appropriate frequency at the De Kooy aerodrome when the tower is closed?",
    "feedback": "132.350 MHz"
  },
  {
    "question": "for this question use GSPRM VFR chart ED-4\nAn aircraft is at 9 000 ft at position 47°30'N, 014°00'E and flies VFR towards LOXA Aigen Im Ennstal airport to land. What action must be made by the pilot when approaching LOXA airport?",
    "feedback": "Report over TRAUTENFELS on 130.000 MHz"
  },
  {
    "question": "NOTAM extract:\n\"... ILS 25C LO, IDENT FR, 297 KHZ, RANGE LIMITED TO 10NM... \"\nWhat is limited to 10 NM?",
    "feedback": "Locator"
  },
  {
    "question": "An ILS Cat I approach with a DH of 240 ft is a:",
    "feedback": "Type B 3D approach"
  },
  {
    "question": "Refer to the figure.\nReaching WPT2, you are informed that the wind has backed 20°, and the wind speed has decreased by 10 kt. What will be your expected leg time to WPT3?",
    "feedback": "25 min"
  },
  {
    "question": "The final reserve fuel for aeroplanes with turbine engines is",
    "feedback": "fuel to fly for 30 minutes at holding speed at 1500 ft (450 m) above aerodrome elevation in standard conditions."
  },
  {
    "question": "On a flight plan you are required to indicate in the box marked \"speed\" the planned speed for the first part of the cruise or for the entire cruise. This speed is:",
    "feedback": "The true airspeed"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1) Planning an IFR-flight from Paris to London for the twin jet aeroplane.  Given: Estimated Take-off Mass (TOM) 52000 kg, Airport elevation 387 ft, FL 280, W/V 280°/40 kt, ISA Deviation -10°C, Average True Course 340°  Find: Fuel to the top of climb (TOC)",
    "feedback": "1000 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM, chart ED-4\nWhat is the elevation of the highest lighted obstacle in the vicinity of an aircraft's direct route from Arnbruck (EDNB N49°7' E012°59') to Pfarrkirchen (EDNP 48°25'N 012°51'E)?",
    "feedback": "1965 ft AMSL"
  },
  {
    "question": "(For this Question use Flight Planning & Monitoring SEP1 Fig. 2.1) Given: FL 75 OAT: +5°C During climb: average head wind component 20 kt Take-off from MSL with the initial mass of 3 650 lbs. Find: Still air distance (NAM) and ground distance (NM) using the graph \"time, fuel, distance to climb\".",
    "feedback": "18 NAM. 15 NM."
  },
  {
    "question": "After flying for 16 min at 100 kt TAS with a 20 kt tail wind component, you have to return to the airfield of departure. You will arrive after:",
    "feedback": "24 min"
  },
  {
    "question": "For pre-flight planning purposes, what is the minimum fuel required for a commercial air transport flight with a jet aircraft, given the following information?\n(assume the Basic Fuel Scheme without variations applies)\nTrip fuel: 72340 kgFuel to alternate: 4589 kgTaxi fuel: 345 kgFuel flow at 1500 feet above destination alternate aerodrome: 5592 kg/hExtra fuel: 0 kgDiscretionary fuel: 0 kg",
    "feedback": "83687 kg"
  },
  {
    "question": "On a flight from Cairo to Madrid at FL 350 when Mt. Etna is not active, what sort of in-flight weather hazard might you encounter?",
    "feedback": "Moderate CAT"
  },
  {
    "question": "Athinai (Hellinikon) Chart: What is the total distance when following the VFR routing from \"Abeam Patroklos\" to Hellinikon?",
    "feedback": "19 NM"
  },
  {
    "question": "The flight crew of a turbojet aeroplane prepares a flight using the following data: - Flight leg distance: 4 000 NM - Flight level FL 310, true airspeed: 450 kt - Headwind component at this level: 50 kt - Initially planned take-off mass (without discretionary fuel on board): 170 000 kg - Fuel price: 0.27 Euro/l at departure; 0.30 Euro/l at destination To maximize savings, the commander chooses to carry discretionary fuel in addition to that which is necessary. Using the appended information, the optimum quantity of fuel which should be carried in addition to the prescribed quantity is:",
    "feedback": "8 000 kg"
  },
  {
    "question": "(for this question use Flight Planning Manual, MRJT1, Figure 4.5.3.1)\nWhat will be the approximate change in ground distance covered per 1000 kg of fuel burnt if the headwind increases from 25 kt to 35 kt?\nAircraft mass at start of cruise leg: 50000 kgCruise level: FL280, LRCISA conditions",
    "feedback": "Reduces by 4 NM"
  },
  {
    "question": "(For this question use Flight Planning Manual MRJT 1 Figure 4.5.1) Given: estimated take-off mass 57 500 kg; initial cruise FL 280; average temperature during climb ISA -10°C; average head wind component 18 kt Find: climb time",
    "feedback": "13 min"
  },
  {
    "question": "Mark the altitude which is defined as the lowest altitude between radio navigation fixes that assures acceptable navigation signal coverage and meets obstacle clearance requirements between those fixes.",
    "feedback": "Minimum En-route Altitude (MEA)"
  },
  {
    "question": "Given:\nDry operating mass (DOM)= 33510 kg\nLoad= 7600 kg\nFinal reserve fuel= 983 kg\nAlternate fuel= 1100 kg\nContingency fuel 102 kg\nThe estimated landing mass at alternate should be :",
    "feedback": "42195 kg."
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1 Figures 4.5.2, 4.5.3.4) Find the fuel required to fly from B to C given the following:  Distance B-C: 350 NM Cruise FL210/300 KIAS OAT: -40°C Tailwind component : 70 kt Gross mass at B: 53 200 kg",
    "feedback": "1940 kg"
  },
  {
    "question": "In a NOTAM, what does the abbreviation \"LO\" indicate?",
    "feedback": "Locator"
  },
  {
    "question": "(For this Question use Flight Planning & Monitoring MEP1 Fig. 3.5)\nGiven the following data:\nFL 75 Lean mixture Economy Power setting\nFind the endurance with no reserve:",
    "feedback": "05:01"
  },
  {
    "question": "Athinai (Hellenikon) Approach Chart: The frequency and ident of the DVOR/DME at the northern end of the runway at Hellinikon aerodrome is:",
    "feedback": "114.40 ATH"
  },
  {
    "question": "In the event that a controlled flight inadvertently deviates from its track given in the current ATS Flight Plan, action should be taken in order to:",
    "feedback": "Adjust the heading of aircraft to regain track as soon as possible"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(HI)2\nThe magnetic course/distance from TRENT TNT 115.7 (N53°03.2' W001°40.2') to WALLASEY WAL 114.1 (N53°23.5' W003°08.1'W) on airway UQ4 is:",
    "feedback": "293°, 56 NM"
  },
  {
    "question": "Refer to Jeppesen GSPRM - North Atlantic Plotting Chart B777\nThe distance (NM) from C (62°N020°W) to B (58°N004°E) is",
    "feedback": "750"
  },
  {
    "question": "Given the following information for a commercial air transport operation, calculate the maximum possible extra fuel, including any fuel penalty that can be uplifted.\nMaximum take-off mass: 875000 lbMaximum landing mass: 652000 lbMaximum zero fuel mass: 555100 lbDry operating mass: 394100 lbTraffic load: 155215 lbPlanned take-off fuel: 226195 lbTrip fuel: 198620 lbTaxi fuel: 1600 lbMax. fuel tank capacity: 377750 lb\nFuel penalty: 470 lb/1000 lb of extra fuel",
    "feedback": "99490 lb"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)1\nAn aeroplane has to fly from SOLA (ZOL N58°52.5' E005° 38.4') to TORP (N59° 10.1' E010°15.6). Once airborne, if approved, which of the following is an acceptable route for this flight?",
    "feedback": "ZOL M125 IDIPI PIGAV ULMUG Z132 TOR"
  },
  {
    "question": "An aircraft is performing a 2D APCH with a MDH of 350 ft. This is a ......",
    "feedback": "Type A APCH, no category"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Amsterdam, charts 10-2, 10-2A, 10-2B, 10-2C\nWhich set of Standard Arrival Routes (STAR) is most appropriate for a flight from Paris to Amsterdam?",
    "feedback": "10-2A"
  },
  {
    "question": "Select the acronym corresponding to the following definition:\n\"a special NOTAM series notifying, by means of a specific format, an important change for the aircraft operations, due to a volcano activity, a volcano eruption or a volcanic ash cloud\".",
    "feedback": "ASHTAM"
  },
  {
    "question": "Refer to the figures.\nTo avoid a turbulent area you request ATC for a clearance to climb to FL210. When you reach WPT B you are maintaining FL210 with a CAS of 160. What is the revised ETA at WPT C?",
    "feedback": "12:28"
  },
  {
    "question": "For a flight leg, the following data is assumed:\nTrue course = 130°W/V = 180/30TAS = 200 kt\nDetermine the WCA and GS of this leg.",
    "feedback": "WCA = + 7°, GS = 180 kt."
  },
  {
    "question": "A turbojet aeroplane, weighing 200 000 kg,  initiates its cruise at the optimum level at M 0.84 (ISA, CG=37%, Total Anti Ice ON). A head wind of 30 kt is experienced and, after a distance of 500 NM, severe icing is encountered and this requires an immediate descent. The aeroplane mass at start of descent is:",
    "feedback": "192 500 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM, chart E(LO)2\nOn airway N562, what is the magnetic course and distance from waypoint HERON (N55°21', W005°00') to MACRIHANISH DME MAC (N55°26', W005°39')?",
    "feedback": "287°, 23 NM"
  },
  {
    "question": "The fuel plan gives a trip fuel of 65 US gallons. The alternate fuel, final reserve included, is 17 US gallons. Contingency fuel is 5% of the trip fuel. The usable fuel at departure is 93 US gallons. At a certain moment the fuel consumed according to the fuel gauges is 40 US gallons and the distance flown is half of the total distance. Assume that fuel consumption doesn't change. \n\nWhich statement is right ?",
    "feedback": "The remaining fuel is not sufficient to reach the destination with reserves intact"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1, Figure 4.5.4a)\nA descent is planned at .74/250KIAS from 35000ft to 5000ft. How much fuel will be consumed during this descent?",
    "feedback": "150kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)2\nOn a flight on airway P600 you are passing TURNBERRY VOR (TRN, N55°19' W004°47') and intersections GIRVA, TUNSO and BLACA. What is the MEA between GIRVA and TUNSO?",
    "feedback": "FL060"
  },
  {
    "question": "You have a flight plan IFR from Amsterdam to London. In the flight plan it is noted that you will deviate from the ATS route passing the FIR boundary Amsterdam/London. The airway clearance reads: Cleared to London via flight planned route.\nWhich of the following statements is correct?",
    "feedback": "The route according to the flight plan is accepted."
  },
  {
    "question": "The Trip Fuel for a jet aeroplane to fly from the departure aerodrome to the destination aerodrome is 5 350 kg. Fuel consumption in holding mode is 6 000 kg/h. The quantity of fuel which is needed to carry out one go-around and land on the alternate airfield is 4 380 kg. The destination aerodrome has a single runway.  What is the minimum quantity of fuel which should be on board at take-off?",
    "feedback": "13 230 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)7\nWhat is the ATIS frequency at Kuusamo airport EFKS (65°59.42' E029°13.92')?",
    "feedback": "135.8"
  },
  {
    "question": "The Radio Altimeter minimum altitude for a CAT 2 ILS DME is :",
    "feedback": "100 ft"
  },
  {
    "question": "In the appropriate box of a flight plan, for endurance, one must indicate the time corresponding to:",
    "feedback": "the total usable fuel on board"
  },
  {
    "question": "Given the following information about a commercial air transport IFR flight, what is the required taxi fuel?\nExpected taxi time: 10 minAPU: On for 5 minCompany policy: For flight planning purposes, taxi fuel shall be calculated as at least 60 kg",
    "feedback": "65 kg"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1)\nPlanning an IFR-flight from Paris (Charles de Gaulle) to London (Heathrow) for the twin jet aeroplane. Given:\nEstimated Take-off Mass (TOM): 52000 kg Airport elevation: 387 ft Cruise: FL 280 W/V: 280°/40 kt ISA Deviation:  -10°CAverage True Course: 340°\nFind ground distance to the top of climb (TOC)",
    "feedback": "50 NM"
  },
  {
    "question": "For this question use CAP 697, figure 4.3.2a and Jeppesen GSPRM - Chart E(HI)2\nPlanning a flight from Paris Charles de Gaulle (N49 00.9 E002 36.9) to London Heathrow (N51 29.2 W000 27.9) for a twin - jet aeroplane. Preplanning: Powersetting: Mach= 0.74 Planned flight level FL 280 The Landing Mass in the fuel graph is 50 000 kg The trip distance used for calculation is 200 NM The wind from Paris to London is 280°/40 kt Find the estimated trip fuel.",
    "feedback": "1 740 kg."
  },
  {
    "question": "For this question use CAP 697, figure 4.3.6 and Jeppesen GSPRM - Chart E(HI)2\nPlanning a flight from Paris Charles de Gaulle (N49 00.9 E002 36.9) to London Heathrow (N51 29.2 W000 27.9) for a twin - jet aeroplane. The alternate airport is Manchester (N53 21.4 W002 15.7)  Preplanning: The wind from London to Manchester is 250°/30 kt The distance from London to Manchester is 160 NM. Assume the Estimated Landing Mass at alternate is about 50 000 kg. Find the alternate fuel and the according time.",
    "feedback": "1 450 kg and 32 minutes."
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)4\nWhich of the following statements is correct for a flight on airway M858 from URNAS (N47°00.14' E008°38.30') to CANNE (N46°10.00' E008°52.87)?",
    "feedback": "The Maximum Authorized Altitude is FL160"
  },
  {
    "question": "In the ATS flight plan Item 15 (Cruising speed), when not expressed as a Mach number, cruising speed is expressed as :",
    "feedback": "TAS"
  },
  {
    "question": "Which best describes the significant cloud forecast over TOULOUSE (44°N 001°E) ?",
    "feedback": "broken AC/CU, base below FL 100, tops FL 150, embedded isolated CB, base below FL 100, tops FL 270"
  },
  {
    "question": "Given the following NOTAM:\n>>> EDDT (BERLIN-TEGEL RWY 08RL/26RL) <<<\nDUE TO MAINT OF TGL DME THE FLW CHANGES TO MISSED APCH PROC OCCUR:RWY 08L/R:CLIMB INBOUND GL NDB (FREQ. 321.0) TO MAX. 3000. AT GL NDB CONTINUE CLIMB TO 5000 AND LT VIA LWB DVOR TO LANUM.RWY 26L/R:CLIMB INBOUND RW NDB (FREQ. 329.0) TO MAX. 3000. AT RW NDB CONTINUE CLIMB TO 4000 AND RT VIA LWB DVOR TO NASAT.REF AD 2 EDDT 4-2-1 THRU 4-2-3 AND 4-4-1 THRU 4-6-3 ALL DATED22 AUG 2013, 4-2-4 DATED 21 AUG 2 014, 4-6-4 EFF 3 JUN 2010.: NOTAM ED/A0610/16>>> END-OF-BULLETIN <<<\nWhat changes apply to the missed approach procedure for RWY 26L?",
    "feedback": "CLIMB INBOUND RW NDB (FREQ. 329.0) TO MAX. 3000"
  },
  {
    "question": "(For this question use Flight Planning Manual MRJT 1 Figure 4.5.4) Planning an IFR-flight from Paris to London for the twin jet aeroplane.  Given: Estimated Landing Mass 49700 kg, FL 280, W/V 280°/40 kt, Average True Course 320°, Procedure for descent .74 M/250 KIAS  Determine the fuel consumption from the top of descent to London (elevation 80 ft).",
    "feedback": "273 kg"
  },
  {
    "question": "In the ATS flight plan Item 10 (equipment), the letter to indicate the carriage of a serviceable transponder - mode A (4 digits-4096 codes) and mode C, is :",
    "feedback": "C"
  },
  {
    "question": "An IFR flight is planned across terrain where the maximum elevation is 5880 ft. The forecast temperature is ISA -18°C, and the Minimum Obstacle Clearance required is 2000 ft. A nearby aerodrome (elevation 2075 ft) reports a QNH of 1003 hPa.\nWhat is the minimum flight level that could be planned for the cruise?",
    "feedback": "FL90"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1 Figure 4.6.1)\nAfter suffering landing gear and pressurization problems an aircraft has to be flown with landing gear down to another airport for repairs. Given the following conditions, what is the fuel and time required for this flight?\nEstimated Landing Mass: 30000 kgCruise Level: FL100Distance: 400 NGMTemperature: ISA +20°CWind: 50 kts head",
    "feedback": "5800 kg, 2 hrs"
  },
  {
    "question": "The elevation of the departure airport is 2500 ft.\nAn aircraft has to climb to FL 105 with a rate of climb of 750 ft/min. The QNH is 995 hPa.\nDetermine the climb time",
    "feedback": "10 min."
  },
  {
    "question": "Refer to Jeppesen GSPRM, chart Alicante 10-2C\nWhat is the minimum equipment required to fly the GERVU 1M STAR procedure, referring to the BRNAV requirement?",
    "feedback": "DME, GPS or VORDME"
  },
  {
    "question": "Refer to Jeppesen GSPRM, chart E(LO)6\nYou are planning to fly from VALENCIA VOR (N39°29' W000°29') to ALMERIA VOR (N36°49' W002°15') using a conventional ATS route.\nWhich is the most acceptable route to fly if LE(R)-63 is active?",
    "feedback": "VLC-B28-VIBAS-N865-AMR"
  },
  {
    "question": "The navigation plan reads: Trip fuel: 100 kg Flight time: 1h35min Taxi fuel: 3 kg Block fuel: 181 kg The endurance on the ICAO flight plan should read:",
    "feedback": "2h 49min"
  },
  {
    "question": "Refer to Jeppesen GSPRM - North Atlantic Plotting Chart B777\nThe average true course from C (62°N020°W) to B (58°N004°E) is",
    "feedback": "109°"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)2, section 6 C\nAn aircraft flies at FL360 on a northwesterly heading, inbound TRENT VORDME (TNT). A descent should be initiated to pass waypoint ELVOS at FL200. Calculate the top of descent (TOD) relating to TRENT for a ground speed of 420 KT and a rate of descent of 2000 ft/min.",
    "feedback": "81 NM"
  },
  {
    "question": "Refer to Jeppesen GSPRM, chart E(LO)2, section 7 C:\nYou are planning a flight via airway T420, course 330°, FL360, inbound TRENT VOR/DME (TNT). The descent should be planned to pass waypoint ELVOS at FL200. Calculate the top of descent (TOD) from TRENT, if your rate of descent is 2300 ft/min and the ground speed is 345 kt, with a tailwind of 35 kt:",
    "feedback": "65 NM"
  },
  {
    "question": "For a flight from Munich to London Heathrow, alternate East Midlands, the following fuel quantities are stated:\nTrip fuel = 3800 kgContigency fuel = 230 kgAlternate fuel = 1200 kgFinal reserve fuel = 1300 kg\nDetermine the minimum fuel at the destination airport.",
    "feedback": "2500 kg."
  },
  {
    "question": "The strongest wind and its level associated with any jetstream on the chart is:",
    "feedback": "160 kt at FL 320"
  },
  {
    "question": "According to NOTAM AA1557/14, on the 31st December 2014 there were several cranes erected northeast of OMAL airport ......",
    "feedback": "at the positions indicated by the shown coordinates"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Dubrovnik, charts 19-1, 19-2\nWhat is the elevation of the highest obstacle on the chart?",
    "feedback": "5017 AMSL"
  },
  {
    "question": "Refer to Jeppesen GSPRM - VFR Chart ED-4\nVFR flight from Blaubeuren (EDMC, N048°25.18' E009°47.85') to Donaueschingen-Villingen (EDTD, N047°58.42' E008°31.33').\nWhich of the following landmarks would be suitable as a turning point in order to avoid any restricted areas?",
    "feedback": "The radio mast south of the town Balingen"
  },
  {
    "question": "Given the following planning data, calculate the maximum possible extra fuel, including any fuel penalty, that can be uplifted.\nMaximum take-off mass: 85000 kgMaximum landing mass: 75500 kgMaximum zero fuel mass: 71420 kgDry operating mass: 48000 kgTraffic load: 15464 kgPlanned take-off fuel: 5167 kgTrip fuel: 2561 kgTaxi fuel: 200 kgMax. fuel tank capacity: 23500 kg\nFuel penalty for carrying extra fuel: 54 kg/1000 kg of extra fuel",
    "feedback": "9940 kg"
  },
  {
    "question": "An aeroplane is on an IFR flight. The flight is to be changed from IFR to VFR. Is it possible?",
    "feedback": "Yes, the pilot in command must inform ATC using the phrase \"cancelling my IFR flight\"."
  },
  {
    "question": "Refer to Jeppesen GSPRM, VFR chart ED-4:\nYou are flying VFR from EDPS Sonnen (N48°41.0' E013°41.7') to EDMS Straubing (N48°54.0' E012°31.1'). What is the highest obstacle within 5 NM of your route?",
    "feedback": "3754 ft"
  },
  {
    "question": "(For this question use Fuel Planning MRJT1, Figure 4.5.3.1) An aircraft cruising at FL350 in light and variable winds turns at waypoint ALPHA weighing 53500 kg and later turns at waypoint BRAVO weighing 50200 kg. Assuming standard conditions what is the TAS, distance and specific fuel consumption between ALPHA and BRAVO?",
    "feedback": "429 kts, 627 NM, 5.26 kg/NM"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, charts 19-1, 19-2, 19-3\nAlong which route do you proceed if you experience a communication failure?",
    "feedback": "East of South Route"
  },
  {
    "question": "When an ATS flight plan has been submitted for a controlled flight, the flight plan should be amended or cancelled in the event of the off-block time being delayed by :",
    "feedback": "30 minutes or more"
  },
  {
    "question": "(for this question use CAP 697, Figure 4.5.1 (appropriate pages)\nFind the TAS for a climb to 6000 ft. The take-off weight is 44000 kg, the airport elevation is 2000 ft and the outside air temperature at 6000 ft is +8°C.",
    "feedback": "295 kt"
  },
  {
    "question": "During the validity period of the NOTAM given below, what route shall be filed in the ATS flight plan for an aircraft that is RNAV equipped and has EDDH as the destination?\nQ) EDGG/QANLC/I/NBO/E/245/660/5140N00746E020 B) FROM: 15/12/18 14:20 C) TO: 16/03/18 23:59 EST E) RNAV-ROUTE UZ907 BTN ABAMI AND OSDIK NOT AVBL FOR DEST EDDV, EDDH, EDHI, EDHL, EDHK, EDDW, EDWB, EDWE, EDWI. THESE FLIGHTS SHALL FILE ABAMI UM170 OSN.",
    "feedback": "UM170 from ABAMI to OSN"
  },
  {
    "question": "On an IFR navigation chart, in a 1° quadrant of longitude and latitude, appears the following information \"80\". This means that within this quadrant:",
    "feedback": "the minimum safe altitude is 8 000 ft"
  },
  {
    "question": "Given the following information, calculate the change in planned trip fuel when applying the updated meteorological conditions. \nTrip distance: 150 NGMPlanned TAS: 120 ktChange TAS: 2 kt increase for every 5°C increase in OATPlanned average trip fuel consumption: 3 kg/NAMChange in wind component: Increase from + 5 kt to + 10 ktChange of trip fuel required: 0.5% increase for every 10°C increase in OATRevised OAT: 10°C above planned OAT\nThe change in planned trip fuel will be ....",
    "feedback": "13.5 kg less"
  },
  {
    "question": "(for this question use Flight Planning Manual MRJT1, 3.1)\nOperating the MRJT1 aeroplane you estimate to taxi for 10 minutes before take-off and operate the APU for 20 min before take-off. How much fuel will be used for these operations?",
    "feedback": "148 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, charts 10-2D, 13-3\nAn aircraft is flying on airway A-34 to Alicante (LEAL) and arrives at MAGAL for an approach to runway 28. What is the distance from the IAF to ALICANTE VOR?",
    "feedback": "21.1 NM"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)4\nA plain language weather service on airway Z651 between DETRI (N46°36.37' E008°48.90') and KELIP (N46°57.38' E008°45.70') is available on:",
    "feedback": "127.20 MHz"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Nantes, charts 19-1, 19-2, 19-3\nHow many VFR approaches are published into Nantes?",
    "feedback": "4"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)10\nFlight from STURUP 113.0 SUP (N55°32.08' E012°22.78')  to KALMAR 111.6 KAL (N56°41.12' E016°17.05') on airway L990 between waypoints PERRY and KOTAM:",
    "feedback": "Rerouting/radar vectoring by ATC is to be expected"
  },
  {
    "question": "On a Jeppesen instrument enroute chart, a minimum off-route altitude (MORA) provides obstruction clearance of ...... on either side of the route centre line.",
    "feedback": "10 NM"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1) Given: twin jet aeroplane, Dry operating mass 35500 kg, Traffic load 14500 kg, Final reserve fuel 1200 kg, Distance to alternate 95 NM, Tailwind component 10 kt Find: Fuel required and trip time to alternate with simplified flight planning (ALTERNATE PLANNING)",
    "feedback": "1000 kg, 24 min"
  },
  {
    "question": "Refer to Jeppesen GSPRM Alicante, charts 10-3C, 10-3E\nAn aircraft is planned to depart from Alicante aerodrome (LEAL) towards the north-east. The aircraft is fully P-RNAV equipped and operational. What is a suitable SID if departing from Runway 10?",
    "feedback": "The correct answers are: MITOS 2A, SOPET 1G"
  },
  {
    "question": "What refers to the correct definition of the term \"current flight plan\" (ICAO DOC 4444)?",
    "feedback": "A flight plan including amendments and clearances"
  },
  {
    "question": "Which document provides guidance for the approval of RVSM aircraft?",
    "feedback": "EASA/JAA TGL No. 6"
  },
  {
    "question": "On an instrument approach chart, a minimum sector altitude (MSA) is defined in relation to a radio navigation facility. Without any particular specification on distance, this altitude is valid to:",
    "feedback": "25 NM"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, chart 10-3\nAfter departure from Alicante, VILNA is reached at FL80 as required. Planned cruising level is FL200. With an average rate of climb of 1200 ft/min and a ground speed of 250 KT, the cruising level will be reached:",
    "feedback": "6 NM after ASTRO"
  },
  {
    "question": "For pre-flight planning purposes, what is the total fuel required for the IFR commercial air transport flight from A to B with alternate C with a turbine engine aircraft, given the following information?\n(assume the Basic Fuel Scheme without variations applies)\nTaxi fuel: 250 kgTrip fuel: 4520 kgAlternate fuel: 236 kgFuel flow for final reserve fuel: 2510 kg/hExtra fuel: 0 kgDiscretionary fuel: 0 kg",
    "feedback": "6487 kg"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1 Figure 4.5.3.2) Planning an IFR-flight from Paris to London for the twin jet aeroplane.  Given: Gross mass 50000 kg, FL 280, ISA Deviation -10°C, Cruise procedure Mach 0.74 Determine the TAS",
    "feedback": "430 kt"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Amsterdam, chart 10-2\nAn approach is made into Amsterdam via REKKEN 2A. Which of the following procedures should be followed in case of radio communication failure?",
    "feedback": "Follow the procedures provided on the 10-1P pages of the route manual"
  },
  {
    "question": "For a repetitive ATC flight plan (RPL) to be used, flight must take place on a regular basis on at least:",
    "feedback": "10 occasions"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Dubrovnik, chart 10-3A\nAfter departure from RWY 30 you follow the LASDU 1D departure.  QNH is 1027 hPa (assume 1 hPa=27 ft). You reach 2000ft at D3.2 DBK and continue your climb to your cruising level of FL340. Your average TAS is 230 KT and you climb at an average ROC of 2150 fpm. The mean headwind component during your climb is 27 KT.\nAt what level will you cross LASDU?",
    "feedback": "FL329"
  },
  {
    "question": "A typical fuel plan with operational impact factors is shown, as produced by a flight planning tool. When arriving at the plane the commander is informed that some additional cargo has been loaded. This extra weight means that the aeroplane is unable to reach its planned cruising level. Use the data below to determine the revised trip fuel.\nCargo: +600 kgCruising level: -2000 ftCruising speed according to the flight plan",
    "feedback": "15132 kg"
  },
  {
    "question": "What is the mean temperature deviation (°C) from the ISA over 50°N 010°W ?",
    "feedback": "-2"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(HI)2\nPlanning a IFR flight from Paris Charles de Gaulle LFPG (N49°00.59' E002°32.87') to London Heathrow EGLL (N51°28.65' W000°27.69').\nDetermine the preplanning distance by calculating the direct distance plus 10%. The preplanning distance is:",
    "feedback": "207 NM."
  },
  {
    "question": "In terms of the flight method used to conduct an approach, which type does the following definition describe?\n\"Approaches have lateral guidance only, the pilot must calculate a rate of descent and normally use a Continuous Descent Final Approach (CDFA) method.\"",
    "feedback": "2 D"
  },
  {
    "question": "Planned and actual data as shown in the Flight Log excerpt.\n\nProvided that flight conditions on the leg GAMMA to DELTA remain unchanged and fuel consumption remains unchanged, what fuel remaining should be expected at waypoint DELTA?",
    "feedback": "4475 kg"
  },
  {
    "question": "A jet aeroplane is to fly from A to B. The minimum final reserve fuel must allow for :",
    "feedback": "30 minutes hold at 1500 ft above destination aerodrome elevation, when no alternate is required."
  },
  {
    "question": "(For this Question use Flight Planning Manual SEP1 Figure 2.2, Table 2.2.3)) A flight has to be made with the single engine sample aeroplane. For the fuel calculation allow 10 lbs fuel for start up and taxi, 3 minutes and 6 lbs of additional fuel to allow for the climb, 10 minutes and no fuel correction for the descent. Planned flight time (overhead to overhead) is 02 hours and 37 minutes. Reserve fuel 30% of the trip fuel. Power setting is 23 in.HG (or full throttle), 2300 RPM, 20°C lean. Flight level is 50 and Standard Day (ISA). The minimum block fuel is:",
    "feedback": "276 lbs"
  },
  {
    "question": "The cruising speed to write in the appropriate box (15) of an ATS flight plan is:",
    "feedback": "True airspeed"
  },
  {
    "question": "Refer to Jeppesen GSPRM - North Atlantic Plotting Chart B777\nThe average magnetic course from A (64°N006°E) to C (62°N020°W) is",
    "feedback": "267°"
  },
  {
    "question": "When completing an ATS flight plan, an elapsed time (Item 16) of 1 hour 55 minutes should be entered as :",
    "feedback": "0155"
  },
  {
    "question": "Given:\nDOM: 33510 kgTraffic Load: 7600 kgFinal Reserve: 983 kg\nAlternate Fuel: 1100 kgContingency Fuel: 102 kg (not consumed)\nThe estimated landing mass at the alternate would be:",
    "feedback": "42195 kg"
  },
  {
    "question": "(For this question use Flight Planning Manual MEP1 Figure 3.4)\nFor the multi engine piston aeroplane, if the OAT is -20°C at 19000 ft, the TAS at long-range power setting is:",
    "feedback": "159 knots"
  },
  {
    "question": "What is the difference between GNSS planned and unplanned outages?",
    "feedback": "Planned outages are notified in advance"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(HI)4\nThe identifier of the radio navigation aid or waypoint at N50°16.6' E008°50.9' is:",
    "feedback": "MTR"
  },
  {
    "question": "In the appropriate box of a flight plan form, concerning equipment, the letter to be used to indicate that the aircraft is equipped with a mode A 4096 codes transponder with altitude reporting capability is :",
    "feedback": "C"
  },
  {
    "question": "Refer to Jeppesen GSPRM, VFR chart ED-4:\nYou are flying VFR from Straubing aerodrome (EDMS, N48°54.0' E012°31.1') to Linz International aerodrome (LOWL, N48°14.1' E014°11.3'). Choose the best cruising altitude, the best VFR point to track your flight and the best VOR to tune to.",
    "feedback": "7500 ft, Highway A3, LNZ VORDME"
  },
  {
    "question": "Refer to Jeppesen GSPRM - London Heathrow, chart 10-2\nThe minimum holding altitude (MHA) and maximum holding speed at BIGGIN 115.2 BIG are:",
    "feedback": "7000 ft and 250 KT"
  },
  {
    "question": "On an ATC flight plan, an aircraft indicated as \"H\" for \"Heavy\"",
    "feedback": "is of the highest wake turbulence category"
  },
  {
    "question": "Refer to the following NOTAM and choose the corresponding answer/statement:\nAD CLSD FOR MAINT FRI-SAT 1711132200 - 1711140400",
    "feedback": "The aerodrome is open on Friday up to 2200 and on Saturday from 0400"
  },
  {
    "question": "Athinai (Hellinikon) Chart: What is the maximum permitted altitude if routing inbound from \"Abeam Patroklos\" to Hellinikon?",
    "feedback": "300 ft"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1 Fig. 4.3.6)\nIn order to find ALTERNATE FUEL and TIME TO ALTERNATE, the AEROPLANE OPERATING MANUAL shall be entered with:",
    "feedback": "distance in nautical miles (NM), wind component, landing mass at alternate"
  },
  {
    "question": "(for this question use MRJT1, figure 4.3.1b)\nGiven the following information:\nTwin jet aeroplane zero fuel mass: 50000kgLanding mass at alternate: 52000 kgFinal reserve fuel: 2000 kgAlternate fuel: 1000 kgExtra fuel: 0 kgDiscretionary fuel: 0 kg\nFlight to destination: Distance: 720 NMTrue course: 030° W/V: 340/30KT Cruise: FL 330/LRC Outside air temperature: -30°C",
    "feedback": "4800 kg, 01 h 54  min"
  },
  {
    "question": "An aircraft is flying VFR in mountainous terrain with the highest obstacle in the region having an elevation of 7220 ft. The weather deteriorates and the aircraft has to join IFR and climb to a safe level. Given the following information, what is the minimum usable IFR flight level, complying with the semi-circular rule and providing the required obstacle clearance of 2000 ft?\nOAT = ISA -10°CQNH = 990 hPa (provided from an airport near sea level)Track = 175°(M)Magnetic variation: 15°EDrift: 8° left\n(assume 1 hPa = 30 ft)",
    "feedback": "FL110"
  },
  {
    "question": "Given the following information about a commercial air transport flight, what is the required taxi fuel?\nExpected taxi time: 10 minAPU: On for 10 minCompany policy: For flight planning purposes, taxi fuel shall be calculated as at least 60 kg",
    "feedback": "75 kg"
  },
  {
    "question": "Aberdeen (Dyce) Aera Chart: Which of the following frequencies is listed as available for contact with Aberdeen ATSU?",
    "feedback": "135.17"
  },
  {
    "question": "Refer to CAP 697, Figures 4.5.4a and 4.5.4b\nPlanning an IFR-flight from Paris to London for the twin jet aeroplane.  Given: Estimated Landing Mass 49700 kg, FL 280, W/V 280°/40 kt, Average True Course 320°, Procedure for descent .74 M/250 KIAS  Determine the distance from the top of descent to London (elevation 80 ft).",
    "feedback": "76 NM"
  },
  {
    "question": "Planned and actual data as shown in the Flight Log excerpt (Fuel Planning Section).\n\nAfter a balked landing at the destination airport, you have to divert to the alternate airport with the gear extended. The re-calculated flight time to the alternate due to the reduced speed is 1h 30 min and the fuel flow will be 600 kg/h. \nFinal Reserve Fuel remains unchanged.\nWhat will be the estimated landing mass at the alternate airport?",
    "feedback": "5642 kg"
  },
  {
    "question": "Refer to GSPRM Stuttgart, chart 12-2 RNP Rwy 25\nThe LNAV/VNAV decision altitude for the RNP approach to runway 25 for aircraft approach categories A, B or C is:",
    "feedback": "1590 ft"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)2\nThe distance on airway P18 from POLE HILL 112.1 POL (N53°44.6' W002°06.2') to NATEB is:",
    "feedback": "80 NM"
  },
  {
    "question": "What is the Minimum Descent Altitude for a Cat A aircraft completing an LNAV approach to runway 32R at Toulouse-Blagnac (LFBO)?",
    "feedback": "930 ft"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, chart 11-1\nWhich is the highest obstacle within the approach planview?",
    "feedback": "4252 ft"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1 Figure 4.3.1C)\n\nWithin the limits of the data given, a mean temperature increase of 30°C will affect the trip time by approximately :",
    "feedback": "-5%"
  },
  {
    "question": "ETOPS flight is a twin engine jet aeroplane flight conducted over a route, where no suitable airport is within an area of",
    "feedback": "60 minutes flying time in still air at the approved one engine out speed"
  },
  {
    "question": "Consider the following NOTAM. What does the abbreviation LO mean?\nQ) EDGG/QIXLT/1/BO/A/000/999/5002N00834E005 B) FROM: 13/10/24 09:21 C) TO: PERM E) ILS 25C LO, IDENT FR, 297KHZ, RANGE LIMITED TO 10NM",
    "feedback": "Locator"
  },
  {
    "question": "In the ATS flight plan Item 15, a cruising speed of 470 knots will be entered as :",
    "feedback": "N0470"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Appendix 2, Flight Plan\nItem 19 of the ATS flight plan form (supplementary information) \"UHF\" (letter U) means that the corresponding aircraft is equipped with an emergency radio which is able to receive and transmit at:",
    "feedback": "243.0 MHz"
  },
  {
    "question": "Refer to CAP 697, Fig 3.4\nFrom the meteorological charts for a route, the following observations are made:\nPressure Altitude 4000 ft, OAT +11°C, headwind component 10 ktPressure Altitude 6000 ft, OAT +07°C, headwind component 10 ktPressure Altitude 7000 ft, OAT +02°C, headwind component 12 ktPressure Altitude 8000 ft, OAT +0°C, headwind component 20 kt\nThe fuel flow given for flying at 45 % power is 16 USG per hour\nWhat should be the most fuel efficient pressure altitude to fly a route distance of 300 NM?",
    "feedback": "6000 ft"
  },
  {
    "question": "The flight crew of a turbojet aeroplane prepares a flight using the following data: - Flight leg distance: 3 500 NM - Flight level FL 310, true airspeed: 450 kt - Headwind component at this level: - 55 kt - Initially planned take-off mass (without discretionary fuel on board): 180 000 kg - Fuel price: 0.30 Euro/l at departure; 0.27 Euro/l at destination To maximize savings, the commander decides to carry discretionary fuel in addition to that which is necessary. Using the appended information, the optimum quantity of fuel which should be carried in addition to the prescribed quantity is:",
    "feedback": "The fuel transport operation is not recommended in this case."
  },
  {
    "question": "The navigation plan reads: Trip fuel: 136 kg Flight time: 2h45min Calculated reserve fuel: 30% of trip fuel Fuel in tank is minimum (no discretionary fuel on board) Taxi fuel: 3 kg The endurance on the ICAO flight plan should read:",
    "feedback": "3h34min"
  },
  {
    "question": "Which describes the maximum intensity of icing, if any, at FL 150 in the vicinity of TOULOUSE (44°N 001°E) ?",
    "feedback": "moderate or severe"
  },
  {
    "question": "For this flight, how does the fuel consumption from Top of Climb to TORDU compare to the planned fuel consumption?(all flight logs are in kg)\nThe fuel consumption is ....",
    "feedback": "8 kg/h higher than planned"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(HI)5\nThe appropriate frequency to obtain a plain language inflight weather service in the vicinity of GRAN CANARIA 112.9 GDV (N28°04.6' W015°25.7') is:",
    "feedback": "126.20 MHz"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)4\nWhat is the initial track and the total distance from ROLAMPONT 117.3 RLP (N47°54.38'E005°14.95') along airway G4 to BRAY 114.1 BRY (N48°24.42 E003°17.69)?",
    "feedback": "291°, 83 NM"
  },
  {
    "question": "Refer to Jeppesen GSPRM, chart E(LO)2:\nWhat is the magnetic track and distance from GOLES (N53°36', W001°05') to Pole Hill VOR POL (N53°45', W002°06')?",
    "feedback": "284°, 37 NM"
  },
  {
    "question": "What will be the effect on the FMC fuel and time predictions if the aircraft is in a non-standard configuration?",
    "feedback": "No fuel or time predictions will be correct"
  },
  {
    "question": "When calculating the fuel required to carry out a given flight, one must take into account :\n\n1 - the wind\n2 - foreseeable airborne delays\n3 - other weather forecasts\n4 - any foreseeable conditions which may delay landing\n\nThe combination which provides the correct statement is :",
    "feedback": "1 - 2 - 3 - 4"
  },
  {
    "question": "Refer to Jeppesen GSPRM - VFR Chart ED-4\nDeparture: Beilngries aerodrome (EDNC, N49°01.3' E011°29.1')\nYou continue eastbound at the minimum grid altitude. The altimeter scale is incorrectly set to 1010 hPa, while the QNH reported by the aerodrome is 1001 hPa.\nWhat is your approximate true altitude, shortly after departure, if the temperature at 3500 ft is 18°C? (assume 1 hPa = 30 ft)",
    "feedback": "3310 ft"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Appendix 2, Flight Plan\nItem 9: A332/HItem 10: SDGIRWYZ/SB1Item 13: EDDF1420Item 15: N0379F230 DIK2S DIK UN857 TOLVU/N0387F250 UN857 RAPOR/N0410F280 UN 857 RENSA/N0435F330 UN857 NITEP/N0440F360 UN857 GIMER UT 300 PON UN872 ATLEN/N0452F380 DCT ABUPI DCT XAMAX DCT SRA DCT DEKUS DCT BEXAL UN866 KONBAItem 16: GCTS0425 GCXOItem 18: EET/EBUR0010 LFFF0017 LECM0137 LPPC0202 GMMM0300 GCCC0350\nChoose a correct statement with reference to the above flight plan data:",
    "feedback": "The estimated flight time is 4 h 25 min"
  },
  {
    "question": "An advisory message called NANU is to inform users of a change in the (1) ...... constellation. NANUs are released 72 hours in advance for (2) ....... .",
    "feedback": "(1) GPS, (2) planned maintenance"
  },
  {
    "question": "(For this Question use Flight Planning Manual SEP1 Figure 2.2, Table 2.2.3) A flight has to be made with the single engine sample aeroplane. For the fuel calculation allow 10 lbs fuel for start up and taxi, 3 minutes and 10 lbs of additional fuel to allow for the climb, 10 minutes and no fuel correction for the descent. Planned flight time (overhead to overhead) is 03 hours and 12 minutes. Reserve fuel 30% of the trip fuel. Power setting is 23 in.HG (or full throttle), 2300 RPM, 20°C lean. Flight level is 70 and OAT is ISA +20°C.  The minimum block fuel is:",
    "feedback": "325 lbs"
  },
  {
    "question": "A public transport aeroplane with reciprocating engines,is flying from PARlS to LYON. The final reserve corresponds to:",
    "feedback": "45 minutes at holding speed"
  },
  {
    "question": "Planned and actual data as shown in the Flight Log excerpt.\n\nActual Ground Speed (GS) on the leg BETA to GAMMA will be 100 KT. If all other flight parameters remain unchanged, what fuel remaining should be expected at waypoint GAMMA?",
    "feedback": "2950 kg"
  },
  {
    "question": "An airborne ATS Flight Plan must be submitted:",
    "feedback": "10 minutes before the intended point of entry into a CTA or advisory area"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)2\nATC instructs you to follow the routing from POLE HILL 112.1 POL (N53°45' W002°06') via airway P17 to IPSIR, OBOXA, GASKO, and then to continue via P18 to the north. What is the true track from OBOXA to GASKO?",
    "feedback": "328°"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1 Figure2 4.3.2c and 4.5.3.2)\nWhich changes to forecast conditions will produce the greatest increase in trip fuel required for the following medium range jet transport MRJT flight?\nCruise level: FL370Cruise speed: Mach 0.74Trip distance: 2000 NM\nA change in ....",
    "feedback": "headwind component from 0 to 50 kt"
  },
  {
    "question": "(for this question use MRJT1, figure 4.3.1b)\nWhat is the fuel and time for the trip? Given:\n\nDistance:          1000 NM\nWind:              50 kts tail\nCruise:            FL 370/LRC\nConditions:        ISA\nLanding Mass:      35000 kg",
    "feedback": "4300 kg, 2 hrs 15 mins"
  },
  {
    "question": "An executive pilot is to carry out a flight to a French aerodrome, spend the night there and return the next day. Where will he find the information concerning parking and landing fees ?",
    "feedback": "in the GEN chapter of the French Aeronautical Information Publication (AIP)"
  },
  {
    "question": "The legend for a chart states that the procedure is an APV Baro or APV SBAS instrument approach procedure. The significance of this is that the approach is an approach procedure with vertical guidance, which is a ....",
    "feedback": "3D approach down to minima published as LNAV/VNAV or LPV"
  },
  {
    "question": "How many hours in advance of departure time should a flight plan be filed in the case of flights into areas subject to air traffic flow management (ATFM)?",
    "feedback": "3:00 hours."
  },
  {
    "question": "Given the following information about a commercial air transport IFR flight, what is the required taxi fuel?\nExpected taxi time: 6 minAPU: On for 7 minCompany policy: For flight planning purposes, taxi fuel shall be calculated as at least 60 kg",
    "feedback": "60 kg"
  },
  {
    "question": "(For this question use Flight Planning Manual MRJT 1 Figure 4.3.1.a)Using the simplified flight planning charts, given the following information:\nTrip distance: 300 NMISA deviation: +10°CAverage wind: 75 kt headwindPressure altitude: 29000 ftEstimated landing weight: 40000 kgLong range cruise\nDetermine the fuel required.",
    "feedback": "2480 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, charts 10-2B, 13-2, 13-3, 13-4 and 13-5.\nWhich approaches can be made from CALLES 2N/VALENCIA 2N Standard Arrival Routes?",
    "feedback": "VOR Z RWY 28, VOR X RWY 28"
  },
  {
    "question": "Which statement is correct regarding LNAV/VNAV (Lateral Navigation/Vertical Navigation)?",
    "feedback": "Aircraft using LNAV/VNAV minimums will descend to landing via an internally generated descent path based on sateillite or other approach approved VNAV systems."
  },
  {
    "question": "Given: True course (TC) 017; W/V 340/30; TAS 420 kt Find: wind correction angle (WCA) and ground speed (GS)",
    "feedback": "WCA -2° ; GS 396 kt"
  },
  {
    "question": "What is the track and distance shown on the chart from VOR/DME SKR to overhead Esbjerg?",
    "feedback": "308°(M) / 29 NM"
  },
  {
    "question": "What does the abbreviation \"APV\" mean?",
    "feedback": "Approach procedure with vertical guidance"
  },
  {
    "question": "What does HMU mean?",
    "feedback": "Height monitoring unit"
  },
  {
    "question": "An aircraft, following a 215° true track, must fly over a 10 600 ft obstacle with a minimum obstacle clearance of 1 500 ft. Knowing the QNH received from an airport close by, which is almost at sea-level, is 1035 and the temperature is ISA -15°C, the minimum flight level will be:",
    "feedback": "140"
  },
  {
    "question": "You make a diversion from the route given in the flight plan and land at an uncontrolled airfield. Within what time after landing should you inform ATC?",
    "feedback": "30 min"
  },
  {
    "question": "Flight planning chart for an aeroplane states, that the time to reach the cruising level at a given gross mass is 36 minutes and the distance travelled is 157 NM (zero-wind). What will be the distance travelled with an average tailwind component of 60kt ?",
    "feedback": "193 NM"
  },
  {
    "question": "(For this question Flight Planning Manual MRJT 1 Figure 4.5.3.1) Given: long range cruise; outside air temperature (OAT) -45 ° C in FL 350; mass at the beginning of the leg 40 000 kg; mass at the end of the leg 39 000 kg. Find: true airspeed (TAS) at the end of the leg and the distance (NAM).",
    "feedback": "TAS 431 kt; 227 NAM"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(HI)2\nThe aircraft's positiion is BERGI (N52°45' E004°22') at FL 260,  flying NW along airway UL602. What is the appropriate agency and communication frequency ?",
    "feedback": "Maastricht, 135.960 MHz"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Galbraith Lake, Alaska, chart 11-7\nWhich of the following statements is correct or incorrect?\n1) Circle-to-land is not applicable at night2) The visibility for category B aircraft for the MLS approach is 2 1/2 NM",
    "feedback": "1) is correct, 2) is not correct"
  },
  {
    "question": "Refer to the European Regulations on Air Operations as applicable to commercial air transport.\nWhat is the final reserve fuel for a turbine-engined aircraft with a weight of 48000 kg?",
    "feedback": "925 kg"
  },
  {
    "question": "An aeroplane has the following masses: ESTLWT= 50 000 kg Trip fuel= 4 300 kg Contingency fuel= 215 kg Alternate fuel (final reserve included)= 2 100kg Taxi= 500 kg Block fuel= 7 115 kg Before departure the captain orders to make the block fuel 9 000 kg. The trip fuel in the operational flight plan should read:",
    "feedback": "4 300 kg."
  },
  {
    "question": "A pilot has to fly to destination X, but needs to refuel at airfield B. The total weight of the total usable fuel is 2000 lb. The pilot estimates that the remaining fuel, when landing in B, will have a weight of 620 lb. The fuel in B can only be delivered in barrels since no fuel truck is available. How many barrels, each containing 40 imp gal should be ordered if the specific weight is 0.79?",
    "feedback": "5"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)2, section 6 C\nA flight is planned along route T420, course 330°, FL380, inbound TRENT VORDME (TNT). A descent should be initiated to pass waypoint ELVOS at FL200. Calculate the top of descent (TOD) relating to TRENT for a ground speed of 200 KT and a rate of descent of 1500 ft/min.",
    "feedback": "65 NM"
  },
  {
    "question": "The aeroplane has been refuelled and the inner and outer wing tanks are full on both sides, while the centre tank remains empty. How much fuel is available for use?",
    "feedback": "12252 kg"
  },
  {
    "question": "Given the following data for the pre-flight calculations, determine the required alternate fuel for a commercial air transport flight with a Performance Class A aeroplane.\n(assume the Basic Fuel Scheme without variations applies)\nFuel for missed approach at destination: 300 kgFuel for climb to cruising level: 850 kgCruise distance to alternate: 170 NAMFuel consumption (cruise): 6 kg/NAMFuel for descent to alternate: 120 kgFuel for approach and landing at alternate: 210 kgFuel flow for holding at atlernate: 2200 kg/hrFuel for missed approach at alternate: 170 kg",
    "feedback": "2500 kg"
  },
  {
    "question": "A pilot on a short VFR flight fills in the flight log. The aircraft departed with slightly more fuel than the planned fuel, but within operational limits. The planned take-off and landing masses are shown in the log.\nThe pilot wants to estimate the landing mass. Assume that the fuel flow from the current position (Seeshaupt) to the top of descent (tall mast) is the same as the average fuel flow for the cruise so far and that the fuel used in the descent will be 28 kg, which is the same as the original plan. \nWhat is the estimate of the actual landing mass?",
    "feedback": "2696 kg"
  },
  {
    "question": "The maximum fuel capacity of an aircraft is 1400 lb, and the pilot has to oder fuel to fill up en-route to the final destination. The pilot estimates landing at the fuelling point with 350 lb on board. How many 40 Imperial Gallon fuel drums must be ordered if the fuel supplier states a specific gravity of 0.78?",
    "feedback": "4"
  },
  {
    "question": "Advantages provided by GNSS/FMC systems are:\n1) Estimation of times and fuel at each waypoint entered into the system2) Automatic calculation and display of tracks and leg distances3) Accurate time and fuel revisions, provided that the manual inputs by the crew are correct\nThe combination regrouping all of the correct statements is:",
    "feedback": "1, 2"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)1\nA flight is planned on airway N560 from RIMOL to GLASGOW. Magnetic heading is 197°, TAS 200 KT and magnetic wind 347°/45KT. Calculate the wind correction angle overhead GUSSI:",
    "feedback": "6°R"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)7\nThe airspace centered over Bodo airport ENBO (N67°16.15 'E014°21.92') is the:",
    "feedback": "BODO TMA, upper limit FL195"
  },
  {
    "question": "In a flight plan when the destination aerodrome is A and the alternate aerodrome is B, the final  reserve fuel for a turbojet engine aeroplane corresponds to:",
    "feedback": "30 minutes holding 1,500 feet above aerodrome B"
  },
  {
    "question": "Which is the correct statement with reference to an RNAV SID?",
    "feedback": "The RNAV SID can be flown without ground-based radio navigation aids"
  },
  {
    "question": "The fuel burn of an aircraft turbine engine is 220 l/h with a fuel density of 0,80. If the density is 0,75, the fuel burn will be:",
    "feedback": "235 l/h"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)2\nWhat is an appropriate flight level for an IFR flight from TALLA 113.8 TLA (N55°29.95' W003°21.17')  to DEAN CROSS 115,2 DCS (N54°43.32'  W003°20.44') on airway N864, magnetic track 182°?",
    "feedback": "FL110"
  },
  {
    "question": "Which was the correct date of the implementation of the RVSM in the European Airspace?",
    "feedback": "24 January 2002"
  },
  {
    "question": "Given the following information for a commercial air transport flight, what is the time (in minutes) needed from the destination to the alternate aerodrome? Assume an operation with a Performance Class A aeroplane applying the Basic Fuel Scheme or with a helicopter (basic fuel planning provisions are the same).\nMissed approach at the destination: 6 minClimb to cruise level: 8 minCruise distance: 55 NMCruise TAS: 165 ktHeadwind: 10 ktAnticipated hold at the alternate: 10 minDescent to the alternate: 6 minApproach to the alternate: 6 min",
    "feedback": "57 min"
  },
  {
    "question": "Refer to Jeppesen GSPRM - VFR Chart ED-4\nWhat is the distance and true course from RODING VOR (RDG, N49°02.5' E012°31.05') to Thalmässing-Waizenhofen (EDPW, N49°03.85' E011°12.57') airfield?",
    "feedback": "272°, 52 NM"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Appendix 2, Flight Plan\nThe following information can be found in an ATS flight plan:\nItem 9: B757/MItem 10: SGHILPRWY/SItem 13: EDDM1400\nWhat does the letter W mean?",
    "feedback": "RVSM approved"
  },
  {
    "question": "Refer to Jeppesen GSPRM, chart ED-4\nYou are planning a flight from Landshut (EDML 48°30.7'N 012°02.0E) to Deggendorf (EDMW 48°49.8'N 012°52.8'E) following the A92 highway. The highest man-made obstacle in the vicinity of your track has a height of .....",
    "feedback": "2089 ft AMSL"
  },
  {
    "question": "Planning a MACH 0,82 cruise at FL 390, the estimated landing mass is 160 000 kg; the ground distance is 2 800 NM and the mean tailwind is 100 kt; ISA conditions.\nFuel consumption will be:",
    "feedback": "26 950 kg"
  },
  {
    "question": "(For this question use Flight Planning Manual MRJT 1 Figure 4.3.1.a)Given the following data, determine the trip time.\nTrip distance: 425 NMISA deviation: +5°CAverage wind: 25 kt tailwindCruise pressure altitude: 30000 ftEstimated landing weight: 55000 kgLong range cruise",
    "feedback": "1.25 hours"
  },
  {
    "question": "(For this Question use Flight Planning Manual SEP 1, Fig. 2.4)  Using the Range Profile Diagram, for the single engine aeroplane, determine the range, with 45 minutes reserve, in the following conditions, given:  OAT ISA +16° C Pressure altitude 4000 ft Full throttle 25.0 in/Hg, 2100 RPM",
    "feedback": "865 NM"
  },
  {
    "question": "Refer to the following NOTAM. What is correct about its validity?\nQ) EGTT/QOBCE/IV/M/AEA) EGSS B) FROM: 16/12/11 09:00 C) TO: 16/12/15 18:00E) CRANE OPERATING AT STANSTED AT POSITION FROM ARP 232 DEGREES MAGNETIC DISTANCE FROM ARP 1627M. PSN 515234N 001258E. MAXIMUM OPERATING HEIGHT 121 FT AGL/436FT AMSL, JIBS LIT WITH RED OBST LIGHTS",
    "feedback": "It starts at 0900 UTC on December 11th, 2016"
  },
  {
    "question": "An aircraft has a maximum certificated take-off mass of 137000 kg but is operating at take-off mass 135000 kg. In Item 9 of the ATS flight plan its wake turbulence category is :",
    "feedback": "heavy \"H\""
  },
  {
    "question": "Refer to Jeppesen GSPRM - VFR Chart ED-4\nRefer to München airport EDDM, N048° 21.23' E11° 47.17'. What is the lowest altitude of class C airspace?",
    "feedback": "3500 ft"
  },
  {
    "question": "Which flight level is not a RVSM level?",
    "feedback": "FL 280"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1 Figure 4.3.5)\n\nGiven a trip time of about 9 hours, within the limits of the data given, a  temperature decrease of 30°C will affect the trip time by approximately:",
    "feedback": "+ 7%"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1 Figure 4.5.3.1)\nWhat would be the change in fuel required if the temperature at FL280 was -31°C?",
    "feedback": "+0.6%"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1) The following apply : Tail wind component 10kt Temperature ISA +10°C Brake release mass 63000kg Trip fuel available 20000kg What is the maximum possible trip distance ?",
    "feedback": "3740 NM"
  },
  {
    "question": "Calculate the maximum possible extra fuel, based on the flight and aircraft data given below.\nMTOM: 476100 lbMLM: 387350 lbMZFM: 362700 lbPlanned ZFM: 323450 lbTrip fuel: 72460 lbTake-off fuel: 124830 lbFuel penalty: 630 lb/1000 lb",
    "feedback": "18793 lb"
  },
  {
    "question": "Which option is correct as regards checking the availability of the GNSS service for flights that will rely on GNSS information for guidance?",
    "feedback": "Satellites may not be available due to the status of the constellation"
  },
  {
    "question": "Q) EUAD/QSPLT/IV/BO/AE/000/021/5212N00011E003 A) EUAD B) FROM: 16/02/09 08:30C) TO: 16/02/09 14:30 E) E BAND HIGH INTENSIT RADAR TRANSMISSION AREA (HIRTA) IN D304 RADIUS 1NM. MAX HEIGHT 472FT AGL. SAFE DISTANCES CIVILIAN ACFT 0.011 NM 11FT AG MIL ACFT VERY LOW 0.011 NM 11FT AGL LOW 0.053NM 157FT AGL MEDIUM 0.077NM 242FT AGL HIGH 0.143NM 472FT AGL\nAccording to the NOTAM, what is the safe distance for a civilian aircraft?",
    "feedback": "0.011 NM"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1, 3.1 Simplified Planning Chart Corrections)\nBefore departure, the APU is run for 12 minutes. The taxi time is expected to be 6 minutes. The APU uses an additional 5 kg of fuel to start. Company regulations require a minimum fuel of 100 kg for ground consumption.\nFind the required fuel for ground operations.",
    "feedback": "100 kg"
  },
  {
    "question": "For pre-flight planning purposes, what is the total fuel required for a commercial air transport flight in a Long-Range Jet Transport (LRJT) aeroplane?\n(assume the Basic Fuel Scheme without variations applies)\nTaxi fuel: 235 kgTrip fuel: 52319 kgAdditional fuel: 2700 kgContingency fuel: 5 % of the trip fuelDestination alternate fuel: 1550 kgFinal reserve fuel: 1850 kgExtra fuel: 0 kgDiscretionary fuel: 0 kg",
    "feedback": "61270 kg"
  },
  {
    "question": "What does the letter 'H' mean if it appears in item 9 of an ICAO ATS Flight Plan (FPL)?",
    "feedback": "Wake turbulence category heavy"
  },
  {
    "question": "What is the published frequency for Barcelona ATIS?",
    "feedback": "118.65 MHz"
  },
  {
    "question": "Given the following information, determine the trip fuel for a commercial air transport flight with a turbine engined aeroplane. Consider planning without a destination alternate, and that the landing at destination is planned with the minimum regulatory fuel on touchdown.\nTrip distance: 350 NMTotal fuel flow for holding planning: 4000 kg/hZero fuel mass ZFM: 53000 kgAverage wind component: 25 kt headwindNo additional fuel requiredNo extra fuel required\nThe flight is to be planned according to the basic fuel policy procedure.",
    "feedback": "2400 kg"
  },
  {
    "question": "(for this question use MRJT1, figure 4.5.4a)\nAssume M0.74/250 KIAS descent profile. How much time will elapse from top of descent (FL350) to level off at 5000 feet?",
    "feedback": "16 minutes"
  },
  {
    "question": "refer to the figure.\nThe figure shows an extract from a typical flight plan produced by an airline flight planning tool. Assume that the fuel flow remains the same as experienced between OKEPI and OKIRA and that the actual times between the waypoints are as planned. What is the estimated remaining fuel overhead MOKIP?",
    "feedback": "5550 kg"
  },
  {
    "question": "When an ATC flight plan is submitted for a flight outside designated ATS routes, points included in Item 15 (route) should not normally be at intervals of more than :",
    "feedback": "30 minutes flying time or 370 km"
  },
  {
    "question": "VFR Directory for Greece: What is the local time (LT) in Greece in (i) Winter and (ii) Summer?",
    "feedback": "(i) LT = UTC + 2 hours (ii) LT = UTC + 3 hours"
  },
  {
    "question": "A jet aeroplane has a cruising fuel consumption of 4060 kg/h, and 3690 kg/h during holding. If the destination is an isolated airfield, the aeroplane must carry, in addition to contingency reserves, additional fuel of :",
    "feedback": "8120 kg."
  },
  {
    "question": "(for this question use MRJT1, Figure 4.5.3.1)\nFind the true airspeed (TAS) given the following data:\nCruise: LRC at FL330OAT: -63ºCGross mass: 50500 kg",
    "feedback": "421 kts"
  },
  {
    "question": "From which of the following would you expect to find information regarding known short unserviceability of VOR, TACAN, and NDB ?",
    "feedback": "NOTAM"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Amsterdam, chart 11-1\nWhen passing the FAF on the ILS Rwy 06 approach, the MSA is based on the (i) and is (ii) to the southwest of the reference point.",
    "feedback": "SPL VOR, 1700 ft"
  },
  {
    "question": "What is the proper phraseology if ATC wants to know if you are RVSM approved?",
    "feedback": "Affirm RVSM"
  },
  {
    "question": "A descent is planned from 7500 ft MSL so as to arrive at 1000 ft MSL 6 NM from a VORTAC.\nWith a GS of 156 kts and a rate of descent of 800 ft/min. The distance from the VORTAC when descent is started is :",
    "feedback": "27,1 NM"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)1\nA section of a flight is carried out from SUMBURGH (SUM) to ABERDEEN (ADN) along airway Y905. Choose the maximum flight level which can be used for the entire section:",
    "feedback": "FL190"
  },
  {
    "question": "Given the following information for a commercial air transport operation, calculate the maximum possible extra fuel to be uplifted.\nMaximum zero fuel mass: 62731 kgActual zero fuel mass: 59031 kgRegulated take-off mass: 76000 kgMaximum landing mass: 66360 kgFuel tank capacity: 16000 kgTaxi fuel: 240 kgTrip fuel: 4761 kgMinimum block fuel: 8000 kg",
    "feedback": "4330 kg"
  },
  {
    "question": "In the ATS flight plan item 15, it is necessary to enter any point at which a change of cruising speed takes place. For this purpose a \"change of speed\" is defined as :",
    "feedback": "5% TAS or 0.01 Mach or more"
  },
  {
    "question": "(For this Question use Flight Planning & Monitoring SEP1 Fig. 2.2) Given: FL 75 OAT +10°C Lean mixture 23.0 in.Hg (or full throttle) at 2300 RPM   Find the fuel flow in gallons per hour (GPH) and TAS.",
    "feedback": "11.7 GPH TAS: 160 kt"
  },
  {
    "question": "Refer to the extract of the OFP:\n\nOverhead waypoint NISUN you may expect an outside temperature of:",
    "feedback": "-47°C"
  },
  {
    "question": "Determine the maximum attainable flight time and range, given the following information:\nAverage fuel flow: 42 litres/hrAvailable fuel: 53 litresTAS: 95 ktWind component: 25 kts tailwind(final reserve and contingency/alternate fuel not to be considered)\nThe flight time is (1) .... and the range is (2) ....",
    "feedback": "(1) 1 hour 16 minutes, (2) 151 NM"
  },
  {
    "question": "Refer to Jeppesen GSPRM, Chart E(LO)6\nWhat is the shortest route from ALTET VORDME (ALT N38°16' W000°34') to BARCELONA VORDME (BCN N41°18' E002°06')?",
    "feedback": "ALT-B46-MITOS-N608-SOPET-B28-BCN"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1 Figure 4.5.1)\nFind the climb fuel. Given:\nMass at brake release: 57500 kgTemperature: ISA -10°CAverage headwind component: 16 ktsInitial cruise: FL280",
    "feedback": "1138 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)2\nAn aircraft flies from  POLE HILL 112.1 POL (N53°45' W002°06') to OTBED (N53°18' E000°02').\nWhich route is to be selected?",
    "feedback": "POL N57 DENBY L975 DESIG L70 MAMUL L60 OTBED"
  },
  {
    "question": "(for this question use Flight Planning Manual MRJT1, Figure 3.1)\nGiven the following information, what is the total taxi fuel required for a commercial air transport flight?\nPlanned APU usage at the parking position: 15 minutes prior to taxiPlanned taxi time: 20 minutes at both the departure and destination aerodrome",
    "feedback": "249 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(HI)4\nThe aircraft's position is RENKI ( N52°55' E013°58'), FL 320, heading west along airway UL619. What is the appropriate agency and communication frequency to be used?",
    "feedback": "RHEIN 133.035 MHZ"
  },
  {
    "question": "If a pilot lands at an aerodrome other than the destination aerodrome specified in the flight plan, he must ensure that the ATS unit at the destination aerodrome is informed within a certain number of minutes of his planned ETA at destination. This number of minutes is:",
    "feedback": "30"
  },
  {
    "question": "Given the following information, calculate the total fuel for engine start and taxi.\nStart fuel: 20 litresTaxi fuel flow: 150 litres/hTaxi time: 10 minutesFuel density: 0.82 kg/l",
    "feedback": "36.9 kilograms"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Appendix 2, Flight Plan\nItem 9: A321/MItem 10: SDGIRWYZ/SB1Item 13: EDDF1420Item 15: N0379F230 DIK2S DIK UN857 TOLVU/N0387F250 UN857 RAPOR/N0410F280 UN 857 RENSA/N0435F330 UN857 NITEP/N0440F360 UN857 GIMER UT 300 PON UN872 ATLEN/N0452F380 DCT ABUPI DCT XAMAX DCT SRA DCT DEKUS DCT BEXAL UN866 KONBAItem 16: GCTS0425 GCXOItem 18: EET/EBUR0010 LFFF0017 LECM0137 LPPC0202 GMMM0300 GCCC0350\nChoose a correct statement with reference to the above flight plan data:",
    "feedback": "The Airbus has VHF communication with 8.33 kHz channel spacing capability"
  },
  {
    "question": "(for this question use MRJT1, Figure 4.7.2)\nAn aircraft on an extended range operation (ETOPS) is required never to be more than 180 minutes from an alternate, based on 1 engine inoperative LRC conditions in ISA. Using the table and a given mass of 50000 kg at the most critical point, the maximum air distance to the relevant alternate is:",
    "feedback": "1101 NM"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Galbraith Lake, Alaska, chart 11-7\nWhich of the following is correct with regard to the missed approach procedure?",
    "feedback": "The missed approach turn is designed for a 1NM radius"
  },
  {
    "question": "For pre-flight planning purposes what is the minimum take-off fuel for a commercial air transport flight with a turbine engine jet aircraft?\n(assume the Basic Fuel Scheme without variations applies)\nTrip fuel: 7200 kgAlternate fuel: 4440 kgDestination holding fuel: 6450 kg/hAlternate holding fuel: 6000 kg/hExtra fuel: 0 kgDiscretionary fuel: 0 kg",
    "feedback": "15178 kg"
  },
  {
    "question": "For a long distance flight at FL 370, \"Long Range\" regime, divided into four flight legs with the following specifications: - segment AB - Ground distance: 2 000 NM. headwind component: 50 kt - segment BC - Ground distance: 1 000 NM. headwind component: 30 kt - segment CD - Ground distance: 500 NM. tailwind component: 70 kt - segment DE - Ground distance: 1 000 NM. headwind component: 20 kt The total air distance is approximately:",
    "feedback": "4 800 NM"
  },
  {
    "question": "Athinai (Hellinikon) Approach Chart: The callsign and frequency to use to obtain start up clearance is:",
    "feedback": "Ground 121.70"
  },
  {
    "question": "The flight crew of a turbojet aeroplane prepares a flight using the following data: - Flight leg distance: 3 500 NM - Flight level FL 310, true airspeed: 450 kt - Headwind component at this level: 55 kt - Initially planned take-off mass (without discretionary fuel on board): 180 000 kg - Fuel price: 0.27 $/l at departure The commander may carry on board 8 000 kg more fuel than that which is necessary. For this fuel transport operation to be cost effective, the minimum fuel price at arrival must be:",
    "feedback": "0.30 $/l"
  },
  {
    "question": "A reciprocating engine aircraft performing a commercial flight arrives at the destination whith the minimum fuel, conducts a missed approach and proceeds to the alternate aerodrome. How much fuel will be in the tanks (1) at the destination and (2) at the alternate aerodrome?\nTrip fuel: 245 USGFuel for one go-around and one approach: 22 USGAlternate fuel: 38 USGFuel consumption at cruise level: 80 USG/hFuel consumption at holding: 60 USG/h",
    "feedback": "(1) 83 USG, (2) 45 USG"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)2\nOn an IFR flight close to airfield Lelystad (EHLE, N52°28' E005°32') you need to determine the distance to the corresponding DME station. Which of the following is the correct frequency and identifier?",
    "feedback": "111.4 MHz, FRO"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)2\nThe minimum enroute altitude (MEA) than can be maintained continuously on airway Y96 from TALLA 113.8 TLA (N55°29.95'' W003°21.17') to reporting point AGPED (N55°07.32' W001°56.95') is:",
    "feedback": "FL200"
  },
  {
    "question": "Based on the values given in the document, calculate the block fuel.",
    "feedback": "56246 kg"
  },
  {
    "question": "A mountain (6011 ft AMSL) lies along an aircraft's track of 356°(T), variation 10°W, HDG 355°(M). What is the lowest VFR ICAO level required to overfly the mountain by at least 2000 ft? (local QNH 990 hPa, assume 1 hPa = 30 ft)",
    "feedback": "FL095"
  },
  {
    "question": "When using decision point procedure, you reduce the",
    "feedback": "contingency fuel by adding contingency only from the burnoff between decision point and destination."
  },
  {
    "question": "The flight crew of a turbojet aeroplane prepares a flight using the following data: - Flight leg air distance: 2 700 NM - Flight level FL 310, true airspeed: 470 kt - Tailwind component at this level: 35 kt - Initially planned take-off mass (without discretionary fuel on board): 195 000 kg - Fuel price: 0.28 Euro/l at departure; 0.26 Euro/l at destination To maximize savings, the commander chooses to carry discretionary fuel in addition to that which is necessary. The optimum quantity of fuel which should be carried in addition to the prescribed quantity is:",
    "feedback": "The fuel transport operation is not recommended in this case"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)2\nWhich of the follwing is correct for a flight via DEAN CROSS 115,2 DCS (N54°43' W003°20.4') to POLE HILL 112.1 POL (N53°44.6' W002°06.2') on airway N57 after IPNOX?",
    "feedback": "The Minimum Enroute Altitude on this segment is FL90 when DCS is passed at 20:30 LT"
  },
  {
    "question": "For a flight plan filed before the flight, the indicated time of departure is:",
    "feedback": "the estimated off-block time"
  },
  {
    "question": "Refer to Jeppesen GSPRM, chart Alicante (LEAL) STAR 10-2B\nYou are briefing the VLC2L STAR into LEAL and your captain asks you for the MEA and the distance between Valencia VOR and the IAF. What is your reply?",
    "feedback": "FL080 and 59 NM"
  },
  {
    "question": "Your initial cruising speed and level are 300 kts and FL 250. At position STP on airway B3 you plan to climb to FL 330 and increase speed to 350 kts. How should this change be shown in box 15 on the flight plan form?",
    "feedback": "STP/N0350F330 B3"
  },
  {
    "question": "Aberdeen (Dyce) Area Chart: What is the correct frequency to contact Scottish Information when overhead reporting point BANCHORY to the southwest of Aberdeen airport?",
    "feedback": "119.87"
  },
  {
    "question": "Refer to CAP 697, Figures 4.5.4a and 4.5.4b\nPlanning an IFR-flight from Paris to London for the twin jet aeroplane.  Given: Estimated Landing Mass 49700 kg, FL 280, W/V 280°/40 kt, Average True Course 320°, Procedure for descent .74 M/250 KIAS  Determine the time from the top of descent to London (elevation 80 ft).",
    "feedback": "19 min"
  },
  {
    "question": "Assuming the following data: . Ground distance to be covered: 2 000 NM . Cruise flight level: FL 330 . Cruising speed: Mach 0.82 (true airspeed: 470 kt) . Head wind component: 30 kt . Planned destination landing mass: 160 000 kg . Temperature: ISA . CG: 37% . Total anti-ice: ON . Pack flow: HIFuel needed to carry out such a flight is:",
    "feedback": "29750 kg"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1 Figures 4.5.2, 4.5.3.1)\nFind the fuel required to fly from C to D given:\n\nDistance C-D:                      680 NM\nCruise                             FL340/LRC\nOAT:                               ISA\nHeadwind component :               60 kt\nGross mass at C:                   44 700 kg",
    "feedback": "3700 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM, VFR chart ED-4:\nWhat is the frequency and identifier of the nearest station when your position is N49°00' E012°30'?",
    "feedback": "114.70 RDG"
  },
  {
    "question": "Given the following data for the pre-flight calculations, determine the contingency fuel for a commercial air transport flight with a Performance Class A aeroplane.\n(assume the Basic Fuel Scheme without variations applies)\nTrip fuel: 2300 lbAlternate fuel: 950 lbTaxi fuel: 180 lbReserve fuel: 480 lbEn-route alternate: not applicableFuel to fly for 5 minutes at 1500 ft above destination: 80 lbExtra fuel: 0 kgDiscretionary fuel: 0 kg",
    "feedback": "115 lb"
  },
  {
    "question": "The flight crew of a turbojet aeroplane prepares a flight using the following data: Flight leg ground distance: 4 000 NM Flight level FL 370; \"Long range\" flight regime Effective wind at this level: head wind of 50 kt Temperature: ISA Centre of gravity (CG): 37 % Pack flow : LOW (LO) Anti ice: OFF Reference landing mass: 140 000 kg Taxi fuel: 500 kg Final reserve fuel: 2 400 kg The fuel quantity which must be loaded on board the aircraft, ecluding any contingency fuel,  is:",
    "feedback": "51 860 kg"
  },
  {
    "question": "It is possible, in flight, to:\n\n1 - file an ATC flight plan\n2 - modify an active ATC flight plan\n3 - cancel an active ATC flight plan\n4 - close an active ATC flight plan\n\nWhich of the following combinations contains all of the correct statements?",
    "feedback": "1 - 2 - 3 - 4"
  },
  {
    "question": "Refer to Jeppesen GSPRM, VFR Chart ED-4:\nYou are flying from Albstadt Degerfeld (EDSA) airport (N48°15.0' E009°03.06') to Laupheim (ETHL) airport (N48°13.2' E009°54.6'). What frequency would you use for flight information service?",
    "feedback": "Langen Information 128.95 MHz and München Information 126.95 MHz"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)2, page 8, sectors C & D\nYou are flying on M90 from BERGI to LONAM. Which of the following special use airspaces will be passed?",
    "feedback": "EH(D)-09"
  },
  {
    "question": "Given:\nDry operating mass (DOM)= 33000 kg\nLoad= 8110 kg\nFinal reserve fuel= 983 kg\nAlternate fuel= 1100 kg\nContingency fuel 102 kg\nThe estimated landing mass at alternate should be :",
    "feedback": "42195 kg."
  },
  {
    "question": "Given:\nMissed approach at the destination: 6 minClimb to cruise level: 8 minCruise distance: 55 NMCruise TAS: 165 ktHeadwind: 10 ktExpected holding at the alternate: 10 minDescent to the alternate: 6 minApproach to the alternate: 6 min\nCalculate the time from the destination to the alternate for this commercial flight.",
    "feedback": "57 min"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, charts 13-1, 13-2, 13-3, 13-5\nWhich of the following VOR approaches can be flown with VORDME ALT unserviceable?",
    "feedback": "neither"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)2\nA routing is along airway N562 from TURNBERRY (TRN, N55°19' W004°47') to MACHRIHANISH (MAC, N55°26' W005°39'). What is the course and distance from HERON intersection to MAC?",
    "feedback": "287°(M), 23 NM"
  },
  {
    "question": "Refer to Jeppesen GSPRM, Chart E(LO)2\nWhat is the initial track direction (°T) and distance (NM) from BELFAST BEL VORDME  (54°40'N 006°14'W) to TALLA TLA VORDME (55°30'N 003°21'W)?",
    "feedback": "062°(T) and 108 NM"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1)\nGiven : Distance C - D :            540 NM\nCruise 300 KIAS at FL 210\nTemperature Deviation from ISA :    +20°C\nHeadwind component :                50 kt\nGross mass at C :                   60 000 kg\nThe fuel required from C to D is :",
    "feedback": "4242 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Appendix 2, Flight Plan\nThe following information is provided in item 15 of an ATS flight plan:\nN0477F330 MODRU Z717 GOBNO UZ717 MAS UM 617 SOGRI UL608 DENUT UL610 GILDA UL620 SAM/N0470F350 UN20 GAPLI/M081F370 DCT BEDRA/M081F390 DCT 48N021W 46N031W 44N041W 40N060W/M081F410 DCT BALOO DCT ANTIG M328 SLEMA DCT ZFP/N0465F410 BR70V TURBO AR10 DHP J79 EYW DCT CANOA\nWhat is true if you refer to position BEDRA?",
    "feedback": "The planned speed will be Mach 0.81"
  },
  {
    "question": "Refer to Jeppesen GSPRM Alicante, charts 10-2G, 13-3, 13-4, and 13-5\nWhich VOR approaches can be made at the end of the CALLES 1R or the VALENCIA 1R arrival?",
    "feedback": "Vor X and VOR Z approaches"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Nantes LFRS, chart 12-1 The altitude to be flown between the IF and FAF for the RNAV (GNSS) Rwy 03 approach is:",
    "feedback": "3000 ft"
  },
  {
    "question": "Refer to Jeppesen GSPRM Aberdeen, chart 10-1R:\nYou are approaching Aberdeen airport from 18 NM southwest. What minimum radar altitudes are you passing?",
    "feedback": "4100 ft to 3200 ft to 2800 ft to 2300 ft"
  },
  {
    "question": "Given the following information, calculate the revised estimated landing mass at the destination for the commercial air transport flight with a Performance Class A aeroplane.\n(assume the Basic Fuel Scheme without variations applies)\nDOM: 4515 kgTraffic load: 2540 kgRemaining usable fuel: 960 kgRemaining trip fuel to destination: 350 kgAlternate fuel: 240 kgFinal reserve fuel: 250 kgExtra fuel: 0 kgDiscretionary fuel: 0 kg",
    "feedback": "7665 kg"
  },
  {
    "question": "For pre-flight planning purposes, what is the minimum take-off fuel required for the commercial air transport flight in a Jet aircraft, given the following information?\n(assume the Basic Fuel Scheme without variations applies)\nRoute distance: 2548 NMAir distance: 2725 NMEstimated TAS: 431 ktEstimated flight time to the alternate: 34 minutesAverage wind component: 28 kt headwindAverage fuel flow: 3048 kg/hFinal reserve: 1351 kgExtra fuel: 0 kgDiscretionary fuel: 0 kg",
    "feedback": "22929 kg"
  },
  {
    "question": "For pre-flight planning purposes, what is the block fuel required?\n(assume the Basic Fuel Scheme without variations applies)\nTaxi fuel: 350 kgTrip fuel: 85000 kgContingency fuel: 5 % of the trip fuelFinal reserve fuel: 3000 kgAlternate fuel: 5500 kgExtra fuel: 0 kgDiscretionary fuel: 0 kg",
    "feedback": "98100 kg"
  },
  {
    "question": "An aircraft on a track of 240°(M) has to overfly an obstacle of 26500 ft with a clearance of 2000 ft. The QNH is 1013 hPa and the OAT is ISA +10°C. What is the minimum flight level (FL) at which the aircraft may fly in RVSM airspace?\n(assume 1 hPa = 30 ft)",
    "feedback": "FL300"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, charts 13-1, 13-2, 11-1, 11-2\nApproach into Alicante, with the aircraft's ADF unserviceable: Which of the following approaches are applicable?",
    "feedback": "VOR Y, VOR Z"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Tromso, chart 10-2F\nWhat is the direct distance from the clearance limit to the Langnes airport (ENTC)?",
    "feedback": "17 NM"
  },
  {
    "question": "(for this question us Flight Planning Manual MEP1, Fig. 3.1)\nGiven the following information, calculate the time and distance from take-off to top of climb:\nAerdrome pressure altitude: 4000 ftAerodrome OAT: +8°CCruise pressure altitude: 10000 ftCruise OAT: -6°C",
    "feedback": "9 min; 17 NAM"
  },
  {
    "question": "Refer to Jeppesen GSPRM Alicante, charts 10-2B, 10-2G:\nYou are going to arrive at Alicante (LEAL) via waypoint CALLES at 17:00 local time. Which of the following STARs is to be expected when runway 28 is in use?",
    "feedback": "CALLES 2N"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Aerodrome Directory\nCheck the following statements for NANTES-ATLANTIQUE aerodrome (LFRS):",
    "feedback": "Arrangement of handling is mandatory prior to the flight"
  },
  {
    "question": "(For this question use Flight Planning Manual MRJT 1 Figure 4.7.2)\n\nAn aircraft on an extended range operation is required never to be more than 120 minutes from an alternate, based on 1 engine inoperative LRC conditions in ISA. Using the above table and a given mass of 40000 kg at the most critical point, the maximum air distance to the relevant alternate is :",
    "feedback": "735 NM"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Tromso, chart 12-3\nWhich of the following statements is correct?",
    "feedback": "The procedure is offset 32°"
  },
  {
    "question": "Refer to Jeppesen GSPRM - North Atlantic Plotting Chart B777\nThe initial true course from A (64°N006°E) to C (62°N020°W) is",
    "feedback": "271°"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)3\nOn a flight through the Netherlands you pass TULIP intersection and follow airway Y12 to SPIJKERBOOR (SPY, N52°32' E004°51'). Which communication frequency for Amsterdam is appropriate when passing TULIP?",
    "feedback": "125.75 MHz"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, charts 10-2, 10-2A, 10-2B, 10-2C, and Enroute Chart E(LO)6\nFor a flight from Munich to Alicante, airway A34 is used for the last section. Which of the following STARs is applicable for an approach to runway 10?",
    "feedback": "VALENCIA 2L"
  },
  {
    "question": "Refer to the extract of the OFP:\n\nWhat is the time required to reach the top of climb (TOC)?",
    "feedback": "36 min"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)3\nAn aeroplane has to fly from ABBEVILLE 108.45 ABB (N50°08.11' E001°51.29') to BIGGIN 115.1 BIG (N51°19.86' E000°02.09') on a route ABB N20 KUNAV T421 BIG. At BIGGIN you can find: 142°. This is:",
    "feedback": "The radial inbound to BIG VOR"
  },
  {
    "question": "The still air distance in the climb is 189 Nautical Air Miles (NAM) and time 30 minutes. What ground distance would be covered in a 30 kt head wind?",
    "feedback": "174 NM"
  },
  {
    "question": "A turbojet aeroplane is flying using the following data:\n  . optimum flight level, Mach 0.80, mass of 190 000 kg\n  . temperature: ISA\n  . tailwind component: 100 kt\nThe fuel mileage and the fuel consumption per hour are:",
    "feedback": "105 NM/1000 kg; 5330 kg/h"
  },
  {
    "question": "Given:\nDry operating mass (DOM)= 33500 kg\nLoad= 7600 kg\nMaximum allowable take-off mass= 66200 kg\nStandard taxi fuel= 200 kg\nTank capacity= 16 100 kg\nThe maximum possible take-off fuel is:",
    "feedback": "15 900 kg"
  },
  {
    "question": "Given the following information for a commercial air transport flight, what is the time (in minutes) needed from the destination to the alternate aerodrome? Assume an operation with a Performance Class A aeroplane applying the Basic Fuel Scheme or with a helicopter (basic fuel planning provisions are the same).\nMissed approach at the destination: 6 minClimb to cruise level: 7 minCruise distance: 130 NMCruise TAS: 145 ktTailwind: 10 ktAnticipated hold at the alternate: 11 minDescent to the alternate: 7 minApproach to the alternate: 8 min",
    "feedback": "89 min"
  },
  {
    "question": "(Area of Operation, CAP 697) You have following information:\n\nWeight:\t\t\t\t57.5 t\nSpeed schedule:\t\t\tLRC\nETOPS approval:\t\t\t180 min\n\nWhat is your area of operation?",
    "feedback": "1100 NM"
  },
  {
    "question": "For pre-flight purposes, what is the total fuel required for the commercial air transport flight in a Medium Range Jet Transport MRJT aeroplane, with no destination alternate, given the following information?\n(assume the Basic Fuel Scheme without variations applies)\nEstimated taxi time: 20 minutes at both departure and destination aerodromesAPU fuel flow: 115 kg/hTaxi fuel flow: 11 kg/minPlanned APU usage at the parking position: ZeroTotal trip distance: 1131 NMAverage fuel flow: 2638 kg/hTAS: 424 ktAverage component: +17 ktContingency fuel: 3% of the trip fuelHolding fuel flow: 2400 kg/h Extra fuel: 0 kgDiscretionary fuel: 0 kg",
    "feedback": "8989 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Amsterdam, chart 11-2\nAn aircraft is approaching ILS Rwy 06 via RIVER and the RIVER 2A Transition. Which of the following statements is correct?",
    "feedback": "Between SOKSI and EH614 a continuous descent path is to be flown from 4000 ft to 2900 feet"
  },
  {
    "question": "RVSM In-Flight procedure: Cross checks of the primary altimeters shall be made at intervals of approximately one hour. These primary altimeters shall agree within",
    "feedback": "200 ft"
  },
  {
    "question": "The block fuel for an IFR flight with a single engine aircraft was 200 lbs.\nAlternate fuel = 40 lbsFinal reserve fuel = 50 lbsTaxi fuel = 10 lbs\nAfter a flight time of 36 minutes the remaining fuel is 110 lbs.\nConsidering a constant fuel flow, the remaining flight time to fly to the destination, landing with required fuel reserve fuel is:",
    "feedback": "9 min."
  },
  {
    "question": "In terms of the flight method used to conduct an approach, which type does the following definition describe?\n\"Approaches have lateral and vertical guidance, the flight path can use a Course Deviation Indicator (CDI) and Glide Path (GP) indicator.\"",
    "feedback": "3D"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1)\nGiven: Long range cruise, OAT -45°C at FL 350, Gross mass at the beginning of the leg 40000 kg, Gross mass at the end of the leg 39000 kg\nFind: True air speed (TAS) and cruise distance (NAM) for a twin jet aeroplane",
    "feedback": "TAS 433 kt, 227 NAM"
  },
  {
    "question": "For pre-flight planning purposes, what is the block fuel required?\n(assume the Basic Fuel Scheme with variations applies)\nTaxi fuel: 350 kgTrip fuel: 85000 kgContingency fuel: 5 % of the trip fuelFinal reserve fuel: 3000 kgAlternate fuel: 5500 kgExtra fuel: 0 kgDiscretionary fuel: 1500 kg",
    "feedback": "99600 kg"
  },
  {
    "question": "Refer to the extract of the OFP:\n\nThe distance between waypoints MIPAK and LADER is:",
    "feedback": "31 NM"
  },
  {
    "question": "What is the position of the Aerodrome Reference Point at Esbjerg?",
    "feedback": "55°31.6'N 008°33.1'E"
  },
  {
    "question": "(For this question use Flight Planning Manual MEP 1 Figure 3.2) A flight is to be made in a multi engine piston aeroplane (MEP1). The cruising level will be 11000ft. The outside air temperature at FL is -15 ° C. The usable fuel is 123 US gallons. The power is set to economic cruise. Find the range in NM with 45 min reserve fuel at 45 % power.",
    "feedback": "752 NM"
  },
  {
    "question": "In the ATS flight plan Item 15, a cruising speed of 90 kts will be entered as :",
    "feedback": "N0090"
  },
  {
    "question": "The Landing Mass at destination is defined as the sum of:",
    "feedback": "Zero fuel mass, final reserve fuel, alternate fuel and contingency fuel"
  },
  {
    "question": "Which approach segment starts at the point where you report \"established\" ?",
    "feedback": "Intermediate approach"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)4\nWhat is the type of navaid and frequency at position N45°33.56' E009°30.42')?",
    "feedback": "VORDME TZO, 111.8 MHz"
  },
  {
    "question": "If your destination airport has no ICAO indicator, in the appropriate box of your flight plan, you write:",
    "feedback": "ZZZZ"
  },
  {
    "question": "Refer to GSPRM Stuttgart, chart 10-3P\nBefore departure from Rwy 25 of the Stuttgart (EDDS) aerodrome, the message \"GPS INOP\" appears on your GNSS display. What SID should be followed in this case?",
    "feedback": "Conventional departure DKB 9B"
  },
  {
    "question": "For the purposes of Item 9 (Wake turbulence category) of the ATS flight plan, an aircraft with a maximum certificated take-off mass of 62000 kg is :",
    "feedback": "medium \"M\""
  },
  {
    "question": "For pre-flight planning purposes, what is the minimum fuel required for a commercial air transport flight with a jet aircraft, given the following information?\n(assume the Basic Fuel Scheme without variations applies)\nTrip fuel: 3780 kgFuel to alternate: 987 kgTaxi fuel: 120 kgFuel flow at 1500 feet above destination alternate aerodrome: 2232 kg/hExtra fuel: 0 kgDiscretionary fuel: 0 kg",
    "feedback": "6192 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM Nantes, charts 19-1, 19-2, 19-3:\nYou intend to depart from Nantes airfield by following the Loire River towards the Northeast, but without overflying the city of Nantes. Which reporting point instructions are to be expected from ATC?",
    "feedback": "NE, 1000 ft"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1, Figure 4.7.3)\nGiven:\nDiversion distance 650 NM Diversion pressure altitude 16 000 ft Mass at point of diversion 57 000 kg Head wind component 20 kt Temperature ISA + 15°C\nThe diversion (a) fuel required and (b) time, are approximately :",
    "feedback": "(a) 4800kg (b) 2h 03min"
  },
  {
    "question": "Refer to Jeppesen GSPRM - VFR Chart ED-4\nA VFR flight is planned from Pfarrkirchen (EDNP, N48°25.22' E012°51.88') to Thalmässing-Waizenhofen (EDPW, N49°03.85' E011°12.57'). Weather: OVC 085, Q1013. Neither Munich airspace C, nor restricted areas are to be penetrated. The appropriate route is:",
    "feedback": "From EDNP via RDG VORDME (N49°02.4' E012°31.6') to EDPW, altitude 6500 ft."
  },
  {
    "question": "For turbojet engine driven aeroplane, given: Taxi fuel 600 kg Fuel flow for cruise 10 000 kg/h Fuel flow for holding 8 000 kg/h Alternate fuel 10 200 kg Planned flight time to destination 6 h Forecast visibility at destination 2000 m The minimum ramp fuel required is:",
    "feedback": "77 800 kg"
  },
  {
    "question": "Given:\nMissed approach at the destination: 6 minClimb to cruise level: 7 minCruise distance: 85 NMCruise TAS: 165 ktTailwind: 10 ktExpected holding at the alternate: 10 minDescent to the alternate: 6 minApproach to the alternate: 7 min\nCalculate the time from the destination to the alternate for this commercial flight.",
    "feedback": "65 min"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Tromso, chart 12-2\nThe FAF for a RNAV (GNSS) Rwy 19 approach is:",
    "feedback": "BAXAS"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, charts 19-1, 19-2, 19-3\nWhat is your maximum allowed altitude for an approach from the southeast via reporting point SE and cleared for the Tabarca route?",
    "feedback": "1500 ft AMSL"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Tromso, chart 12-1\nAn appropriate IAF for the RNAV (GNSS) Rwy 01 approach is:",
    "feedback": "REBLI"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Appendix 2, Flight Plan\nItem 9: B738/MItem 10: SDGIRWYZ/SB1Item 13: EDFH1225Item 15: N0379F230 DIK2S DIK UN857 TOLVU/N0387F250 UN857 RAPOR/N0410F280 UN 857 RENSA/N0435F330 UN857 NITEP/N0440F360 UN857 GIMER UT 300 PON UN872 ATLEN/N0452F380 DCT ABUPI DCT XAMAX DCT SRA DCT DEKUS DCT BEXAL UN866 KONBAItem 16: GCTS0428 GCXOItem 18: EET/EBUR0010 LFFF0017 LECM0137 LPPC0202 GMMM0300 GCCC0350\nChoose a correct statement with reference to the above flight plan data:",
    "feedback": "It is approved for RVSM airspace"
  },
  {
    "question": "(for this question use MRJT1, figure 4.5.4b)\nWhat is the time, fuel required and nautical air miles to descend from FL350 to sea level in turbulent air given an estimated landing weight of 50000 kg?",
    "feedback": "20 min, 275 kg, 99 NAM"
  },
  {
    "question": "(for this question is MRJT1, Figure 4.7.2)\nUsing the table, in ISA conditions and at a speed of M.70/280KIAS, in an elapsed time of 90 minutes an aircraft with mass at point of diversion 48000 kg could divert a distance of :",
    "feedback": "584 NM"
  },
  {
    "question": "(for this question use MRJT1, figure 4.5.4a) Planning an IFR flight from Paris to London for the twin jet aeroplane.  Given: Estimated Landing Mass 49700 kg, FL 280, W/V 280°/40 kt, Average True Course 320°, Procedure for descent .74 M/250 KIAS  Determine the distance from the top of descent to London (elevation 80 ft).",
    "feedback": "76 NM"
  },
  {
    "question": "An aircraft on a track of 240°(M) has to overfly an obstacle of 25700 ft with a clearance of 2000 ft. The QNH is 1033 hPa and the OAT is ISA +10°C. What is the minimum flight level (FL) at which the aircraft may fly in RVSM airspace?\n(assume 1 hPa = 30 ft)",
    "feedback": "FL300"
  },
  {
    "question": "Refer to the figure.\nFor pre-flight planning purposes, calculate the total fuel required for a commertical air transport flight with a Performance Class A aeroplane, given the following information.\nThe weather at the destination aerodrome is forecast to be below the applicable minima, but two alternates with suitable weather have been chosen. The flight's payload means that mimumum block fuel will be taken.\n(assume the Basic Fuel Scheme without variations applies)\nTaxi fuel: 230 kgTrip distance: 250 NGMAverage wind component: 50 kt headwindHolding fuel flow: 2400 kg/hExpected landing mass: 65000 kgDestination alternate 1 fuel: 1230 kgDestination alternate 2 fuel: 1950 kgAdditional fuel: 0 kgExtra fuel: 0 kgDiscretionary fuel: 0 kg",
    "feedback": "5805 kg"
  },
  {
    "question": "(For this Question use Flight Planning Manual SEP 1, Fig. 2.3 Table 2.3.1)  Using the Power Setting Table, for the single engine aeroplane, determine the cruise TAS and fuel flow (lbs/hr) with full throttle and cruise lean mixture in the following conditions given: OAT 3° C Pressure altitude 6000 ft Power Full throttle/21,0 in/Hg/2100 RPM",
    "feedback": "134 kt and 55.7 lbs/hr"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)6\nAn aircraft flies IFR on airway G7 from BAGUR 112.2 BGR (N41°56.87' E003°12.54') to BARCELONA 116.7 BCN (N41°18.43 ' E002 06.47'). What is the magnetic track and an appropriate flight level for this leg?",
    "feedback": "232°, FL210"
  },
  {
    "question": "When approaching a cleared Flight level, the vertical speed should not exceed",
    "feedback": "1500 ft/min."
  },
  {
    "question": "Given the following data for the pre-flight calculations, determine the required alternate fuel for a commercial air transport flight.\n(assume the Basic Fuel Scheme without variations applies)\nFuel for a missed approach at destination: 280 kgFuel for the climb to cruise level: 900 kgCruise distance to the alternate: 230 NMCruise fuel consumption: 6.5 kg/NAMFuel for the descent to the alternate: 125 kgFuel for the approach and landing at the alternate: 220 kgHolding fuel flow at the alternate: 2000 kg/hFuel for a missed approach at the alternate: 230 kgExtra fuel: 0 kgDiscretionary fuel: 0 kg",
    "feedback": "3020 kg"
  },
  {
    "question": "After an engine failure, the commander of a Medium Range Jet Transport (MRJT) aeroplane executes a drift-down procedure and stabilizes at a cruising altitude significantly below the normal cruising altitude. His/her decision to proceed to an adequate alternate increases the fuel consumption significantly, compared to the planned consumption. Although he/she has planned for trip fuel, contingency fuel, alternate fuel and final reserve fuel, he/she has not included a sufficient quantity in the fuel planning for this engine-out situation. Which option is correct for the above scenario?",
    "feedback": "The additional fuel ensures that sufficient fuel is carried for such an event"
  },
  {
    "question": "(For this question Flight Planning Manual MRJT 1 Figure 4.5.3.1) Given :FL 330; long range cruise; OAT -63°C; gross mass 50 500 kg. Find: true airspeed (TAS)",
    "feedback": "420 kt"
  },
  {
    "question": "An aircraft is flying from point A to point B. In the cruise, it has a calibrated airspeed of 150kt, a true airspeed of 180 kt, and an average groundspeed of 210 kt, The speed box of the ATS flight plan shall be filled as follows:",
    "feedback": "N0180"
  },
  {
    "question": "Refer to GSPRM Stuttgart, charts 11-1, 11-1A, 11-2, 11-2A\nAn aircraft departed Stuttgart airport from Rwy 25, but due to a passenger's serious illness, the pilot decided to turn back and land at Stuttgart airport, following the ILS CAT I Rwy 25 approach procedure. Which approach chart is to be used by the pilot?",
    "feedback": "11-2"
  },
  {
    "question": "You must fly IFR on an airway orientated 135° magnetic with a MSA at 7 800 ft. Knowing the QNH is 1 025 hPa and the temperature is ISA + 10°, the minimum flight level you must fly at is:",
    "feedback": "90"
  },
  {
    "question": "Which of the following statements regarding GNSS is correct?",
    "feedback": "Receiver autonomous integrity monitoring (RAIM) is a technique that ensures the integrity of the provided data by redundant measurements"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1) Given : Distance C - D : 680NM Long Range Cruise at FL340 Temperature Deviation from ISA : 0° C Headwind component : 60 kt Gross mass at C : 44 700 kg The fuel required from C - D is :",
    "feedback": "3700 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM Alicante, chart 10-2B:\nThere is a sea breeze in Alicante. Which arrival route do you expect?",
    "feedback": "CLS 1L and VLC 2L"
  },
  {
    "question": "Responsible for terrain separation for IFR flights at night, along an ATS route, is the .....",
    "feedback": "Pilot-in-Command"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, charts 19-1, 19-2, 19-3\nWhat is the distance between reporting points N and NE?",
    "feedback": "13 km"
  },
  {
    "question": "Which arrival route has the longest distance to LADVI?",
    "feedback": "DARAX"
  },
  {
    "question": "During the pre-flight briefing process, the pilot-in-command of a commercial air transport flight notices that a thunderstorm activity is predicted along the planned route, which may cause deviations of more than 50 NM from the route. To determine the minimum ramp fuel, what should the pilot-in-command do, provided that the above deviation will increase the distance to be flown?",
    "feedback": "The pilot-in-command should add an appropriate amount of fuel as part of the extra fuel"
  },
  {
    "question": "The image shows a partially completed navigation plan from Ajaccio aerodrome (LFKJ), elevation 17 ft. If your rate of climb is 1000 ft/min, at what distance from AJO will you reach FL130?",
    "feedback": "18 NM"
  },
  {
    "question": "Refer to Jeppesen GSPRM, Chart E(HI)4 \nWhich navigation aid is located in position 52°15.6'N, 020°39.4'E ?",
    "feedback": "VOR/DME"
  },
  {
    "question": "The \"total estimated elapsed time\" in block 16 of a VFR flight plan is the estimated time:",
    "feedback": "required by the aircraft from take-off to arrive overhead the destination airport"
  },
  {
    "question": "(For this question use Flight Planning Manual MRJT 1 Figure 4.3.1.B)\nGiven the following data for a twin-jet aeroplane:\nZero fuel mass: 50000 kgLanding Mass at alternate: 52000 kgFinal reserve fuel: 2000 kgAlternate fuel: 1000 kg\nFlight to destination:Distance; 720 NMTrue Course: 030°Wind: 340°/30 ktsCruise: FL330/LRCOAT: -30°C\nFind : estimated trip fuel and time with simplified flight planning.",
    "feedback": "4 800 kg; 01 : 51"
  },
  {
    "question": "Minimum planned take-off fuel is 160 kg (30% total reserve fuel is included). Assume the groundspeed on this trip is constant. When the aeroplane has done half the distance the remaining fuel is 70 kg. Is diversion to a nearby alternate necessary?",
    "feedback": "Diversion to a nearby alternate is necessary, because the remaining fuel is not sufficient."
  },
  {
    "question": "(For this question use Flight Planning Manual MRJT 1 Figure 4.5.1) Given : brake release mass 57 500 kg temperature ISA -10°C; head wind component 16 kt initial FL 280 Find: still air distance (NAM) and ground distance (NM) for the climb",
    "feedback": "62 NAM; 59 NM"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1 Figure 4.3.4)\nWhat is the fuel required, given the following information?\nDistance: 350 NMCruise conditions: FL210/300 KIASTailwind component: 70 ktsLanding Mass: 53000 kg",
    "feedback": "2470 kg"
  },
  {
    "question": "Refer to GSPRM Stuttgart, charts 10-3C, 10-3D, 10-3F and 10-3L\nWhich SID procedures would be suitable for a flight of a jet aircraft from Stuttgart aerodrome (EDDS, N48°41'24 E009°13'19) to Saarbrucken aerodrome (EDDR N49°12'52 E007°06'34)?",
    "feedback": "KARLSRUHE 5B or KARLSRUHE 2H"
  },
  {
    "question": "Refer to the table.\nThe sector time from WPT C to DEST in line 4 of the Navigation Plan is (1) .... and the accumulated time to the ALTN in line 5 is (2) ....",
    "feedback": "(1) 11 minutes; (2) 1 hour and 25 minutes"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Amsterdam, chart 16-2\nWhat is the MDA for the NDB approach to runway 18C?",
    "feedback": "690 ft"
  },
  {
    "question": "Which best describes the maximum intensity of CAT, if any, forecast for FL 330 over Benghazi (32°N 020°E) ?",
    "feedback": "Nil"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(LO)2\nWhat is an appropriate flight level on airway P18, which can continuously be maintained, from POLE HILL 112.1 POL (N53°44.6' W002°06.2') to NATEB?",
    "feedback": "FL140"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1, 3.1 Simplified Planning Chart Corrections)\nBefore departure, the APU is run for 15 minutes. The taxi time is expected to be 10 minutes. The APU uses an additional 5 kg of fuel to start.\nWith the figures given in the table, calculate the fuel consumption on the ground.",
    "feedback": "approx. 144 kg"
  },
  {
    "question": "The commercial air transport flight shall be conducted so that the expected usable remaining fuel on arrival at the destination aerodrome is not less than the sum of the ....",
    "feedback": "alternate fuel and the final reserve fuel"
  },
  {
    "question": "What is an LPV approach?",
    "feedback": "An approach with vertical guidance based on GNSS augmented by a space based facility"
  },
  {
    "question": "Refer to GSPRM Stuttgart, chart 11-2\nWhat is the MSA for an approaching aircraft which is following the course 085° when it is 14 NM away from the VOR station?",
    "feedback": "3300 ft"
  },
  {
    "question": "What is the primary reason for the pre-flight study of the anticipated SID and STAR? To ensure that...",
    "feedback": "the aircraft is guided along the correct lateral and vertical profiles"
  },
  {
    "question": "Refer to Jeppesen GSPRM - De Kooy, chart 11-1\nWhat is the frequency and the QDM of the ILS at the De Kooy aerodrome?",
    "feedback": "108.9, 214°(M)"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(HI)1\nAn aeroplane has to fly from AALBORG 116.7 AAL (N57°06.02' E009°59.7') to BAVTA (N55°36.2' E008°18.0') on airway N607. What is the track distance for this flight?",
    "feedback": "106 NM"
  },
  {
    "question": "Act Hdg 290° TAS 250 Kts Wind 135/75Kt GS?",
    "feedback": "320 Kts"
  },
  {
    "question": "The trip fuel for a commercial air transport flight must consider.....",
    "feedback": "the expected departure and arrival routing"
  },
  {
    "question": "Refer to the NOTAM attached and find the lower limit of the ZRT:",
    "feedback": "Ground"
  },
  {
    "question": "From which of the following would you expect to find facilitation information (FAL) regarding customs and health formalities ?",
    "feedback": "AIP (Air Information Publication)"
  },
  {
    "question": "Determine the maximum attainable flight time and range, given the following information:\nAverage fuel flow: 9.2 USG/hrAvailable fuel: 42 USGTAS: 145 ktWind component: 20 kt headwind\nThe flight time is (1) .... and the range is (2) ....",
    "feedback": "(1) 4 hours 34 minutes, (2) 571 NM"
  },
  {
    "question": "The purpose of the 'Reduced Contingency Fuel (Decision point) Procedure' is to reduce the:",
    "feedback": "Minimum required fuel and therefore be able to increase the load"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1, fig. 4.3.6)\nGiven : Distance to Alternate :   400 NM\nLanding mass at Alternate :       50 000kg\nHeadwind component :              25 kt\nThe alternate fuel required is :",
    "feedback": "2800 kg"
  },
  {
    "question": "Contingency fuel is carried to account for ....",
    "feedback": "unforeseen factors that could have an influence on the fuel consumption to the destination aerodrome"
  },
  {
    "question": "Refer to GSPRM, Stuttgart chart 11-1\nA pilot is under radar vectors in order to position for an ILS approach to runway 07. ATC clears the aircraft to descend to 4000 ft on a heading of 105° to establish on and follow the ILS. Suddenly a complete electrical failure occurs and all navigation instruments are lost, except for the standby compass. If the aircraft is in cloud, what is a safe altitude for the pilot to maintain while trying to restore the navigation equipment?",
    "feedback": "4600 ft as this is the highest MSA around the airport"
  },
  {
    "question": "(For this question use Flight Planning Manual MRJT 1 Figure 4.7.2)\n\nFor the purpose of planning an extended range flight it is required that with a start of diversion mass of 55000kg a diversion of 600 nautical miles should be achieved in 90 minutes. Using the above table, the only listed cruise technique to meet that requirement is :",
    "feedback": "M/KIAS .74/330"
  },
  {
    "question": "Some approaches are labelled RNP APCH. These approaches are based on GNSS and can be recognised on the charts by ....",
    "feedback": "LNAV and/or LNAV/VNAV minima being published"
  },
  {
    "question": "Refer to Jeppesen GSPRM, chart E(LO)1\nWhat is the distance from WICK (N58°27', W003°06') to NANEV?",
    "feedback": "57 NM"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1, Figure 4.3.1c)\nFor a flight of 2400 ground nautical miles the following apply:\nTailwind component: 25 ktsTemperature: ISA -10°CCruise altitude: 31000 ftLanding Mass: 52000 kg\nThe trip fuel and trip time respectively are:",
    "feedback": "14200 kg: 5 hrs 30 min"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Galbraith Lake, Alaska, chart 11-7\nWhich of the following is correct with regard to the MLS Rwy 13 approach?",
    "feedback": "The final approach course is 130°"
  },
  {
    "question": "Unless otherwise shown on charts for standard instrument departure the routes are given with:",
    "feedback": "magnetic course"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, charts 19-1, 19-2, 19-3\nWhat is the magnetic bearing from reporting point N to NE?",
    "feedback": "066°"
  },
  {
    "question": "You are flying a constant compass heading of 252°. Variation is 22°E, deviation is 3°W and your INS is showing a drift of 9° right. True track is ?",
    "feedback": "280°"
  },
  {
    "question": "Planned and actual data as shown in the Flight Log excerpt.\n\nProvided that flight conditions on the leg GAMMA to DELTA remain unchanged and fuel consumption remains unchanged, what fuel remaining should be expected at waypoint DELTA?",
    "feedback": "4690 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Alicante, chart 10-1P\nAfter landing, an appropriate communication frequency to notify Alicante, when the \"RWY vacated\" sign is crossed after leaving runway 28, is:",
    "feedback": "118.150 MHz"
  },
  {
    "question": "Assuming a departure/destination fuel price ratio of 0.92, the commander decides to optimize fuel tankering by using the following data:\n. Cruise flight level: FL 350\n. Air distance to be covered: 1 830 NM\n. Planned take-off mass: 190 000 kg (with a minimum prescribed fuel quantity of 30 000 kg that includes a trip fuel of 22 000 kg)\n. Maximum landing mass: 180 000 kg\n. Maximum take-off mass: 205 000 kg\n. Maximum tank capacity: 40 000 kg\nThe additional fuel quantity will be:",
    "feedback": "10 000 kg"
  },
  {
    "question": "The flight crew of a turbojet aeroplane prepares a flight using the following data:\n. Take-off mass: 168 500 kg\n. Flight leg ground distance: 2 000 NM\n. Flight level FL 370; \"Long Range\" flight regime \n. Tailwind component at this level: 30 kt\n. Total anti-ice set on \"ON\"\n. Fixed taxi fuel: 500 kg; final reserve: 2 000 kg\n. Ignore alternate fuel.\nThe effects of climb and descent are not corrected for consumption.\nThe prescribed quantity of trip fuel for the flight leg is:",
    "feedback": "20 500 kg"
  },
  {
    "question": "What is the temperature deviation (°C) from ISA over 60°N 000°E ?",
    "feedback": "-9"
  },
  {
    "question": "Which equipment is not necessary to get a RVSM approval?",
    "feedback": "GPS with altitude reporting system"
  },
  {
    "question": "Given:\nQ) EUAD/QWCLW/IV/M/W/000/004/5339N00135W001A) EUADB) FROM: 15/12/14 13:48C) TO: 16/03/06 18:30E) UNMANNED CAPTIVE BALLOON IN LOW FLYING AREA AVOIDANCE AREA WI 1NM RADIUS. MAX HEIGHT 200FTAGL/324FT AMSL. 15/12/06/0PSLF. LOWER: Surface, UPPER: 324 Feet AMSL SCHEDULE: DEC 14 1348-1600, DEC 15-31 0700-1600, JAN 01-31 0700-1630, FEB 01-29 0700-1730, MAR 01-06 066-1830\nThe maximum height of the balloon is ......",
    "feedback": "200 ft AGL"
  },
  {
    "question": "For pre-flight planning purposes, what is the minimum block fuel required for the commercial air transport flight in a Medium Range Jet Transport MRJT aeroplane, given the following information?. The operator has nominated a suitable en-route alternate aerodrome.\n(assume the Basic Fuel Scheme without variations applies)\nDeparture taxi fuel: 150 kgTrip fuel: 2101 kgAlternate fuel: 2046 kgDestination taxi fuel: 250 kgAverage fuel flow: 3317 kg/hHolding fuel flow: 2735 kg/hExtra fuel: 0 kgDiscretionary fuel: 0 kg",
    "feedback": "5893 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Amsterdam airport EHAM\nSelect the correct coordinates for the Airport Reference Point from the appropriate chart:",
    "feedback": "N52°18.5 E004°45.9'"
  },
  {
    "question": "Given the following information for a commercial air transport operation, calculate the maximum possible extra fuel to be uplifted.\nMaximum zero fuel mass MZFM: 2000 kgActual zero fuel mass AZFM: 1800 kgRegulated take-off mass RTOM: 3000 kgMaximum landing mass MLM: 2600 kgFuel tank capacity: 950 kgTrip fuel TF: 770 kgMinimum block fuel BF: 950 kg",
    "feedback": "Not able to carry extra fuel"
  },
  {
    "question": "Planned and actual data as shown in the Flight Log excerpt (Fuel Planning Section).\n\nAfter a balked landing at the destination airport, you have to divert to the alternate airport with the gear extended. The re-calculated flight time to the alternate due to the reduced speed is 1h 20 min and the fuel flow will be 720 kg/h. \nFinal Reserve Fuel remains unchanged.\nWhat will be the estimated landing mass at the alternate airport?",
    "feedback": "5874 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM, chart E(LO)2\nYou are completing a low level flight over the sea and have just been diverted south towards land. Which frequency should you use overhead GOLVO (54°24'41\"N, 003°35''8\"E)?",
    "feedback": "AMSTERDAM INFORMATION, 119.17 MHz"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Dubrovnik, charts 19-1, 19-2\nWhat is the specified altitude following the arrival route from Sv. Adrija Island?",
    "feedback": "1500 ft AMSL"
  },
  {
    "question": "RVSM Pre-Flight procedure: The flight crew shall verfiy the altimetry accuracy by setting the QNH or QFE. The reading should then agree with the altitude of the apron or the zero height indication within",
    "feedback": "75 ft"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Tromso, chart 10-2E\nWhat is the correct procedure on the AMIMO 7Z arrival after loss of RNAV 1 capability?",
    "feedback": "request vectoring"
  },
  {
    "question": "The planned flight is over a distance of 400 NM. Based on the wind charts at altitude the following components are found: FL50: -30kt; FL70: -50kt; FL90: -50kt. Refer to the details of the aircraft's performance below.\n\nWhich of the following flight levels (FL) gives the best range performance?",
    "feedback": "FL 050"
  },
  {
    "question": "Refer to Jeppesen GSPRM Alicante, chart 10-3A.\nAn aircraft receives the following ATC clearance from Alicante (LEAL) Delivery:\n\"Cleared to destination via CATON 2C standard departure from runway 28, squawk 4017\".\nWhat are the altitude/FL restrictions during a CATON 2C SID?",
    "feedback": "At or above 3100 ft at 9.5 NM from ALTAt or above FL80 at VILNAAt or above FL110 at NARGOAt or below FL230 at CATON"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Amsterdam, chart 13-4\nWhat outbound QDR should be flown when carrying out the procedure turn in a category A aeroplane?",
    "feedback": "121°"
  },
  {
    "question": "The following NOTAM is given:\nQ) EUAD/QNVAS/IV/BO/E/000/999/5 221N00140W025B) FROM: 17/02/09 12:30C) TO: 17/02/09 16:30E) HENTON DVOR/DME HEN FREQ 113.65 MHZ/CH 083Y, DVOR U/S\nAt what date and time should HENTON DVOR come back into service?",
    "feedback": "9 February 2017, 16:30"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Chart E(HI)11\nWhat is the minimum ICAO (non-RVSM) IFR cruising level when flying eastbound between FLORENCE 115.2 FRZ (N44°01.6' E011°00.2') and ANCONA 110.65 ANC (N43°35.2' E013°28.3')?",
    "feedback": "FL250"
  },
  {
    "question": "Comparing the integrated range and the average fuel flow procedure, which of the following statements is correct?",
    "feedback": "The integrated range procedure is more accurate and reflects the different fuel flows during different phases of flight"
  },
  {
    "question": "Refer to Jeppesen GSPRM - De Kooy, chart 18-1\nWhat is the final approach course (i) and DA (ii) for a straight-in landing on runway 21?",
    "feedback": "(i) by ATC, (ii) 500 feet"
  },
  {
    "question": "For pre-flight planning purposes, what is the minimum useable fuel required for the commercial air transport flight, given the following information?\n(assume the Basic Fuel Scheme without variations applies)\nEstimated taxi time: 13 minutesAPU fuel flow: 115 kg/hTaxi fuel flow: 11 kg/minSum of trip fuel and contingency fuel: 5420 kgDestination alternate fuel: 1400 kgFinal reserve fuel: 1250 kgExtra fuel: 0 kgDiscretionary fuel: 0 kgEstimated length of time of APU use: 38 minutes",
    "feedback": "8286 kg"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Nantes, charts 19-1, 19-2, 19-3\nWhat is a valid Special VFR minimum for an operation at Nantes?",
    "feedback": "Minimum visibility with IFR traffic 5000 m"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1, 3.1 Simplified Planning Chart Corrections)\nCalculate the taxi fuel for a commercial flight if the APU is used at the parking position for 35 minutes and the planned taxi time is 15 minutes at both, the departure and the destination:",
    "feedback": "232 kg"
  },
  {
    "question": "(For this Question use Flight Planning & Monitoring MEP1, fig. 3.3)\nA flight has to be made with a multi engine piston aeroplane. For the fuel calculations take 5 US gallons for the taxi, and an additional 13 minutes at cruise condition to account for climb and descent. Calculated time overhead to overhead is 2h37min. Powersetting is 65%, 2500 RPM. Calculated reserve fuel is 30% of the trip fuel. FL 120. Temperature 1°C. Find the minimum block fuel.",
    "feedback": "91 US gallons."
  },
  {
    "question": "Excluding RVSM an appropriate flight level for IFR flight in accordance with semi-circular height rules on a course of 180°(M) is:",
    "feedback": "FL100"
  },
  {
    "question": "Refer to Jeppesen GSPRM - Galbraith Lake, Alaska, chart 11-7\nWhat is the MDH for an AZ approach (GP out)?",
    "feedback": "1257 ft"
  },
  {
    "question": "An aircraft on a track of 046°(M) has to fly over an obstacle of 4600 ft with a clearance of 1000 ft. The QHN is 990 hPa and the temperature is ISA -15°C. What is the minimum safe flight level at which the aircraft may fly?\n(assume 1 hPa = 30 ft)",
    "feedback": "FL70"
  },
  {
    "question": "An IFR flight is planned outside airways on a course of 235° magnetic. The minimum safe altitude is 7800 ft. Knowing the QNH is 995 hPa, the minimum flight level you must fly is:",
    "feedback": "100"
  },
  {
    "question": "In an ATS flight plan item 15, how do you insert waypoint ROMEO, a speed of 120 kt and a cruising level FL085?",
    "feedback": "ROMEO/N0120F085"
  },
  {
    "question": "Refer to the figure.\nWith regard to the given OFP, which statement is correct concerning the ground speed experienced between WPT1 and WPT2 when the accumulated flight time after this segment was equal to 27 minutes?",
    "feedback": "The GS is equal to approximately 100 kt"
  },
  {
    "question": "The Airway is orientated 135° magnetic with an MSA at 7800 ft, QNH 1025 hPa, temperature ISA + 10°.\nSelect the minimum flight level to be flown on an IFR flight from the answers:",
    "feedback": "FL090"
  },
  {
    "question": "(For this Question use Fuel Planning MRJT1, Table 4.1, Figure 4.1) Find the fuel mileage penalty for the twin jet aeroplane with regard to the given flight level. Given:   Long range cruise, Cruise mass=53000 kg, FL 310",
    "feedback": "4 %"
  },
  {
    "question": "Refer to the Navigation Flight Plan.\nComplete line 3 for the sector WPT B to WPT C. What is the sector time from WPT B to WPT C and the accumulated time to DEST?",
    "feedback": "WPT B to WPT C: 25 minutes, accumulated time 52 minutes"
  }
]