[
  {
    "question": "The ILS glidepath is 2,8°. At what altitude above the threshold level is the upper limit of the glide path coverage at a distance of 1,5 NM from the touchdown point?",
    "feedback": "745 feet"
  },
  {
    "question": "The DME reading is 100 NM (DME installed after 1989). The error of the DME reading shall, according to ICAO Annex 10, not exceed:",
    "feedback": "0.2 NM"
  },
  {
    "question": "A VDF may be used:",
    "feedback": "to provide the ATC controller with bearings of aircraft in the absence of radar"
  },
  {
    "question": "What is the minimum number of satellites required by a GPS in order to obtain a three dimensional fix?",
    "feedback": "4"
  },
  {
    "question": "The system capable of measuring on the ground the signal errors transmitted by GNSS satellites and transmitting differential corrections and integrity messages for navigation satellites is:",
    "feedback": "SBAS"
  },
  {
    "question": "Which of the following lists information required to input a waypoint or 'Phantom Station' into a basic VOR/DME-based Area Navigation System?",
    "feedback": "Radial and distance from a VOR/DME to the waypoint or 'Phantom Station'"
  },
  {
    "question": "In aviation electronic systems the so-called Doppler principle may be used in",
    "feedback": "VOR, GPS and MTI and the turbulence mode of AWR"
  },
  {
    "question": "The FMS can be used to check the estimated position error (EPE) of the FMS position. What does this value mean to the pilot?",
    "feedback": "The EPE value must be equal to or less than the required navigation specification"
  },
  {
    "question": "What are additional aircraft parameters that are downlinked from Mode S Enhanced Surveillance (EHS) transponders?\n1) pitch angle2) vertical rate3) track angle rate or TAS4) true track angle",
    "feedback": "2, 3, 4"
  },
  {
    "question": "Under CS-25 colour code rules for Electronic Flight Instrument Systems (EFIS), turbulence is coloured:",
    "feedback": "white or magenta"
  },
  {
    "question": "VHF (Very High Frequency) waves appear in the frequency spectrum:",
    "feedback": "30 MHz - 300 MHz"
  },
  {
    "question": "In a primary radar using pulse technique, the ability to discriminate between targets in azimuth is a factor of:",
    "feedback": "beam width"
  },
  {
    "question": "Using primary radar, super refraction may play a role, because",
    "feedback": "Super refraction may cause the direct wave range to be considerably increased"
  },
  {
    "question": "What are the characteristics of a satellite based augmentation system?",
    "feedback": "The system is limited to areas of a certain proximity to the equator due to the nature of the transmission of the correction signal via geostationary satellite"
  },
  {
    "question": "What should be considered regarding the settings on the Airborne Weather Radar (AWR) by the crew of an aircraft lined up on the departure runway and with a thunderstorm in the vicinity?",
    "feedback": "Tilt should be UP"
  },
  {
    "question": "The Difference of Depth of Modulation (DDM) between the 90 Hz and the 150 Hz signal of the ILS localizer:",
    "feedback": "increases with displacement from the centreline"
  },
  {
    "question": "Operation in RNAV 10 airspace requires as a minimum a certain number of independent and serviceable Long Range Navigation Systems (LRNSs). The minimum equipment required consists of at least ......",
    "feedback": "two LRNSs comprising an INS, an IRS FMS or a GNSS"
  },
  {
    "question": "What is the maximum number of usable Secondary Surveillance Radar (SSR) transponder codes?",
    "feedback": "4096"
  },
  {
    "question": "The two main design functions of Secondary Surveillance Radar (SSR) Mode S are:",
    "feedback": "air to ground and ground to air data link communications and improved ATC aircraft surveillance capability"
  },
  {
    "question": "Which statement about a Satellite Based Augmentation System (SBAS) is correct?",
    "feedback": "SBAS is able to provide guidance for non-precision approaches with vertical guidance"
  },
  {
    "question": "Define performance based navigation (PBN):",
    "feedback": "Area navigation based on performance requirements for aircraft operating along an ATS route, on an instrument approach procedure or in a designated airspace"
  },
  {
    "question": "What is the function of the control segment in GPS NAVSTAR?",
    "feedback": "To ensure that the transmitted data of the satellites is controlled and updated from time to time by ground stations"
  },
  {
    "question": "What causes garbling in an SSR?",
    "feedback": "A phenomena that happens in the ground receiver due to superposition of two replies from different transponders"
  },
  {
    "question": "According to the ICAO PBN Manual, in order to satisfy the strategic objectives safety, capacity, efficiency, environment and access, the \"airspace concept\" has been developed. This is achieved by enhancements in:\n1) Communications (COM)2) Navigation (NAV)3) Surveillance (SUR)4) Air Traffic Management (ATM)",
    "feedback": "1, 2, 3, 4"
  },
  {
    "question": "Ignoring pulse length and fly-back, a radar facility designed to have a maximum unambiguous range of 50 km will have a PRF (pulses per second) of:",
    "feedback": "3000"
  },
  {
    "question": "The frequency of an SSR ground transmission is:",
    "feedback": "1030 +/- 0.2  Mhz"
  },
  {
    "question": "Which of the following data, in addition to the Pseudo Random Noise (PRN) code, forms part of the so called 'Navigation Message' transmitted by NAVSTAR/GPS satellites?",
    "feedback": "almanac data; satellite status information"
  },
  {
    "question": "Which of the following statements is correct regarding User Equivalent Range Error (UERE)?",
    "feedback": "The UERE in combination with the Geometric Dilution of Precision (GDOP) allows for an estimation of position accuracy"
  },
  {
    "question": "Which of the following system are considered satellite based augmentation systems?",
    "feedback": "EGNOS, WAAS"
  },
  {
    "question": "An aircraft is required to approach a VOR via the 104° radial. Which of the following settings should be made on the VOR/ILS deviation indicator?",
    "feedback": "284° with the TO flag showing"
  },
  {
    "question": "Given: Course Deviation Indicator (CDI) for a VOR is selected to 090°.\nFrom/To indicator indicates \"TO\".\nCDI needle is deflected halfway to the right.\nOn what radial is the aircraft?",
    "feedback": "275"
  },
  {
    "question": "Rho-rho navigation uses:",
    "feedback": "DME/DME"
  },
  {
    "question": "The OUTER MARKER of an Instrument Landing System (ILS) facility transmits on a frequency of:",
    "feedback": "75 MHz and is modulated by morse at two dashes per second"
  },
  {
    "question": "What are additional aircraft parameters that are downlinked from Mode S Enhanced Surveillance (EHS) transponders?\n1) ground speed and Mach number2) outside air temperature3) roll angle4) pitch angle",
    "feedback": "1, 3"
  },
  {
    "question": "To maintain the 314° QDR to an NDB with 7° right drift, the heading in °M and relative bearing will be:",
    "feedback": "127°/007°"
  },
  {
    "question": "A GBAS system communicates with an aircraft using GPS to provide aircraft with information, including which of the following?\n1) Integrity information2) Almanac data3) Approach data4) Receiver noise correction",
    "feedback": "1, 3"
  },
  {
    "question": "In order to give the flight crew control of the required lateral guidance functions, the RNAV equipment should be able to perform a number of functions.\n\nWhich of the following is not such a function?",
    "feedback": "Provide guidance to another selected flight level"
  },
  {
    "question": "How does a typical Electronic Flight Instrument System (EFIS) display respond to the failure of a VHF navigation (VOR) receiver?",
    "feedback": "It removes the associated magenta deviation bar and/or pointer from the display"
  },
  {
    "question": "How long does it take a NAVSTAR/GPS satellite to orbit the earth?",
    "feedback": "Approximately 12 hours (1/2 of a sidereal day)"
  },
  {
    "question": "A Homing you prefer with a difference of angle greater than",
    "feedback": "70°"
  },
  {
    "question": "The frequency of an NDB is 427 kHz. What is the corresponding wavelength?",
    "feedback": "702.5 m"
  },
  {
    "question": "An aircraft is flying on a MH of 010°. The magnetic variation at the VOR is 10°W and at the aircraft 12°W.\n\nWhich VOR-RMI corresponds to the indications on the HSI shown?",
    "feedback": "Figure B"
  },
  {
    "question": "What is a common characteristic of GPS, GLONASS and GALILEO?",
    "feedback": "All three systems use time measurement to determine a position"
  },
  {
    "question": "The indicated range from a DME station is:",
    "feedback": "slant range"
  },
  {
    "question": "PBN path terminator \"DF\" means",
    "feedback": "Direct Fix"
  },
  {
    "question": "What is true about code garbling?",
    "feedback": "It happens at the ground station when Mode A/C replies of two different aircraft overlap (in terms of time)"
  },
  {
    "question": "RNAV 5 is used in",
    "feedback": "the en-route continental and arrival phases of flight"
  },
  {
    "question": "What is the minimum number of NAVSTAR/GPS satellites required to produce an accurate independent 3-D position fix?",
    "feedback": "4"
  },
  {
    "question": "Under CS-25 colour code rules for Electronic Flight Instrument Systems (EFIS), armed modes are coloured:",
    "feedback": "white"
  },
  {
    "question": "Within PBN operation, what is the make-up of the \"Total System Error\" (TSE)?\nPDE = Path Definition ErrorFTE = Flight Technical ErrorNSE = Navigation System Error",
    "feedback": "PDE + FTE + NSE"
  },
  {
    "question": "UHF (ultra high frequency) waves appear in the frequency spectrum:",
    "feedback": "300 MHz - 3000 MHz"
  },
  {
    "question": "A flight crew is planning an IFR flight using RNAV. One part of the route requires RNP 1. This could be a/an:",
    "feedback": "Low-level helicopter en-route section"
  },
  {
    "question": "Which dimension is added to a 3D RNAV system to achieve a 4D RNAV system?",
    "feedback": "Time"
  },
  {
    "question": "What is the difference between satellites used by EGNOS and those used by GPS?",
    "feedback": "EGNOS satellites are geostationary and GPS satellites are not"
  },
  {
    "question": "The damping of a radio wave is so strong that no signal can be received. This phenomenon is called:",
    "feedback": "absorption"
  },
  {
    "question": "RNAV 2 might be used:",
    "feedback": "in the en-route, continental, arrival and departure phases of flight"
  },
  {
    "question": "Describe the propagation of VHF radio waves:",
    "feedback": "line of sight propagation"
  },
  {
    "question": "The term \"phase\" can be defined as:",
    "feedback": "the fraction of one wavelength expressed in degrees from 000° to 360°"
  },
  {
    "question": "On an RMI the front end of a VOR pointer indicates the:",
    "feedback": "radial plus 180°"
  },
  {
    "question": "How is amplitude modulation accomplished?",
    "feedback": "The information is added onto the carrier wave by altering the amplitude of the carrier"
  },
  {
    "question": "NDB approach: What accuracy does the ADF provide by day with respect to the published track?",
    "feedback": "+/- 5°"
  },
  {
    "question": "Why is it necessary for both pilots and air traffic controllers to be aware of the capabilities and performance of RNAV and RNP systems when entering and operating in a particular airspace?",
    "feedback": "To be confident that the aircraft is capable of navigating with the appropriate accuracy to ensure adherence to procedures and separation"
  },
  {
    "question": "The PRF for the maximum theoretical unambiguous 200 NM range of a radar is approximately:",
    "feedback": "400 Hz"
  },
  {
    "question": "If a failed RMI rose is stuck on 090° and the ADF pointer indicates 225°, the relative bearing to the station will be:",
    "feedback": "135°"
  },
  {
    "question": "An aircraft is on radial 120 with a magnetic heading of 300°, the track selector (OBS) reads 330. The indications on the Course Deviation Indicator (CDI) are 'fly':",
    "feedback": "left with 'TO' showing"
  },
  {
    "question": "Which approximate wavelength is used for the most airborne weather radar systems?",
    "feedback": "3 cm"
  },
  {
    "question": "The most widely used AC frequency in aircraft is:",
    "feedback": "400 Hz"
  },
  {
    "question": "Transmissions from VOR facilities may be adversely affected by:",
    "feedback": "uneven propagation over irregular ground surfaces"
  },
  {
    "question": "The GPS control segment consists of:",
    "feedback": "A Master Control Station, monitor stations, and ground antennas"
  },
  {
    "question": "GPS satellites transmit on two L-band frequencies with different types of signals. Which of these are generally available for use by civil aviation?",
    "feedback": "L1-coarse acquisition (C/A) with selected availability (S/A)"
  },
  {
    "question": "On the airborne weather radar display, different colours are used",
    "feedback": "To display different intensity of precipitation"
  },
  {
    "question": "The figure shows a multifunction display. VOR 1 is displayed, which has been tuned to a nearby VOR station and correctly identified. The aircraft is ....",
    "feedback": "6° left of the inbound course on selected radial 130"
  },
  {
    "question": "Why should Airborne Weather Radar (AWR) systems be used with extreme caution when on the ground?",
    "feedback": "People could be exposed to Super High Frequency (SHF) radiation which, if absorbed in large enough amounts, can lead to tissue damage"
  },
  {
    "question": "Which of the following is true with reference to frequency of a radio wave?",
    "feedback": "Frequency is the number of cycles in one second in a radio wave expressed in Hertz (Hz)"
  },
  {
    "question": "In a 2D RNAV system you have entered the DME and VOR data for two waypoints. What do you use to work out the cross track errors when en-route from one to the other?",
    "feedback": "Use the automatically computed values on the CDI/HSI"
  },
  {
    "question": "A pilot flying an aircraft at FL80 tunes in a VOR which has an elevation of 313 metres. Given ISA conditions, what is the maximum theoretical distance at which a pilot might expect to receive the VOR signals?",
    "feedback": "151 NM"
  },
  {
    "question": "Using modern DME equipment meant for general navigation use, the accuracy expected is",
    "feedback": "+/- 0,2 NM or 0,25% of the slant range, whichever is greater"
  },
  {
    "question": "Which statement is correct with respect to the different types of VOR?",
    "feedback": "A TVOR has a limited range"
  },
  {
    "question": "One of the benefits of RNAV is:",
    "feedback": "RNAV allows aircraft to take a more direct flight path without requiring to fly over ground based facilities"
  },
  {
    "question": "On the QDR of 075° (in the vicinity of the station) with a magnetic heading of 295°, the relative bearing on the ADF indicator is:",
    "feedback": "320°"
  },
  {
    "question": "The reason for an RNAV computer of an aircraft to receive TAS and heading input is:",
    "feedback": "to be able to calculate the actual wind velocity"
  },
  {
    "question": "An aeroplane is following a terminal procedure requiring the use of RNP 1. The following message appears on the Navigation Display (ND) accompanied by an aural signal:\nNAV ACCUR DOWNGRAD\nWhat is the significance of this message?",
    "feedback": "The navigation accuracy is less than the required accuracy of +/- 1 NM"
  },
  {
    "question": "Which term refers to the difference between the aircraft's estimated position and actual position in the context of PBN?",
    "feedback": "Navigation System Error (NSE)"
  },
  {
    "question": "User Equivalent Range Error (UERE) or User Range Error (URE) is a signal-in-space error consisting of several individual errors. One of these individual errors is variations to the satellite orbit, or ephemeris, which is caused by....",
    "feedback": "solar winds and gravitational forces of the Sun and the Moon"
  },
  {
    "question": "Which statement is true if you compare raw data with computed data?",
    "feedback": "Conventional radio navigation is based on raw data like information from navigation aids and measured air data"
  },
  {
    "question": "Name a significant advantage of Secondary Surveillance Radar (SSR) system over a primary radar system:",
    "feedback": "The user gets additional information, e.g. altitude"
  },
  {
    "question": "Which one of the following sensors/systems is self-contained?",
    "feedback": "Inertial Navigation System"
  },
  {
    "question": "The GPS satellites will pass positions on the Earth having latitude as high as",
    "feedback": "55°"
  },
  {
    "question": "On the navigation display (ND) the Required Navigation Performance (RNP) and Actual Navigation Performance (ANP) values are shown. Which of the following statements is a correct interpretation of the displayed values?",
    "feedback": "The aircraft is currently performing according to the RNP, but a warning will be given if the ANP increases beyond 2.00"
  },
  {
    "question": "A frequency of 10 GHz is considered to be the optimum for use in an airborne weather radar system because:",
    "feedback": "the larger water droplets will give good echoes and the antenna can be kept relatively small"
  },
  {
    "question": "On final on an ILS approach, you are flying overhead the outer marker. You can expect to be at:",
    "feedback": "4 NM from the threshold"
  },
  {
    "question": "Which aeronautical radio frequency band uses refraction within ionospheric layers?",
    "feedback": "HF"
  },
  {
    "question": "A DME station is located 1000 feet above MSL.  An aircraft flying at FL 370, 15 NM away from the DME station, will have a DME reading of:",
    "feedback": "16 NM"
  },
  {
    "question": "Which RNP can be used in all phases of flight except for en-route oceanic/remote and final approach phases and is intended primarily for helicopters?",
    "feedback": "RNP 0.3"
  },
  {
    "question": "Which of the following is correct regarding the range of an NDB?",
    "feedback": "Aircraft height is not limiting for the reception of signals from the NDB"
  },
  {
    "question": "Regarding ILS which of the following is true?",
    "feedback": "All markers transmit at 75 MHz"
  },
  {
    "question": "Which of the following factors affects the minimum spacing requirements of an ATS route?",
    "feedback": "Navigation performance"
  },
  {
    "question": "GBAS ground subsystems provide two services, the precision approach service and the GBAS positioning service. The precision approach service provides:",
    "feedback": "deviation guidance for FInal Approach Segments"
  },
  {
    "question": "A ground radar transmitting at a PRF of 1200 pulses/second will have a maximum unambiguous range of approximately:",
    "feedback": "67 NM"
  },
  {
    "question": "What is the accuracy of an NDB signal at night?",
    "feedback": "Lower"
  },
  {
    "question": "For a conventional DME facility 'Beacon Saturation' will occur whenever the number of simultaneous interrogations exceeds:",
    "feedback": "100"
  },
  {
    "question": "The almanac data of the navigation message of a GPS satellite contains:",
    "feedback": "orbital data of all the satellites in the GPS constellation"
  },
  {
    "question": "What is the procedure to be followed if, on a flight under IFR conditions using the NAVSTAR/GPS satellite navigation system, the number of satellites required to maintain the RAIM (Receiver Autonomous Integrity Monitoring) function are not available?",
    "feedback": "The flight may be continued using other certificated navigation systems"
  },
  {
    "question": "When operating at night the pilots notice erratic movement of the ADF needle. Although a specific NDB has been selected, they can also hear a second NDB identification code.\nWhat could be the cause?",
    "feedback": "The sky wave component of an NDB extends to a far greater distance than the ground wave component, causing interference"
  },
  {
    "question": "An aircraft is on final approach for a CAT II ILS. As the aircraft starts down the glide path, the driver of a ground vehicle passes a hold marker without clearance and enters the ILS sensitive area. The ILS monitoring system shuts down the ILS signal and the crew excecute a missed approach.\nThis would happen if the monitoring system detects too much of....",
    "feedback": "a shift in the LOC or GP course"
  },
  {
    "question": "In a primary radar the maximum range requires",
    "feedback": "High pulse effect and long PRI"
  },
  {
    "question": "An Omni-bearing selector (OBS) shows full deflection to the left when within range of a serviceable VOR. \nWhat angular deviation are you from the selected radial?",
    "feedback": "10° or more"
  },
  {
    "question": "The skip distance of HF-transmission will increase with:",
    "feedback": "higher frequency and higher position of the reflecting ionospheric layer"
  },
  {
    "question": "Which one of the following disturbances is most likely  to cause the greatest inaccuracy in ADF bearings?",
    "feedback": "Local thunderstorm activity"
  },
  {
    "question": "GPS uses two frequencies, L1 and L2. Which statement is correct?",
    "feedback": "L1 is required for the Standard Positioning and Timing Service (SPS)"
  },
  {
    "question": "A pilot is planning to conduct a flight under the specifications of PBN. An RNP approach to LNAV/VNAV minima may only be flown with vertical guidance .......",
    "feedback": "certified for the purpose"
  },
  {
    "question": "Mountain Effect, occurring for instance with NDBs, is caused by what physical phenomenon?",
    "feedback": "Diffraction"
  },
  {
    "question": "ILS transmitters use the:",
    "feedback": "UHF and VHF bands"
  },
  {
    "question": "Refer to the figure which shows an Omni Bearing Indicator (OBI) and a Direction Indicator (DI) from a light aircraft. The VOR is tuned and identified and about 15 NM away. It is....",
    "feedback": "behind and to the left of the aircraft"
  },
  {
    "question": "On a typical computer generated SSR display the following data on a particular flight will be shown:",
    "feedback": "Squawk code, Flight level , Ground speed, Airplane callsign"
  },
  {
    "question": "The crew of an aircraft, flying under IFR, is briefing an arrival and procedural VOR approach requiring a procedural turn. The outbound leg follows the 098° radial from the VOR to a DMA range of 6.0 NM, followed by a left turn onto a track of 018°(M), which would be followed by a....",
    "feedback": "right turn onto a track of 278°(M) to intercept the inbound track"
  },
  {
    "question": "An aircraft is vectored to runway 16 at Cork EICK for a conventional front-beam CAT I ILS approach, using a HSI. The approach plate gives a final approach track of 164° and variation 4°W.\nIf the pilot is experiencing approximately 6° right drift on final approach, the course selector of the HSI should be set to:",
    "feedback": "164°"
  },
  {
    "question": "What is correct for PDE (Path Definition Error)?",
    "feedback": "The path defined by the RNAV system does not correspond to the desired path"
  },
  {
    "question": "If an aircraft flies along a VOR radial it will follow a:",
    "feedback": "great circle track"
  },
  {
    "question": "SBAS improves the performance (position accuracy) of GNSS/GPS receivers by:",
    "feedback": "providing an additional signal coming from the geostationary satellites"
  },
  {
    "question": "What is the audio frequency of the inner marker?",
    "feedback": "3000 Hz"
  },
  {
    "question": "What airborne equipment, if any, is required to be fitted in order that a VDF let-down may be flown?",
    "feedback": "VHF radio"
  },
  {
    "question": "The Distance Measuring Equipment (DME)  uses the following wavelengths:",
    "feedback": "decimetric."
  },
  {
    "question": "In the NAVSTAR/GPS satellite navigation system, receiver clock error:",
    "feedback": "is corrected by using signals from four satellites"
  },
  {
    "question": "Which failure in radio navigation is connected with \"fading\"?",
    "feedback": "Twilight/Night Effect"
  },
  {
    "question": "UTC parameters determine the difference between",
    "feedback": "GPS time and UTC"
  },
  {
    "question": "What is the approximate speed of a radio wave?",
    "feedback": "300000 km/s"
  },
  {
    "question": "If a VOR station and a DME station, having different locations, are selected to provide a fix",
    "feedback": "All 3 answers above are correct"
  },
  {
    "question": "What is measured in order to establish aircraft position in relation to the localiser beam on an ILS?",
    "feedback": "The difference in depth between the 90 Hz modulation and the 150 Hz modulation"
  },
  {
    "question": "Modern airborne weather radars can detect wind shear by using....",
    "feedback": "Doppler techniques, inertial data, and air data"
  },
  {
    "question": "Using GPS, the primary position information is in the form of",
    "feedback": "Spheres, with the satellites in the centre of the spheres"
  },
  {
    "question": "The combination of the polar diagrams of the loop and the sense aerial results in",
    "feedback": "A cardioid polar diagram, having only one null or minimum"
  },
  {
    "question": "What is the function of pulse P2 in Mode A/C interrogation?",
    "feedback": "To avoid responses from aircraft which are located in the direction of the side lobes of the interrogator antenna"
  },
  {
    "question": "Which of the following lists all the methods that can be used to enter 'Created Waypoints' into the CDU of a B737-400 Electronic Flight Instrument System?",
    "feedback": "Identifier bearing/distance; place bearing/place bearing; along-track displacement; latitude and longitude"
  },
  {
    "question": "Which of the following can all be stored as five letter waypoint identifiers through the CDU of a B737-400 Electronic Flight Instrument System?",
    "feedback": "Waypoint names; navaid identifiers; runway numbers; airport ICAO identifiers"
  },
  {
    "question": "Which of the following lists are all errors that affect the accuracy and reliability of the Satellite-Assisted Navigation system (GNSS/GPS)?",
    "feedback": "Satellite clock; satellite ephemeris; atmospheric propagation"
  },
  {
    "question": "How is the vertical information for an LNAV/VNAV approach provided?",
    "feedback": "SBAS or Baro-VNAV"
  },
  {
    "question": "The amplitude of a wave or oscillation is:",
    "feedback": "its maximum deflection"
  },
  {
    "question": "Which figure indicates the plan range of GBAS?",
    "feedback": "Figure C"
  },
  {
    "question": "Which of the following satellite navigation systems has Full Operational Capability (FOC) and is approved for specified flights under IFR conditions in Europe?",
    "feedback": "NAVSTAR/GPS"
  },
  {
    "question": "On an RNP approach using SBAS, during the final approach segment, the signal-in-space errors cause a lateral position error that is beyond the limits of the approach. What must be provided by the aircraft's navigation equipment?",
    "feedback": "An alert within six seconds"
  },
  {
    "question": "In the VOR receiver the radial is determined by measurement of the:",
    "feedback": "phase difference between the variable signal and the reference signal"
  },
  {
    "question": "What is the maximum range a transmission from a VOR beacon at 169 ft can be received by an aircraft at 1200 ft?",
    "feedback": "60 NM"
  },
  {
    "question": "At what velocity do electromagnetic waves travel?",
    "feedback": "The speed of light"
  },
  {
    "question": "Which of the following correctly describes the Instrument Landing System (ILS) localiser radiation pattern?",
    "feedback": "Two overlapping lobes on the same VHF carrier frequency"
  },
  {
    "question": "In which route segment may RNAV 5 be used?",
    "feedback": "Arrival and en-route outside 30 NM of TMA and above MSA"
  },
  {
    "question": "What approximate rate of descent is required in order to maintain a 3° glide path at a groundspeed of 120 kt?",
    "feedback": "600 FT/MIN"
  },
  {
    "question": "What is the maximum distance between VOR and DME/TACAN ground installations if they are to have the same morse code identifier?",
    "feedback": "600 m"
  },
  {
    "question": "In VDF service the report \"QDR 235, Class C\" means",
    "feedback": "The magnetic bearing from the station to the aircraft is 235° +/-10°"
  },
  {
    "question": "An airborne transponder can provide coded reply signals in response to interrogation signals from:",
    "feedback": "ground secondary surveillance radar and from aircraft equipped with TCAS"
  },
  {
    "question": "A simple schematic diagram of a typical primary radar set, will show that",
    "feedback": "The Display unit is fed information from the receiver and the timebase generator"
  },
  {
    "question": "When VOR and DME stations are associated",
    "feedback": "They may be separated by as much as 600 metres if they are meant for en-route navigation"
  },
  {
    "question": "What is the function of the Echo Protection Circuit (EPC)?",
    "feedback": "The EPC has to detect if the interrogator-receiver has been locked on, by reflected pulse-pairs."
  },
  {
    "question": "Which satellite NAVSTAR GPS navigation system error(s) is/are corrected for by the D-GPS technique?",
    "feedback": "Clock and Selective Availability (SA)"
  },
  {
    "question": "The Ground Wave propagates as follows:",
    "feedback": "it travels along the earth' surface and follows the curvature of the earth"
  },
  {
    "question": "An aircraft is flying:\n1) Directly towards a DME station\n2) Directly away from a DME station\n3) A DME Arc\n4) Passing abeam a DME station\n\nIn which of the above given situations should the DME give an accurate groundspeed reading?",
    "feedback": "1, 2"
  },
  {
    "question": "PBN path terminators define:",
    "feedback": "a specific type of termination of the previous flight path"
  },
  {
    "question": "In relation to radar systems that use pulse technology, the term 'Pulse Recurrence Rate (PRR)' signifies the:",
    "feedback": "number of pulses per second"
  },
  {
    "question": "Concerning the localiser principle of operation in an ILS system, the difference in depth of modulation (DDM): \n\n1) decreases with respect to the angular displacement from the centerline \n2) increases with right displacement from the centerline\n3) decreases with left displacement from the centerline\n4) increases linearly with displacement from the centreline. \n\nThe combination regrouping all the correct statements is:",
    "feedback": "2 and 4."
  },
  {
    "question": "Regarding the PBN specification RNP AR APCH, what requires specific authorisation?",
    "feedback": "The published instrument approach"
  },
  {
    "question": "The Sky Wave propagates as follows:",
    "feedback": "a wave transmitted into space will be reflected back to the earth's surface by the ionosphere"
  },
  {
    "question": "Allocated frequencies for NDB are:",
    "feedback": "190 kHz to 1750 kHz"
  },
  {
    "question": "Which of the following terms describes the maximum deflection in an oscillation?",
    "feedback": "amplitude"
  },
  {
    "question": "ICAO Annex 10 Volume I specifies the requirements of GNSS navigation services. With regard to GPS and GLONASS they ....",
    "feedback": "can both be used in a suitably equipped aircraft as the systems are compatible and their functions are interoperable"
  },
  {
    "question": "The ADF in the aircraft has been tuned to a nearby NDB, which has been identified. The figure shows the accompanying RBI and the Direction Indicator in the aircraft, which has been aligned with the on-board compass. What is the QDR of the NDB?",
    "feedback": "326°"
  },
  {
    "question": "The maximum range of primary radar depends on :",
    "feedback": "pulse recurrence frequency"
  },
  {
    "question": "The secondary Surveillance Radar (SSR) uses the following wavelengths:",
    "feedback": "decimetric."
  },
  {
    "question": "Which of the following is a complete list of airborne weather radar antenna stabilisation axes?",
    "feedback": "roll and pitch"
  },
  {
    "question": "In the Global Navigation Satellite System (GNSS), what is the User Equivalent Range Error (UERE)?\nIt is a computed value for:",
    "feedback": "Residual errors in the receivers which have not been corrected"
  },
  {
    "question": "During an ILS approach to runway 19, the pilot sees the yellow light in the cockpit illuminating. How far is the aircraft from the runway?",
    "feedback": "0.5 NM"
  },
  {
    "question": "In an Electronic Flight Instrument System (EFIS) data relating primarily to automatic flight is provided by:",
    "feedback": "Flight Control Computers, Flight Management Computers, Autothrottle"
  },
  {
    "question": "An airway 10 NM wide is to be defined by two VORs each having a resultant bearing accuracy of plus or minus 5.5°. \nIn order to ensure accurate track guidance within the airway limits the maximum distance apart for the transmitters is approximately:",
    "feedback": "105 NM"
  },
  {
    "question": "Due to 'Doppler' effect an apparent decrease in the transmitted frequency, which is proportional to the transmitter's velocity, will occur when:",
    "feedback": "the transmitter moves away from the receiver"
  },
  {
    "question": "The aircraft DME receiver is able to accept replies to its own transmissions and reject replies to other aircraft interrogations because:",
    "feedback": "pulse pairs are discrete to a particular aircraft"
  },
  {
    "question": "Where is RNP used?",
    "feedback": "For RNAV routes"
  },
  {
    "question": "The airborne DME equipment will transmit pulse pairs at a comparatively high PRF",
    "feedback": "When first switched on and after a channel selection"
  },
  {
    "question": "EGNOS (European Geostationary Navigation Overlay System) is a:",
    "feedback": "Satellite Based Augmentation System (SBAS)"
  },
  {
    "question": "What is the minimum level (ISA conditions) that an aircraft, at a range of 111 NM, must fly in order to contact the tower on R/T for a VDF bearing from an airport sited 169 FT above MSL?",
    "feedback": "FL60"
  },
  {
    "question": "Which of the following equipment works on the interrogator/transponder principle?",
    "feedback": "Secondary Surveillance Radar SSR"
  },
  {
    "question": "Which of the following navigation aspects are related to the RNP specification for terminal and en-route phases of flight?",
    "feedback": "Lateral navigation"
  },
  {
    "question": "All ILS marker beacons transmit at:",
    "feedback": "75 MHz"
  },
  {
    "question": "Within the PBN concept, \"availability\" is a measure of the ability of the system to provide services within the specified coverage area. It is defined as ......",
    "feedback": "the percentage of time during which the system is to be used for navigation during which reliable navigation information is presented"
  },
  {
    "question": "Regarding NAVSTAR/GPS, how many operational satellites does the space segment consist of in the notional constellation?",
    "feedback": "24"
  },
  {
    "question": "Which of the following PBN procedures is not classified as a 3D approach procedure? RNP APCH to ......",
    "feedback": "LNAV minima"
  },
  {
    "question": "An aircraft is 100 NM from a VOR facility. Assuming no error when using a deviation indicator where 1 dot = 2° deviation, how many dots deviation from the centre line of the instrument will represent the limits of the airway boundary? (Assume that the airway is 10 NM wide)",
    "feedback": "1.5"
  },
  {
    "question": "What spacing is used to separate the P1 pulse from a P2 pulse in a mode C SSR interrogation?",
    "feedback": "2μsec between P1 and P2 pulse"
  },
  {
    "question": "What is the wavelength of an NDB transmitting on 375 kHZ?",
    "feedback": "800 m"
  },
  {
    "question": "With regard to an RNP AR APCH, what does AR stand for?",
    "feedback": "Authorization required"
  },
  {
    "question": "How will an SSR interrogation be directed towards a specific aircraft?",
    "feedback": "With a unique 24-bit address in the interrogation"
  },
  {
    "question": "In an ILS system,concerning the glidepath principle of operation, the difference in depth of modulation (DDM):\n\n1) decrease with angular displacement below the glidepath\n2) increase with angular displacement above the glidepath \n3) decrease with angular displacement above the glidepath\n4) increase with angular displacement below the glidepath\n\nThe combination regrouping all the correct statements is:",
    "feedback": "2 and 4."
  },
  {
    "question": "Which statement about RNAV-routes is correct?",
    "feedback": "A method of navigation which permits aircraft operation on any desired flight path."
  },
  {
    "question": "The main task of the user segment (receiver) of the satellite navigation system NAVSTAR/GPS is to:",
    "feedback": "select appropriate satellites automatically, to track the signals and to measure the time taken by signals from the satellites to reach the receiver"
  },
  {
    "question": "An aircraft on a heading of 280°(M) is on a bearing of 090°(M) from a VOR. \nThe bearing you should select on the OMNI bearing selector to centralise the VOR/ILS left/right deviation needle with a 'TO' indication is:",
    "feedback": "270°"
  },
  {
    "question": "What is the advantage, if any, by using a combination of EGNOS and GPS?",
    "feedback": "Improving of the integrity by alerting users within 6 seconds instead of 3 hours"
  },
  {
    "question": "\"Fruiting\" is caused by:",
    "feedback": "aircraft at range responding to interrogations from another ATC radar station"
  },
  {
    "question": "Which of the following input data is used by simple VOR/DME RNAV systems?",
    "feedback": "Waypoint (phantom station), valid VOR/DME signal and desired course"
  },
  {
    "question": "What is the term used for situations when a specific SSR ground station receives reply pulses from an aircraft which are caused by interrogations from a different SSR ground station?",
    "feedback": "Fruiting"
  },
  {
    "question": "The middle marker is identified by",
    "feedback": "Audible alternate dots and dashes with tone 1300 Hz and an amber light"
  },
  {
    "question": "ILS produces:",
    "feedback": "a radiation pattern which is amplitude modulated by a 90 Hz and a 150 Hz signal"
  },
  {
    "question": "The tilt angle on the AWR at which an active cloud just disappears from the screen is 4° up. If the beam width is 5° and the range of the cloud is 40 NM, use the 1:60 rule to calculate the approximate height of the cloud, relative to the aircraft:",
    "feedback": "6000 ft above"
  },
  {
    "question": "Differential GPS (DGPS)",
    "feedback": "Is used to improve the accuracy of GPS signals within an area, by using data from a      receiver placed in a known position as a correction to the data received in the aircraft  from the satellites"
  },
  {
    "question": "RAIM is achieved:",
    "feedback": "within the receiver"
  },
  {
    "question": "In relation to the NAVSTAR/GPS satellite navigation system, 'Search the Sky' is a:",
    "feedback": "procedure that starts after switching on a receiver if there is no stored satellite data available"
  },
  {
    "question": "Which one of the following is an advantage of a secondary radar system when compared to a primary radar system?",
    "feedback": "The required power of transmission from the ground equipment is reduced"
  },
  {
    "question": "Which statement with respect to interrogation modes is correct?",
    "feedback": "Mode S Broadcast will transmit information to all mode S transponders."
  },
  {
    "question": "An aircraft at FL 410 (ISA conditions) is passing overhead a DME station at mean sea level. The DME indicates approximately:",
    "feedback": "6.8 NM"
  },
  {
    "question": "Which one of the following inputs to an Aera Navigation System (RNAV) comes from an external, not on-board system?",
    "feedback": "VOR/DME radial/distance"
  },
  {
    "question": "System, or beacon, saturation of the DME system",
    "feedback": "May occur when more than 100 aircraft are demanding replies from a single ground\nstation"
  },
  {
    "question": "An aircraft is flying an RNAV approach supported by SBAS. In which of the following situations would the contingency procedure of discontinuing the RNAV approach and reverting to a conventional arrival route apply?\n1) Communications failure2) The receiver fails to engage the correct approach mode3) Loss of integrity monitoring4) TCAS advisory5) The CDI indication is greater than half scale displacement",
    "feedback": "2, 3, 5"
  },
  {
    "question": "A DME in tracking mode subsequently experiences a reduction in signal strength will switch the equipment in the first instance to:",
    "feedback": "memory mode"
  },
  {
    "question": "There are two modulation types of NDBs: NON/A1A and NON/A2A.\n\nWhich of the following statements is true?",
    "feedback": "The bearing indicator is erratic when a NON/A1A station is identifying"
  },
  {
    "question": "The dip error of the ADF is caused by ....",
    "feedback": "a tilted antenna when banking the aircraft"
  },
  {
    "question": "The reason for using different frequencies for transmitting and receiving in the DME system",
    "feedback": "Is to prevent self-triggering of the receiving equipment by the transmitter"
  },
  {
    "question": "ICAO DOC 9613 (PBN) defines a set of navigation specifications applicable to different airspace concepts. Which navigation specification may a pilot expect to be under in the North Atlantic High Level Airspace (NAT HLA)?",
    "feedback": "RNAV 10 / RNP 10 and RNP 4 only"
  },
  {
    "question": "The distance between geodetic parallels of latitude on the surface of the WGS 84 ellipsoid ......",
    "feedback": "Increases with increasing latitude"
  },
  {
    "question": "The navigation computer of the simple 2D RNAV system computes the navigational problems by:",
    "feedback": "simple sine and consine mathematics, solving the triangular problems"
  },
  {
    "question": "An aircraft carrying out an ILS approach is receiving more 90 Hz than 150 Hz modulation notes from both the localiser and glidepath transmitters. The ILS indication will show:",
    "feedback": "Fly right and fly down"
  },
  {
    "question": "VHF radio signals used for communication and navigation have a limited range because ....",
    "feedback": "of the curvature of the Earth"
  },
  {
    "question": "What does the term \"antenna shadowing\" mean?",
    "feedback": "The antenna is masked from the transmitter due to the aircraft attitude"
  },
  {
    "question": "What is the reason that DME utilizes pulse pairs instead of single pulses?",
    "feedback": "To distinguish the DME transmissions from transmissions of other (radar) systems utilising single pulses"
  },
  {
    "question": "In a primary radar system",
    "feedback": "All radio frequency energy is produced by the radar located at the radar site"
  },
  {
    "question": "A 2D RNAV system has a capability to navigate in the:",
    "feedback": "horizontal plane"
  },
  {
    "question": "Unauthorised civilian users of NAVSTAR GPS can access:",
    "feedback": "the C/A code"
  },
  {
    "question": "An aircraft at FL300 (ISA conditions), with a ground speed of 300 kts, is about to pass overhead a DME station at MSL. The DME receiver is capable of determining ground speed. One minute before the overhead, DME speed and distance indications are respectively:",
    "feedback": "less than 300 kts and 7 NM"
  },
  {
    "question": "The code transmitted by a SSR transponder consists of:",
    "feedback": "pulses"
  },
  {
    "question": "What is correct about fly-by/fly-over waypoints and turns?",
    "feedback": "A fly-by waypoint is a waypoint which requires turn anticipation to allow tangential interception of the next segment of a route or procedure"
  },
  {
    "question": "The position of a waypoint can be inserted into the computer of a 4D RNAV system in different ways:\n1) Alphanumeric ICAO identifier\n2) Latitude, Longitude and altitude\n3) Radial and distance from a VOR station\n4) Distance and bearing from another waypoint\n\nThe combination that regroups all of the correct statements is:",
    "feedback": "1, 3"
  },
  {
    "question": "RNAV routes:",
    "feedback": "typically include segments specified only by waypoints defined as a position in latitude and longitude based on the WGS 84 system"
  },
  {
    "question": "Which of the figures depicts an Electronic Flight Instrument System (EFIS) display in MAP mode?",
    "feedback": "Figure 4"
  },
  {
    "question": "An aircraft tracking to intercept the Instrument Landing System (ILS) localiser inbound on the approach side, outside the published ILS coverage angle:",
    "feedback": "may receive false course indications"
  },
  {
    "question": "HF (High Frequency) waves appear in the frequency spectrum:",
    "feedback": "3 MHz - 30 MHz"
  },
  {
    "question": "You are flying in Canada using a VOR to navigate. You are on the 190° radial, the variation at VOR is 2°W and at the aircraft 2°E. The true bearing from the VOR to the aircraft is ....",
    "feedback": "188°"
  },
  {
    "question": "In NAVSTAR GPS the PRN codes are used to:",
    "feedback": "determine satellite range"
  },
  {
    "question": "RNAV equipment will",
    "feedback": "All 3 answers are correct"
  },
  {
    "question": "In the SSR terminology \"de-fruiting\" means",
    "feedback": "The removal from the display of random responses"
  },
  {
    "question": "For GPS navigation it can be stated that:",
    "feedback": "the clock error of the satellite clock is important for accurate position fixing"
  },
  {
    "question": "The pencil shaped beam of an airborne weather radar is used in preference to the mapping mode for the determination of ground features:",
    "feedback": "beyond 50 to 60 NM because more power can be concentrated in the narrower beam"
  },
  {
    "question": "One of the advantages of a Satellite Based Augmentation System (SBAS) over a Ground Based Augmentation System (GBAS) is:",
    "feedback": "the coverage area of an SBAS is much larger than that of a GBAS"
  },
  {
    "question": "How can NDBs be used for navigation near the destination aerodrome?",
    "feedback": "As a locator beacon to start the final approach segment"
  },
  {
    "question": "The maximum width of the cone of silence above a VOR at 30000 ft is:",
    "feedback": "11,6 NM"
  },
  {
    "question": "The glide path transmitter operates on",
    "feedback": "40 frequencies from 329,15 MHz to 335,00 MHz"
  },
  {
    "question": "What is the maximum theoretical range that an aircraft at FL150 can receive signals from a VOR situated 609 feet above MSL?",
    "feedback": "184 NM"
  },
  {
    "question": "Refer to Jeppesen GSPRM, Aberdeen chart 13-1\nA descent from 2500 ft to 2300 ft is allowed, when:",
    "feedback": "there is half scale deflection on the VOR indicator"
  },
  {
    "question": "When conducting an RNP APCH to LNAV/VNAV minima, an aircraft's lateral guidance is based on GNSS and its vertical guidance can be based on either ......",
    "feedback": "SBAS or Baro-VNAV"
  },
  {
    "question": "What inclination do the orbits of GLONASS have?",
    "feedback": "65° inclination"
  },
  {
    "question": "What is the frequency band used by the datalink of a GPS based Satellite Augmentation System (SBAS)?",
    "feedback": "UHF"
  },
  {
    "question": "In order to plot a bearing from a VOR station, a pilot needs to know the magnetic variation:",
    "feedback": "at the VOR"
  },
  {
    "question": "What are the effects, if any, of shadowing by parts of the aircraft (e.g. wing) on the reception of signals from NAVSTAR/GPS satellites?",
    "feedback": "It may prevent the reception of signals"
  },
  {
    "question": "Refer to diagram # 2. The indication was obtained when the aircraft was at a range of 90 NM from the VOR. Assuming that the VOR is correctly set-up, the radial and horizontal distance the aircraft is off track are:",
    "feedback": "062 radial and 9 NM right of track."
  },
  {
    "question": "On a DME, display counters rotating throughout their range indicates:",
    "feedback": "the airborne receiver is conducting a range search"
  },
  {
    "question": "Complete the statement below in relation to Performance-Based Navigation. The airworthiness approval process assures that each item of the area navigation equipment installed is of a type and design appropriate to:",
    "feedback": "its intended function and that the installation functions properly under foreseeable operating conditions"
  },
  {
    "question": "During an ILS approach to runway 19, the pilot sees the blue light in the cockpit illuminating. How far is the aircraft from the runway?",
    "feedback": "5.4 NM"
  },
  {
    "question": "RNAV 10 and RNP 4 are used:",
    "feedback": "in the oceanic and remote phase of flight"
  },
  {
    "question": "The captain of an aircraft flying at FL100 wishes to obtain weather information at the destination airfield (0 ft MSL) from the airfield's VOR. At what maximum theoretical range will it be possible to obtain this information?",
    "feedback": "123 NM"
  },
  {
    "question": "The airborne weather radar:",
    "feedback": "may receive no reflections from a thunderstorm in an area behind a heavy rain shower"
  },
  {
    "question": "The Secondary Surveillance Radar (SSR) Mode S is compatible with (1) .... but also provides the information for (2) .... .",
    "feedback": "(1) SSR modes A and C, (2) Automatic Dependent Surveillance Broadcast (ADS-B)"
  },
  {
    "question": "The diagram indicates that the aircraft is to the:",
    "feedback": "right of the localizer and below the glidepath"
  },
  {
    "question": "What information may be displayed on an ATC radar screen connected only to a primary radar system?",
    "feedback": "Aircraft position only"
  },
  {
    "question": "Concerning the NAVSTAR/GPS satellite navigation system, what is the meaning of the term 'Receiver Autonomous Integrity Monitoring' (RAIM)?",
    "feedback": "It is a technique by which a receiver ensures the integrity of the navigation information"
  },
  {
    "question": "An aircraft is on radial 070° of a VOR, HDG 270°. If the OBS is set to 260°, this CDI will show:",
    "feedback": "fly left \"TO\""
  },
  {
    "question": "Which FMC/CDU page normally appears on initial power application to the B737-400 Electronic Flight Instrument System?",
    "feedback": "IDENT"
  },
  {
    "question": "Which one of the following errors can be compensated for by a NAVSTAR/GPS receiver comparing L1 and L2 frequencies?",
    "feedback": "Ionospheric"
  },
  {
    "question": "Signal reception is required from a minimum number of satellites that have adequate elevation and suitable geometry in order for a Satellite-Assisted Navigation System (GPS) to carry out independent three dimensional operation without the Receiver Autonomous Integrity Monitoring (RAIM) function. The number of satellites is:",
    "feedback": "4"
  },
  {
    "question": "Which of the figures above indicates the azimuth coverage of the ILS glide path?",
    "feedback": "Figure B"
  },
  {
    "question": "What is meant by the term \"fading\"?",
    "feedback": "The interference of the ground and sky wave"
  },
  {
    "question": "The ILS glidepath transmitter is located",
    "feedback": "About 300 meters upwind from the threshold and about 150 meters from the centre line of the runway"
  },
  {
    "question": "Where is information about the wind direction and velocity derived from?",
    "feedback": "Wind information is derived by the flight management computer (FMC) by heading, drift, true air speed and ground speed inputs"
  },
  {
    "question": "In civil aviation, the height value computed by the receiver of the satellite navigation system NAVSTAR/GPS is the:",
    "feedback": "height above the WGS-84 ellipsoid"
  },
  {
    "question": "The figure depicts a Navigation Display (ND) with a single VOR tuned and identified on both VOR 1 and VOR 2. What radial from CLT VOR is the aircraft on?",
    "feedback": "292°"
  },
  {
    "question": "TVOR is a:",
    "feedback": "VOR with a limited range used in the terminal area"
  },
  {
    "question": "DVOR is less sensitive to site errors than CVOR because of the:",
    "feedback": "relatively large antenna of DVOR (compared to CVOR)"
  },
  {
    "question": "How should RNAV 1/RNAV 2/RNP 1/RNP 2 SIDs and STARs be programmed into the FMS route by the crew?",
    "feedback": "Retrieval by route name from the on-board navigation database"
  },
  {
    "question": "One type of Airborne Based Augmentation Systems (ABAS) is called Aircraft Autonomous Integrity Monitoring (AAIM). This system:",
    "feedback": "depends on additional onboard system and on information from GNSS"
  },
  {
    "question": "A Flight Management System (FMS) can provide an Estimated Position Error (EPE) that may be used to check against the Required Navigation Performance (RNP) precision value of a procedure. The EPE is:",
    "feedback": "A measure of the reasonableness and accuracy of the given flight management position by applying a specific set of rules to the available navigation inputs"
  },
  {
    "question": "Within the PBN concept, how can \"accuracy\" be defined?",
    "feedback": "A comparison between the required position and the true position"
  },
  {
    "question": "An aircraft is flying on a MH of 210°. The magnetic variation at the VOR is 5°W and at the aircraft 10°W. Which VOR-RMI corresponds to the indications on the HSI shown below?",
    "feedback": "Figure B"
  },
  {
    "question": "A VOT is:",
    "feedback": "a test VOR"
  },
  {
    "question": "In which one of the following circumstances is ground direction finding (VDF) likely to be used to fix an aircraft's position?",
    "feedback": "When using the emergency VHF frequency 121.5 MHz"
  },
  {
    "question": "ICAO DOC 9613 defines the concept of PBN and its components. These components include the terms RNAV 2 and RNP 2. These are examples of:",
    "feedback": "Navigation specifications"
  },
  {
    "question": "RNP 2 is used:",
    "feedback": "in the en-route, oceanic and remote phases of flight"
  },
  {
    "question": "In order to obtain an ADF bearing the:",
    "feedback": "signal must be received by both the sense and loop aerials"
  },
  {
    "question": "VDF measures the bearing of the aircraft with:",
    "feedback": "reference to true or magnetic north at the station"
  },
  {
    "question": "List all components of performance based navigation (PBN):",
    "feedback": "Navigational aid infrastructure, navigation specification and navigation application"
  },
  {
    "question": "An ADF provides the aircraft with bearing information with respect to a ground station. To do this, the ground station emits a signal pattern which is:",
    "feedback": "omnidirectional"
  },
  {
    "question": "The ILS receiver of an aircraft flying down the exact runway centreline will receive:",
    "feedback": "90 Hz and 150 Hz lobes at equal depth"
  },
  {
    "question": "What is the definition of Receiver Autonomous Integrity Monitoring (RAIM) as a system utilised by an aviation GNSS receiver? RAIM is the ....",
    "feedback": "use of redundant range measurements to verify the position produced by the minimum number of satellites required for a 3D fix"
  },
  {
    "question": "An aircraft is tracking 060°(T) in still air. The relative bearing of an NDB is 035° at 1300. 12 minutes later, the relative bearing is 070°. What is the aircraft's distance from the NDB at 1312, with a GS of 180 kt?",
    "feedback": "36 NM"
  },
  {
    "question": "Why is strict adherence to flight director guidance important when manually flying a radius to fix (RF) leg? The flight director ......",
    "feedback": "is required to provide the necessary level of guidance and precision during the turn"
  },
  {
    "question": "A pilot is setting up the radio navigation aids for an ILS approach to runway 25 at the destination. The ILS frequency is given as 109.90 MHz. The glide path frequency is ....",
    "feedback": "tuned automatically when 109.90 MHz is tuned for the localiser"
  },
  {
    "question": "In relation to the NAVSTAR/GPS satellite navigation system, what is involved in the differential technique (D-GPS)?",
    "feedback": "Fixed ground stations compute position errors and transmit correction data to a suitable receiver on the aircraft"
  },
  {
    "question": "The receiver aerial for a NAVSTAR/GPS system should be mounted:",
    "feedback": "on the upper side of the fuselage in the vicinity of the centre of gravity"
  },
  {
    "question": "The MLS frequencies and available channels are ....",
    "feedback": "in the SHF band, 300 kHz frequency separation giving 200 available channels"
  },
  {
    "question": "Which statement is true about the navigation data in the navigation message of GPS?",
    "feedback": "The navigation data is uploaded to the satellites by the GPS control segment"
  },
  {
    "question": "In the NAVSTAR/GPS satellite navigation system, 'Selective Availability' (SA) is the artificial degradation of the navigation accuracy by:",
    "feedback": "dithering the satellite clock"
  },
  {
    "question": "The localiser transmits in:",
    "feedback": "the VHF band"
  },
  {
    "question": "A cumulonimbus cloud in the vicinity of an aeroplane can cause certain navigation systems to give false indications. This is particularly true of the:",
    "feedback": "ADF"
  },
  {
    "question": "Cross-track distance is displayed on:",
    "feedback": "Navigation display"
  },
  {
    "question": "In the cruise a flight crew hears a click on the ATC frequency, the flight crew does not hear anyone speaking but the frequency is blocked, and no other transmission can be heard. What is most likely to be happening?",
    "feedback": "The transmitting station is sending a signal, but the carrier wave is not being modulated"
  },
  {
    "question": "Which of the following combinations is likely to result in the most accurate Area Navigation (RNAV) fixes?",
    "feedback": "DME/DME"
  },
  {
    "question": "The accuracy the pilot has to fly the required bearing in order to be considered established during an ADF approach according to ICAO DOC 8168 is within plus or minus:",
    "feedback": "5°"
  },
  {
    "question": "What determines the operating mode (A or C) of the SSR transponder?",
    "feedback": "The time interval between the pulses P1 and P3"
  },
  {
    "question": "At a distance of 20 NM from the localizer transmitter, the horizontal extent of the localizer coverage is",
    "feedback": "+/- 10° from the runway extended centre line"
  },
  {
    "question": "HF radio waves travel:",
    "feedback": "during daytime and night time as sky waves, and the range of the ground wave is very small"
  },
  {
    "question": "Concerning the localiser principle of operation in an ILS, the needle of the aircraft indicator is centred when the difference in depth of modulation (DDM) is:",
    "feedback": "null"
  },
  {
    "question": "A student pilot wants to practise an RNP APCH to LPV minima. In the planning phase, the pilot notes, that a FAS data block (FAS DB) is required. What is the FAS DB used for?\nIt is used to:",
    "feedback": "Describe the final approach path, both laterally and vertically"
  },
  {
    "question": "What is correct regarding the sensitive and critical areas of an ILS installation?",
    "feedback": "The critical area is an area where vehicles, including aircraft, are excluded during all ILS operations whereas the sensitive area is an area where movement and parking of vehicles, including aircraft, is controlled during all ILS operations"
  },
  {
    "question": "Refer to Jeppesen GSPRM, chart E(LO)5:\nWhat is the correct frequency and Morse code of the Pamplona VOR?",
    "feedback": "112.3 PPN (.--. .--. -.)"
  },
  {
    "question": "Range of VDF depends on:\n\n1) line of sight formula\n2) power of transmitters\n3) intervening high ground\n\nThe combination that regroups all of the correct statements is:",
    "feedback": "1, 2, 3"
  },
  {
    "question": "The indication of a VOR receiver in an aircraft tracking towards a VOR are 075° M with a \"TO\" indication and the CDI centered. A co-located NDB shows 012° relative. What are drift and heading in °M?",
    "feedback": "12° right, 063°"
  },
  {
    "question": "In order to indicate unlawful interference with the planned operation of the flight, the aircraft Secondary Surveillance Radar (SSR) transponder should be selected to:",
    "feedback": "7500"
  },
  {
    "question": "The two signals transmitted by a conventional VOR ground station are 90° out of phase on magnetic:",
    "feedback": "east"
  },
  {
    "question": "A mode S transponder receives among other pulses a short P4 pulse from an interrogator.\n\nWhat does this mean?",
    "feedback": "The interrogator transmits a Mode A/C only all call"
  },
  {
    "question": "Reflection from large objects within the ILS coverage area may cause:",
    "feedback": "multi-path interference"
  },
  {
    "question": "In a primary radar using pulse technique, pulse length determines:",
    "feedback": "minimum measurable range"
  },
  {
    "question": "Which statement about the errors and effects on NDB radio signals is correct?",
    "feedback": "The mountain effect is caused by reflections onto steep slopes of mountainous terrain which may cause big errors in the bearing"
  },
  {
    "question": "Under CS-25 colour code rules for Electronic Flight Instrument Systems (EFIS), increasing intensity of precipititation are coloured in the order:",
    "feedback": "green, amber/yellow, red, magenta"
  },
  {
    "question": "What does EGNOS mean?",
    "feedback": "European Geostationary Navigation Overlay Service"
  },
  {
    "question": "The TO/FROM indicator of a VOR",
    "feedback": "Tells whether a track equal to the selected bearing will bring you to or away from the VOR"
  },
  {
    "question": "On what carrier frequency does the inner marker transmit?",
    "feedback": "75 MHz."
  },
  {
    "question": "Which navigation error(s) of an on-board Required Navigation Performance (RNP) system can be monitored by the pilot?",
    "feedback": "Flight Technical Error (FTE)"
  },
  {
    "question": "A GPS satellite is marked \"unhealthy\" by:",
    "feedback": "the GPS control segment"
  },
  {
    "question": "On a 5-dot HSI when using the RNAV system in the approach mode (APR RNAV) what does a deviation of one dot indicate?",
    "feedback": "0.25 NM from desired track"
  },
  {
    "question": "The transponder code set in an SSR system consists of",
    "feedback": "4 digits, forming any of 4096 different codes"
  },
  {
    "question": "The information displayed to pilots when using a Microwave Landing System includes a ....",
    "feedback": "2D presentation of a 3D segmented approach"
  },
  {
    "question": "There are two NDBs, one 20 NM inland, and the other 50 NM inland from the coast. \nAssuming that the error caused by coastal refraction is the same for both propagations, the extent of the error in a position line plotted by an aircraft that is over water will be:",
    "feedback": "greater from the beacon that is 50 NM inland"
  },
  {
    "question": "The operating principle of a DME is the measurement of the:",
    "feedback": "time between the transmission and reception of radio pulses"
  },
  {
    "question": "What type of antenna is used in a modern Airborne Weather Radar?",
    "feedback": "Slotted planar antenna"
  },
  {
    "question": "The phenomenon of a change in direction of an EM wave occurring at an interface between two different media, so that the wave returns into the medium from which it originated, is called:",
    "feedback": "reflection"
  },
  {
    "question": "Making an MLS approach, the aircraft",
    "feedback": "Receives elevation information three times as frequent as azimuth information"
  },
  {
    "question": "The unit for measuring frequency is ......, and measures cycles ......:",
    "feedback": "Hertz     per second"
  },
  {
    "question": "An ABAS system is installed:",
    "feedback": "in an aircraft"
  },
  {
    "question": "An aircraft is flying on the true track 090° towards a VOR station located near the equator where the magnetic variation is 15°E. The variation at the aircraft position is 8°E.\nThe aircraft is on VOR radial:",
    "feedback": "255°"
  },
  {
    "question": "Range of VDF depends on:\n\n1) loudness of the voices of the pilot and the operator when transmitting\n2) power of airborne and ground transmitters\n3) power of pilot voice when transmitting\n4) aircraft altitude and ground transmitter elevation\n\nThe combination that regroups all of the correct statements is:",
    "feedback": "2, 4"
  },
  {
    "question": "Receiver Autonomous Integrity Monitoring (RAIM) is a method used to ensure the integrity of navigational data. With GNSS, this is achieved by ....",
    "feedback": "checking the consistency of the range measurements from a group of at least five satellites"
  },
  {
    "question": "You are on a magnetic heading of 055° and your ADF indicates a relative bearing of 325°. The QDM is:",
    "feedback": "020°"
  },
  {
    "question": "A full-scale deviation on a 5-dot CDI when using the RNAV system in the enroute mode represents a deviation from the desired track of:",
    "feedback": "5 NM"
  },
  {
    "question": "An aircraft ADF is tuned to a nearby NDB, identified as CLN. The RMI indication is presented on the navigation display (EHSI). If the magnetic variation is 7°W, what is the aircraft's QDM in relation to the CLN NDB?",
    "feedback": "168°"
  },
  {
    "question": "Which of the following options is correct for an LPV approach?",
    "feedback": "It is a non-precision approach"
  },
  {
    "question": "The letters QTX and adjacent symbol indicate a:",
    "feedback": "VOR/DME or VORTAC"
  },
  {
    "question": "Each range calculated by the GPS receiver defines:",
    "feedback": "a sphere with its centre at the satellite"
  },
  {
    "question": "Radio waves travel at:",
    "feedback": "the speed of light"
  },
  {
    "question": "Errors caused by the effect of coastal refraction on bearings at lower altitudes are maximum when the NDB is:",
    "feedback": "inland and the bearing crosses the coast at an acute angle"
  },
  {
    "question": "What are the characteristics of a ground based augmentation system?",
    "feedback": "It increases accuracy in a relatively small area to allow approaches to a minimum comparable with a ILS CAT III approach"
  },
  {
    "question": "An aircraft is flying on the 050 radial with a MH of 250°. On the HSI the CRS is set to 060. Which HSI shows the correct indications?",
    "feedback": "Figure B"
  },
  {
    "question": "In it's simplest form, 2D RNAV may consist of",
    "feedback": "A VOR/DME receiver with an associated navigation computer"
  },
  {
    "question": "The time taken for the transmission of an interrogation pulse by a Distance Measuring Equipment (DME) to travel to the ground transponder and return to the airborne receiver was 2000 microseconds. \nThe slant range from the ground transponder was:",
    "feedback": "165 NM"
  },
  {
    "question": "Which physical effects affecting wave propagation as shown in the figure?",
    "feedback": "A = refraction  B = absorption  C = reflection"
  },
  {
    "question": "The process by which EM energy is taken up by the atmosphere is called:",
    "feedback": "absorption"
  },
  {
    "question": "Which frequency band is used by VOR transmissions?",
    "feedback": "VHF"
  },
  {
    "question": "A phantom station (as used in a 2D RNAV system is:",
    "feedback": "a waypoint defined by a radial and a DME distance from a VOR/DME station"
  },
  {
    "question": "Airborne weather radar uses a particularly high frequency radar signal, at 9 - 12 GHz, \nin order to",
    "feedback": "Get good returns from droplets of water and other sorts of precipitation"
  },
  {
    "question": "The selection of code 7600 on an aircraft SSR transponder indicates:",
    "feedback": "radio communication failure"
  },
  {
    "question": "A DME is located at MSL.\nAn aircraft passing vertically above the station at flight level FL 360 will obtain a DME range of approximately:",
    "feedback": "6 NM"
  },
  {
    "question": "In order to fly a segmented approach using an MLS system, the minimum installed equipment must include:",
    "feedback": "DME/P"
  },
  {
    "question": "What are key areas of the navigation specification of RNAV systems?\n1) accuracy2) performance3) integrity4) application5) continuity",
    "feedback": "1, 3, 5"
  },
  {
    "question": "Using a primary radar,",
    "feedback": "All 3 answers are correct"
  },
  {
    "question": "When a GPS receiver is using barometric altitude as an augmentation to RAIM:",
    "feedback": "the number of satellites to perform the RAIM function may be reduced by one"
  },
  {
    "question": "A VOR is situated at the far end of a runway on which an aircraft is making an ILS approach. Nav 1 is switched to the localiser frequency and Nav 2 to the VOR frequency. At the moment that the needle of #1 indicator reaches the outer dot the deflection of the needle of #2 indicator will be at:",
    "feedback": "approximately a quarter of the scale"
  },
  {
    "question": "Which navigation aid may be allocated the frequencies 108.4 MHz and 110.5 MHz?",
    "feedback": "108.4 MHz may be allocated to a VOR and 110.5 MHz to an ILS"
  },
  {
    "question": "A VOR receiver with a phase comparison of 90° is on radial:",
    "feedback": "east"
  },
  {
    "question": "AAIM (Aircraft Autonomous Integrity Monitoring) is a type of Airborne Based Augmentation System that",
    "feedback": "relies on GNSS information as well as information from additional on-board sensors"
  },
  {
    "question": "Basic Receiver Autonomous Integrity Monitoring (RAIM) of GNSS signals requires (1) .... satellites with good geometry. For Fault Detection and Exclusion (FDE) (2) .... satellites are required",
    "feedback": "(1) five, (2) six"
  },
  {
    "question": "act QDM 140°\nact HDG 020°\nreq QDM 110°\nFirst turn?",
    "feedback": "Left HDG 155°"
  },
  {
    "question": "A crew is flying an RNP approach using GNSS, and the navigation display shows a value called the Estimated Position Error (EPE). What is the EPE?",
    "feedback": "A value calculated by using a statistical model of position error probabilities"
  },
  {
    "question": "What approximate rate of descent is required in order to maintain a 3° glidepath at a groundspeed of 90 kt?",
    "feedback": "450 FT/MIN"
  },
  {
    "question": "ADF is the abbreviation for:",
    "feedback": "Automatic Direction Finder"
  },
  {
    "question": "RNAV 1 and RNP 1 are used",
    "feedback": "in the arrival and departure phases of flight"
  },
  {
    "question": "What are additional aircraft parameters that are downlinked from Mode S Enhanced Surveillance (EHS) transponders?\n1) ground speed2) magnetic heading3) equivalent speed4) true heading5) vertical rate",
    "feedback": "1, 2, 5"
  },
  {
    "question": "During a flight at FL 210, a pilot does not receive any DME distance indication from a DME station located approximately 220 NM away.\nThe reason for this is that the:",
    "feedback": "aeroplane is below the 'line of sight' altitude"
  },
  {
    "question": "What are the potential dangers of operating an Airborne Weather Radar (AWR) on the ground? Radiated energy can ....",
    "feedback": "harm human beings"
  },
  {
    "question": "An RMI indicates aircraft heading. To convert the RMI bearings of NDBs and VORs to true bearings the correct combination for the application of magnetic variation is:",
    "feedback": "NDB: aircraft position\nVOR: beacon position"
  },
  {
    "question": "The ILS inner marker (if available) modulation frequency is:",
    "feedback": "3000 Hz"
  },
  {
    "question": "VLF (very low frequency) waves appear in the frequency spectrum:",
    "feedback": "3 KHz - 30 KHz"
  },
  {
    "question": "The ILS marker identified visually by a blue light flashing is the:",
    "feedback": "outer marker"
  },
  {
    "question": "An aircraft is maintaining an airway centreline of 000°, defined by a VOR ahead of the aircraft. Variation at the VOR is 5E. At 60 NM to go the QDM is 004. The aircraft's position relative to the airway lateral boundary is:",
    "feedback": "1 NM inside the airway's western boundary"
  },
  {
    "question": "In PBN operations, both linear and angular lateral guidance can be used in the approach phase of flight, depending on the procedure and minima. The maximum allowable error or deviation from the planned track in this phase of flight is expressed in ......",
    "feedback": "nautical miles for cross track lateral deviation for linear operation and in degrees needle deflection on the Course Deviation Indicator (CDI) for angular operation"
  },
  {
    "question": "The maximum theoretical range at which an aircraft at FL210 may receive signals from a VOR facility sited 340 feet above mean sea level is approximately:",
    "feedback": "204 NM"
  },
  {
    "question": "The phase angle of a wave is:",
    "feedback": "the fraction of one wavelength expressed in degrees from 000° to 360°"
  },
  {
    "question": "An SBAS (Satellite Based Augmentation System) consists of:",
    "feedback": "3 elements"
  },
  {
    "question": "What frequency range does DME operate on?",
    "feedback": "960 - 1215 MHz"
  },
  {
    "question": "How can a DME-interrogator distinguish between its own reply pulse-pairs and the reply pulse-pairs of other aircraft in the area, using the same DME-station?",
    "feedback": "The Pulse Repetition Frequency of the pulse-pairs transmitted by the interrogator varies, for each interrogator, in a unique rhythm."
  },
  {
    "question": "Where, in relation to the runway, is the ILS localiser transmitting aerial normally situated?",
    "feedback": "On the non-approach end of the runway about 300 m from the runway on the extended centreline"
  },
  {
    "question": "ICAO DOC 9613 describes the Performance-Based Navigation (PBN) Concept:\n1) Integrity is defined as the conformance of the true position and the required position2) Integrity is a measure of the trust that can be placed in the correctness of the information supplied3) Unlike conventional navigation, PBN is not sensor-specific4) RNAV and RNP systems are necessary to optimise the utilisation of available airspace5) Accuracy is the capability of the system to perform its function without unscheduled interruptions\nThe combination regrouping all of the correct statements is:",
    "feedback": "2, 3, 4"
  },
  {
    "question": "A radio beacon has an operational range of 10 NM. By what factor should the transmitter power be increased in order to achieve an operational range of 20 NM?",
    "feedback": "Four"
  },
  {
    "question": "The pilot of a light aircraft is plotting the position of the aircraft using a VOR bearing and an NDB bearing. Both bearings are displayed on an RMI with two pointers. What is the true bearing to plot from the NDB, given the following information?\nDeviation: 2°WVariation: 6°E",
    "feedback": "270*"
  },
  {
    "question": "The ADF reception loop is always used so that the electromotive force (EMF)",
    "feedback": "induced is zero"
  },
  {
    "question": "Refer to Route Manual chart E(LO)2: The magnetic heading of an aircraft is 040°. On the Airborne Weather Radar display the relative bearing of and the distance to the most southerly part of Lands End (approximate position: 50°03'N, 005°40'W) are 030°R and 80 NM.  What is the position of the aircraft based on these observations? (The slant range correction and the map convergency between aircraft position and Lands End may be neglected)",
    "feedback": "(49°25'N, 007°30'W)"
  },
  {
    "question": "What is the heading bug selected to?",
    "feedback": "260°(M)"
  },
  {
    "question": "The term \"keying\" means:",
    "feedback": "Interrupting the carrier wave to break it into dots and dashes"
  },
  {
    "question": "What are the characteristics of a satellite based augmentation system?",
    "feedback": "It increases accuracy in a wide area to allow approaches to a minimum comparable with a ILS CAT I approach"
  },
  {
    "question": "Which answer is correct concerning information determined and shown by ATC PSR (Primary Surveillance Radar) and SSR (Secondary Surveillance Radar) systems?",
    "feedback": "PSR determine and show target range, bearingSSR determine and show target range, bearing, aircraft identification codes, aircraft altitude, selective addressing, full two-way data link"
  },
  {
    "question": "Which of the following statements regarding B-RNAV is correct?",
    "feedback": "For 95% of the flight time, the track keeping accuracy must not exceed 5 NM"
  },
  {
    "question": "Preparing for an approach, the pilots tune two NDB frequencies which are situated in similar geographical locations. NDB 1 has a significantly higher power output than NDB 2. Which option below is correct regarding the probable NDB ranges?",
    "feedback": "NDB 1 has the greater range"
  },
  {
    "question": "Why is a secondary radar display screen free of storm clutter?",
    "feedback": "The principle of 'echo' return is not used in secondary radar"
  },
  {
    "question": "The QUJ is 335° by VDF. The variation of a VOR at the same position is 12°W. What is the phase difference between the reference and variable signals in the aircraft's receivers from that VOR?",
    "feedback": "167°"
  },
  {
    "question": "Which combination of characteristics gives best screen picture in a primary search radar?",
    "feedback": "short pulse length and narrow beam"
  },
  {
    "question": "One of the tasks of the GPS control segment is:",
    "feedback": "to detect the malfunctioning of satellites"
  },
  {
    "question": "Which of the following are the components of PBN?\n1) The NAVAID infrastructure2) The aircraft type3) The navigation specification4) Communications5) The navigation application6) ATS surveillance7) ATM",
    "feedback": "1, 3, 5"
  },
  {
    "question": "With respect to the monitoring system of a VOR which statement is correct?",
    "feedback": "Failure of the VOR station to stay within the required limits can cause the removal of identification and navigation components from the carrier or radiation to cease"
  },
  {
    "question": "A primary pulse radar system operates with a pulse repetition frequency of 1200 pps. The maximum theoretical range of the system is:",
    "feedback": "125 km"
  },
  {
    "question": "In an Airborne Weather Radar that has a colour cathode ray tube (CRT) increasing severity of rain and turbulence is generally shown by a change of colour from:",
    "feedback": "green to yellow to red"
  },
  {
    "question": "When using a DVOR, the pilot should be aware that the reference and variable signals are reversed. This:",
    "feedback": "improves the accuracy"
  },
  {
    "question": "In accordance with the ITU (International Telecommunication Union) a radio signal may be classified by three symbols. The first symbol indicates (e.g. A1A):",
    "feedback": "Type of modulation of the main carrier"
  },
  {
    "question": "The navigation radio of a small aircraft is tuned to the frequency of a VOR station. The aircraft flies in the line of sight of the station, when suddenly the identification Morse code is no longer being transmitted. What could be the reason for the ground station to stop transmitting the identification Morse code?",
    "feedback": "The transmission of the VOR station has gone out of the required accuracy limits"
  },
  {
    "question": "A pseudo range in GNSS is a range based on a:",
    "feedback": "time measurement using the receiver clock"
  },
  {
    "question": "The designated operational coverage of a VOR is:",
    "feedback": "an altitude and range limited by signal to noise ratio"
  },
  {
    "question": "Regarding the DME system, which one of the following statements is true?",
    "feedback": "The transponder reply carrier frequency differs by 63 MHz from that of the interrogation signal"
  },
  {
    "question": "What is the difference between the on-board navigation specifications RNP 1 and RNAV 1?",
    "feedback": "A performance monitoring and alerting function is required for RNP 1 only"
  },
  {
    "question": "Diffraction is the process by which:",
    "feedback": "radio wave travel over and around obstacles"
  },
  {
    "question": "The heading read on a standard RMI is",
    "feedback": "The compass heading"
  },
  {
    "question": "In using an airborne Doppler navigation system, the expected accuracy",
    "feedback": "Is 0,3% in ground speed"
  },
  {
    "question": "A fix obtained by rho-rho navigation is based on information of two:",
    "feedback": "DMEs"
  },
  {
    "question": "Homing on an NDB:",
    "feedback": "will in most situations result in frequent heading changes when approaching the NDB"
  },
  {
    "question": "An apparent increase in the transmitted frequency, which is proportional to the transmitter's velocity, will occur when:",
    "feedback": "the transmitter moves toward the receiver"
  },
  {
    "question": "Phase modulation:",
    "feedback": "is a modulation form used in GPS where the phase of the carrier wave is reversed"
  },
  {
    "question": "You are flying across northern Canada on airway NCA Whiskey. You wish to cross check the IRS computed position by taking a bearing from a nearby VOR. When tuning in the Churchill VOR you note, that you are on the 190° radial. What is the bearing to plot on a chat if the variation at the VOR is 2°W and the variation at the aircraft is 4°E?",
    "feedback": "188°"
  },
  {
    "question": "When an NDB fails which kind of warning is visible in the cockpit?",
    "feedback": "No warning"
  },
  {
    "question": "An aircraft is heading 075°M. The OBS is set to 025°. The VOR indications are TO with the needle showing right deflection. Relative to the station, the aircraft is situated in a quadrant defined by the radials:",
    "feedback": "205° and 295°"
  },
  {
    "question": "One of the tasks of the GPS control segment is:",
    "feedback": "to determine and send new ephemeris and new satellite clock errors data to the GPS satellites"
  },
  {
    "question": "What is the \"Q\" code for a magnetic bearing from a VDF station?",
    "feedback": "QDR"
  },
  {
    "question": "Which statement relating to the stabilization of airborne weather radar antennae is true?",
    "feedback": "They are stabilized with respect to the pitch and roll axis but not with respect to the yaw axis"
  },
  {
    "question": "A parabolic antenna:",
    "feedback": "is a directional antenna"
  },
  {
    "question": "Refer to the figures above: which aerial would be used in an ADF receiver?",
    "feedback": "Figure 3"
  },
  {
    "question": "The UHF band is the assigned frequency band of the:",
    "feedback": "ILS glide path transmitter"
  },
  {
    "question": "Single Side Band (SSB) is used:",
    "feedback": "in HF two-way communication"
  },
  {
    "question": "How can RNAV 1, RNAV 2, RNP 1 and RNP 2 routes be modified by pilots?",
    "feedback": "By inserting or deleting specific waypoints, in response to an ATC clearance"
  },
  {
    "question": "ILS beam bends are....",
    "feedback": "related to the nominal positions of the localiser course and glide path respectively, and can be checked by flight tests"
  },
  {
    "question": "An aircraft flying out of sight of land, using GNSS and ABAS (without SBAS), briefly loses power to the IRS. Due to the temporary power loss, the navigation information of the IRS is lost. What effect could this failure have on how GNSS is used during the flight?",
    "feedback": "Reducing ABAS to RAIM and barometric altitude only"
  },
  {
    "question": "The elementary surveillance provides the ATC controller with the:",
    "feedback": "aircraft's position, altitude and identification"
  },
  {
    "question": "Which of the following is likely to have the greatest effect on ADF accuracy?",
    "feedback": "Interference from other NDBs, particularly at night"
  },
  {
    "question": "The Secondary Surveillance Radar (SSR) system used by aircraft transponders is based on the transmission of (1) .... from the ATC secondary radar and (2) .... from the airborne transponder.",
    "feedback": "(1) interrogations, (2) replies"
  },
  {
    "question": "In relation to the satellite navigation system NAVSTAR/GPS, 'All in View' is a term used when a receiver:",
    "feedback": "is tracking more than the required 4 satellites and can instantly replace any lost signal with another already being monitored"
  },
  {
    "question": "An error during PBN operations arising from the RNAV system and its inability to accurately specify the desired path is a:",
    "feedback": "Path Definition Error (PDE)"
  },
  {
    "question": "An aircraft plans to fly an RNP APCH to LNAV/VNAV minima based on barometric VNAV. In which segment(s) of the approach can temperature compensation systems with an airworthiness approval provide corrections to the Baro-VNAV guidance?",
    "feedback": "Final approach segment"
  },
  {
    "question": "The frequency of an Airborne Weather Radar is 9.33 GHz. What is the corresponding wavelength?",
    "feedback": "3.2 cm"
  },
  {
    "question": "The total system error (TSE) during a PBN operation encompasses:",
    "feedback": "Path Definition Error (PDE), Flight Technical Error (FTE), Navigation System Error (NSE)"
  },
  {
    "question": "Flying over Russia DME slant range reads 1.5 NM. The aircraft on the approach is flying 1000 m above the DME elevation.\nThe distance from the ground position to the DME station is:",
    "feedback": "2591 m"
  },
  {
    "question": "The MIDDLE MARKER of an Instrument Landing System (ILS) facility is identified audibly and visually by a series of:",
    "feedback": "alternate dots and dashes and an amber light flashing"
  },
  {
    "question": "Under CS-25 colour code rules, features displayed in red on an Electronic Flight Instrument System (EFIS), indicate:",
    "feedback": "warnings; flight envelope and system limits"
  },
  {
    "question": "Considering PBN operations, what is an advantage of navigating using computed data, compared to raw data? The area navigation system will:",
    "feedback": "Check the validity and in some cases consistency of sensor data before use"
  },
  {
    "question": "Which of the following items, selected by the pilot of an aircraft with Mode S Enhanced Surveillance (EHS), can be shown on the radar controllers SSR display?",
    "feedback": "Selected altitude"
  },
  {
    "question": "Which frequency can be used by a terminal VOR?",
    "feedback": "108.20 MHz"
  },
  {
    "question": "In the SSR response, the operation of the transponder IDENT button:",
    "feedback": "sends a special pulse after the normal response pulse train"
  },
  {
    "question": "When the ATC transponder \"IDENT\" button is pressed by the pilot",
    "feedback": "The airplane's  echo on the controller's display will flash or \"fill in\""
  },
  {
    "question": "The 'O' followed by the letters 'KABC' indicate:",
    "feedback": "an off-route airport"
  },
  {
    "question": "A basic RNAV (B-RNAV) system requires:",
    "feedback": "RNP5"
  },
  {
    "question": "Refer to the figure.\nWhich aerial would be used in a VDF transmitter?",
    "feedback": "4"
  },
  {
    "question": "Which statement is true regarding an offset flight path?",
    "feedback": "It allows the crew to specify a lateral offset from a defined route"
  },
  {
    "question": "Comparing a parabolic reflector with a flat plate antenna of the same size:",
    "feedback": "the flat plate antenna generates less side lobes than the parabolic reflector"
  },
  {
    "question": "Using SSR, the normal transmission from the ATC transponder in the aircraft consists of",
    "feedback": "The two pulses received plus an additional number of pulses between them"
  },
  {
    "question": "Using the airborne weather radar, before take-off",
    "feedback": "The radar transmitter should not be operated when personnel is observed in the sector ahead of the aircraft"
  },
  {
    "question": "The maximum pulse repetition frequency (PRF) that can be \nused by a primary radar facility in order to detect targets \nunambiguously at a range of 50 NM is:\n(pps = pulses per second)",
    "feedback": "1620 pps"
  },
  {
    "question": "The Satellite Based Augmentation Systems include:",
    "feedback": "WAAS in the USA, EGNOS in Europe, MSAS in Japan, GAGAN in India"
  },
  {
    "question": "The ILS outer marker modulation frequency is:",
    "feedback": "400 Hz"
  },
  {
    "question": "The clock correction parameters in the navigation message are used for:",
    "feedback": "correction of the satellite time"
  },
  {
    "question": "An aircraft is flying on a MH of 210°. The magnetic variation at the VOR is 5°W and at the aircraft 10°W. Which VOR-RMI corresponds to the indications on the CDI shown below?",
    "feedback": "Figure D"
  },
  {
    "question": "In order to give the flight crew control of the required lateral guidance functions, the RNAV equipment should be able to perform a number of functions.  Which of the following is not such a function?",
    "feedback": "execute a modified flight plan without any positive action by the flight crew"
  },
  {
    "question": "An aircraft is equipped with a DME receiver that provides a ground speed readout. It is flying a DME arc and is descending in an approach procedure. The ground speed calculated by the DME computer is ....",
    "feedback": "zero knots as the slant range remains constant"
  },
  {
    "question": "Which statement is true about the use of the Doppler effect in a Doppler VOR?",
    "feedback": "The Doppler effect is used to create a signal which is received by the aircraft's VOR receiver as a frequency modulated signal"
  },
  {
    "question": "Considering a primary radar system, what kind of aerials are used?",
    "feedback": "One directional antenna both for transmitting and for receiving"
  },
  {
    "question": "The Secondary Surveillance Radar (SSR) Mode S transponder will transmit a 24-bit Aircraft Address (AA). This Aircraft Address is ....",
    "feedback": "a unique identification number that is hard-coded into the transponder"
  },
  {
    "question": "The Performance Based Navigation (PBN) concept uses terms to describe the requirements of each navigation specification. Which of the following terms defines the capability of the system to perform its function without unscheduled interruptions during the intended operation?",
    "feedback": "Continuity"
  },
  {
    "question": "ICAO DOC 9613 (PBN) defines a set of navigation specifications applicable to different airspace concepts. The navigation specification RNP 2 applies to:",
    "feedback": "The en-route phase of flight in oceanic/remote and continental areas"
  },
  {
    "question": "What is the frequency of a radio wave with a wavelength of 2.54 m?",
    "feedback": "118.1 MHz"
  },
  {
    "question": "MLS is primarily being installed at airports where ....",
    "feedback": "ILS encounters difficulties because of surrounding buildings and/or the terrain or interference from local music stations"
  },
  {
    "question": "Which facility associated with the ILS may be identified by a two-letter identification group?",
    "feedback": "Locator"
  },
  {
    "question": "The basic functional requirements of RNAV and RNP specifications are:\n1) continuous indication of lateral deviation2) distance and bearing to active waypoint3) ground speed or time to active waypoint4) navigation data storage5) failure indication\nThe combination regrouping all of the correct statements is:",
    "feedback": "1, 2, 3, 4, 5"
  },
  {
    "question": "Where is pulse modulation used?",
    "feedback": "In radar"
  },
  {
    "question": "Which one of the following lists information given by a basic VOR/DME-based Area Navigation System?",
    "feedback": "Crosstrack distance; distance to go"
  },
  {
    "question": "Define the term \"modulation\":",
    "feedback": "the addition of information onto a radio wave during transmission"
  },
  {
    "question": "The tilt of an Airborne Weather Radar is lowered whilst searching for thunderstorms in high-level cruise flight. Why is that?",
    "feedback": "The greatest reflectivity occurs from wet hail and rain, these elements usually exist in the lower levels of a thunderstorm"
  },
  {
    "question": "Which of the following alternatives is correct regarding audio and visual signals in the cockpit when passing overhead a middle marker?",
    "feedback": "Audio: 1300 Hz, alternating dots and dashes. Visual: Amber light flashes"
  },
  {
    "question": "When the term \"radial\" is used with reference to VOR, it means:",
    "feedback": "the magnetic bearing from the VOR station"
  },
  {
    "question": "Which of the following is not improved by the application of differential GPS?",
    "feedback": "Multi-path effects"
  },
  {
    "question": "Given the following information, what is the true bearing from the NDB to the aircraft?\nCompass Heading: 241°Relative Bearing Indicator (RBI) - needle head: 162°Deviation: +3°Variation: 13°Ethe effect of convergence can be ignored",
    "feedback": "239°(T)"
  },
  {
    "question": "Which of the following data can be found in the navigation database?\n\n1) SIDs and STARs\n2) radio aids\n3) optimum flight level\n4) company routes\n5) cruise speeds\n\nThe combination that regroups all of the correct statements is:",
    "feedback": "1, 2, 4"
  },
  {
    "question": "Refer to the indication of the EFIS: What does the amber text \"RNP 1.00\" and \"ANP 1.35\" mean?",
    "feedback": "The colour of the text is amber because the navigation performance is too low"
  },
  {
    "question": "GPS system satellites transmit their signals on two carrier waves 1575 MHz and 1227 MHz and supply two possible codes accessible according to user (civil or military).\nCommercial aviation uses:",
    "feedback": "only the 1 575 MHz carrier wave and one code"
  },
  {
    "question": "Radio waves in the VHF and higher frequency bands propagate mainly as:",
    "feedback": "space waves"
  },
  {
    "question": "In Airborne Weather Radar (AWR), the main factors which determine whether a cloud will be detected are:",
    "feedback": "size of the water drops;\nwavelength/frequency used"
  },
  {
    "question": "Which of the following correctly describes the principle of Receiver Autonomous Integrity Monitoring (RAIM)? RAIM ....",
    "feedback": "requires at least five satellites with good geometry to provide the service of detecting faulty signals and alerting the crew"
  },
  {
    "question": "The DME Line Of Position is a circle with radius:",
    "feedback": "the ground distance and centre the DME station"
  },
  {
    "question": "In the PBN concept, which of the following factors are used to define aircraft RNAV or RNP system performance requirements?\n1) Accuracy2) Procedures3) Integrity4) Redundancy5) Continuity",
    "feedback": "1, 3, 5"
  },
  {
    "question": "An ILS marker beacon operates in the:",
    "feedback": "VHF band"
  },
  {
    "question": "Check the following statements for a 4D RNAV system:\n1) The system has \"direct to\" capability to any waypoint\n2) The system is capable of parallel offset tracking",
    "feedback": "1) is correct, 2) is correct"
  },
  {
    "question": "What is the most appropriate conclusion to make about the weather conditions in the area behind intense precipitation, being displayed by the Airborne Weather Radar, if no radar returns are received from that area?",
    "feedback": "The weather conditions are unknown"
  },
  {
    "question": "What are the frequencies used for interrogation and response for SSR?",
    "feedback": "1030 MHz for interrogation from the ground, 1090 MHz for response from the aircraft"
  },
  {
    "question": "One of the tasks of the control segment of the satellite navigation system NAVSTAR/GPS is to:",
    "feedback": "monitor the status of the satellites"
  },
  {
    "question": "Which of the following cloud types is most readily detected by airborne weather radar when using the 'weather beam'?",
    "feedback": "cumulus"
  },
  {
    "question": "The basic principle of operation of the ILS is the difference in depth of modulation (DDM) between the two lobes:\n\n1) if the aircraft strays right, the higher tone lobe will be received at a higher intensity than the lower tone lobe\n2) a DDM of zero indicates the exact runway centreline\n3) the depth of modulation increases away from the centerline\n4) a DDM of zero indicates a balance between modulations\n\nThe combination that regroups all of the correct statements is:",
    "feedback": "1, 2, 3 and 4."
  },
  {
    "question": "Garbling in mode A and C may occur:",
    "feedback": "when two or more aircraft are in approximately the same direction from the interrogator with a difference in slant range of less than 1.7 NM."
  },
  {
    "question": "Which of the following lists all the parameters that can be determined by a GPS receiver tracking signals from 4 different satellites?",
    "feedback": "Latitude, longitude, altitude and time"
  },
  {
    "question": "PBN path terminator \"IF\" means",
    "feedback": "Initial Fix"
  },
  {
    "question": "MLS installations notified for operation, unless otherwise stated, provide azimuth coverage of:",
    "feedback": "+ or - 40° about the nominal courseline out to a range of 20 NM"
  },
  {
    "question": "Using an ADF indicator of the manually rotateable card type:",
    "feedback": "the card should be rotated so that the aircraft heading is at the top of the indicator"
  },
  {
    "question": "When an aircraft is operating its Secondary Surveillance Radar in Mode C an air traffic controller's presentation gives information regarding the aircraft's indicated pressure altitude in increments of:",
    "feedback": "100 FT"
  },
  {
    "question": "The selection of code 7700 on an aircraft SSR transponder indicates:",
    "feedback": "an emergency"
  },
  {
    "question": "The VOR radial an aircraft is on, depends upon:",
    "feedback": "the phase difference between the reference and variable phase"
  },
  {
    "question": "Two aircraft are located on (arbitrary) different radials but at equal distances from a VOR station. Which statement is true?",
    "feedback": "At a certain moment of time, the phase of the reference signals is equal and the phase of variable signals is unequal for both aircraft"
  },
  {
    "question": "When using an RMI as an indicator for the VOR receiver",
    "feedback": "You will read the number of the received radial under the tail of the VOR needle"
  },
  {
    "question": "In the GPS system Receiver Autonomous Integrity Monitoring (RAIM)",
    "feedback": "Means that the receiver evaluates the signals from 5 satellites and discards the signals       from a satellite exhibiting anomalous pseudo range errors"
  },
  {
    "question": "FM broadcast stations transmitting just below 108 MHz are:",
    "feedback": "likely to cause interference to ILS receivers not equipped with an immunity filter"
  },
  {
    "question": "During flight, a pilot is alerted that the aircraft's ANP is greater than the RNP. The aircraft's navigational accuracy (1) ...... within acceptable limits, as navigational accuracy is defined as the difference between the required aircraft position and its (2) ...... position.",
    "feedback": "(1) is not, (2) true"
  },
  {
    "question": "The databases on a FMC:",
    "feedback": "are read only"
  },
  {
    "question": "Which of the following, if any, is a prerequisite if a receiver of a NAVSTAR/GPS satellite navigation system is to be used in combination with a multi sensor system?",
    "feedback": "The prescribed IFR-equipment must be installed and operational"
  },
  {
    "question": "How does a NAVSTAR/GPS satellite navigation system receiver recognise which of the received signals belongs to which satellite?",
    "feedback": "Each satellite transmits its signal, on common frequencies, with an individual Pseudo Random Noise code"
  },
  {
    "question": "In accordance with ICAO Annex 10 the GPS NAVSTAR position accuracy in SPS should be for 95% of the time:",
    "feedback": "13 metres horizontally"
  },
  {
    "question": "Output from which of the following combination of navigational sources provide enough information to the RNAV equipment to calculate the wind vector?",
    "feedback": "Inertial Reference System and Air Data Computer"
  },
  {
    "question": "Given:\nAircraft position 34°15'N 098°E, magnetic variation 28°W, FL 280.\nPTC VOR/DME position 36°12'N 098°E, magnetic variation 13°E.\n\nIn order to read the most accurate ground speed given by the DME receiver from his present position, the pilot must fly on which PTC radial?",
    "feedback": "167°"
  },
  {
    "question": "Which of the following system are considered augmentation systems?",
    "feedback": "LAAS, WAAS, EGNOS"
  },
  {
    "question": "The cosecant squared beam is used for mapping in the AWR because:",
    "feedback": "a larger area of ground is illuminated by the beam"
  },
  {
    "question": "The AWR can be used on the ground, provided:\n\n1) The aircraft is clear of personnel, buildings and vehicles\n2) The conical beam is selected\n3) Maximum tilt-up is selected\n4) The AWR must never be operated on ground\n\nThe correct statement(s) is (are):",
    "feedback": "1, 2, 3"
  },
  {
    "question": "In relation to the satellite navigation system NAVSTAR/GPS, \nthe term 'inclination' denotes the angle between the:",
    "feedback": "orbital plane and the equatorial plane"
  },
  {
    "question": "On a CVOR the phase difference between the AM and FM signals is 30°. The VOR radial is:",
    "feedback": "030"
  },
  {
    "question": "What describes \"Polarisation\"?",
    "feedback": "The orientation of the plane of oscillation of the electrical component of the electromagnetic wave"
  },
  {
    "question": "A full-scale deviation on a 5-dot CDI when using the RNAV system in the VOR/DME mode represents a deviation from the desired track of:",
    "feedback": "10°"
  },
  {
    "question": "Which statement about the pseudo-range correction determined by a Satellite Based Augmentation System (SBAS) is correct?",
    "feedback": "The pseudo-range correction for a certain satellite is split up in separate corrections for the ephemeris error, the satellite clock error and the ionospheric error"
  },
  {
    "question": "For performance based navigation (PBN) operations, the PBN navigation database cycle must be valid for ......",
    "feedback": "28 days"
  },
  {
    "question": "Which one of the following correctly lists the major ground based components of a Microwave Landing System (MLS)?",
    "feedback": "Separate azimuth and elevation transmitters, DME facility"
  },
  {
    "question": "An aircraft DME receiver does not lock on to its own transmissions reflected from the ground because:",
    "feedback": "they are not on the receiver frequency"
  },
  {
    "question": "For a parabolic reflector to make a narrow beam",
    "feedback": "The size must be large compared to the wavelength"
  },
  {
    "question": "Which of the following statements concerning augmentation systems is true?",
    "feedback": "An augmentation system can only enhance a preexisting position information of a GNSS"
  },
  {
    "question": "What is one of the advantages of GLS (GBAS Landing System) compared to ILS?",
    "feedback": "GLS allows for more precise navigation within the vicinity of the airfield"
  },
  {
    "question": "In CBs with lightning and thunderstorms, disturbances in radio communication and/or significant fluctuations in NDB bearings may occur.\nThese disturbances/fluctuations are caused by:",
    "feedback": "statics"
  },
  {
    "question": "The distance between a NAVSTAR/GPS satellite and receiver is:",
    "feedback": "determined by the time taken for the signal to arrive from the satellite multiplied by the speed of light"
  },
  {
    "question": "The VDB (VHF data broadcast) broadcasts the GBAS signal within its coverage area to avionics in GBAS-equipped aircraft. The VDB signal provided are:",
    "feedback": "Error correction data, integrity data and approach data for more than one runway"
  },
  {
    "question": "Considering PBN procedures, which of the following RNP/RNAV specifications allows the pilot to manually define waypoints not already in the FMS database?",
    "feedback": "RNAV 5"
  },
  {
    "question": "Which of the following lists the phenomena least likely to be detected by radar?",
    "feedback": "clear air turbulence"
  },
  {
    "question": "Assuming sufficient transmission power, the maximum range of a ground radar with a pulse repetition frequency of 450 pulses per second is: (Given: velocity of light is 300 000 km/second)",
    "feedback": "333 km"
  },
  {
    "question": "Which navigation aid may be allocated the frequencies 108.4 MHz and 109.5 MHz?",
    "feedback": "108.4 MHz may be allocated to a VOR and 109.5 MHz to an ILS"
  },
  {
    "question": "For what reason is a mask angle set-up in a GPS receiver?",
    "feedback": "To deny the receiver the use of GPS satellites with an elevation less than the mask angle"
  },
  {
    "question": "The ground Secondary Surveillance Radar (SSR) equipment incorporates a transmitter and receiver respectively operating in the following frequencies:\n\n                        Transmitter          Receiver",
    "feedback": "1030 MHz      1090 MHz"
  },
  {
    "question": "Full scale deflection of the localiser needle indicates that the aircraft is approximately:",
    "feedback": "2.5° offset from the localiser centreline"
  },
  {
    "question": "The accuracy of the NAVSTAR GPS position depends on the geometry of the intersecting lines. Which of the following statements is correct?",
    "feedback": "If the satellites, as viewed by the GPS receiver, are close together, there will be a poor angle of intersection, resulting in a loss of accuracy"
  },
  {
    "question": "Locators are:",
    "feedback": "LF/MF NDBs used as an aid for final approach"
  },
  {
    "question": "Primary radar displays the following information:",
    "feedback": "Position"
  },
  {
    "question": "In an Airborne-Based Augmentation System (ABAS), the method of integrity monitoring that only uses information from the GNSS is called ....",
    "feedback": "Receiver Autonomous Integrity Monitoring (RAIM)"
  },
  {
    "question": "Regarding tilt management of an airborne weather radar: When flying in a large transport aeroplane at FL330, in an area with thunderstorms, the best practice is to....",
    "feedback": "reduce the tilt angle as the ice crystals at this altitude do not reflect"
  },
  {
    "question": "Airborne Weather Radar has been primarily developed to detect:",
    "feedback": "the kinds of precipitation which are usually accompanied by turbulence"
  },
  {
    "question": "A primary pulse radar system operates with a pulse repetition frequency of 550 Hz. The maximum theoretical range of the system is:",
    "feedback": "147 NM"
  },
  {
    "question": "There are four types of marker beacons, all transmitting on the same carrier frequency:",
    "feedback": "Airway marker (fan marker) Outer marker, Middle marker, Inner marker"
  },
  {
    "question": "The wavelength of a radio transmitted on frequency 121.95 MHz is:",
    "feedback": "2.46 m"
  },
  {
    "question": "If the ILS monitoring equipment  senses a shift or change outside set limits in the basic \ntransmission",
    "feedback": "The transmissions on a Cat I ILS will be stopped within 6 seconds"
  },
  {
    "question": "The Shoreline/Coastal Effect is caused by refraction of the radio waves. What is one factor influencing the error of the bearing?",
    "feedback": "Flight altitude"
  },
  {
    "question": "Which of the following are input data used by 4D RNAV systems?\n1) DME distances from DME stations2) Wind vectors3) Radials from VOR stations4) TAS and fuel flow",
    "feedback": "1, 3"
  },
  {
    "question": "What is required to fly an RNP approach with LPV minima?",
    "feedback": "SBAS and FAS data block"
  },
  {
    "question": "To enter a holding pattern based on a VORDME fix, which entry sectors are permissible when following a DME arc entry track?",
    "feedback": "1, 3"
  },
  {
    "question": "A loop aerial, as used in the ADF, will",
    "feedback": "Receive a minimum or null signal from a transmitter when the plane of the loop is at\nright angles to the direction of the transmitter"
  },
  {
    "question": "RNP 1 could be used for:",
    "feedback": "Helicopter routes"
  },
  {
    "question": "Which of the following is the datum for altitude information when conducting flights under IFR conditions on airways using the NAVSTAR/GPS satellite navigation system?",
    "feedback": "Barometric altitude"
  },
  {
    "question": "The ILS marker identified visually by an amber light flashing is the:",
    "feedback": "middle marker"
  },
  {
    "question": "With respect to the principle of distance measurement using DME can be stated that: \n\n1) the interrogation signal is transmitted on the same frequency as the reply signal \n2) the DME station always has a transponder delay of 50 milliseconds \n3) the time between the pulse pairs of the interrogation signal is at random\n4) In the search mode more pulse pairs per second are transmitted than in the tracking mode \n\nWhich of the above given statements are correct?",
    "feedback": "3 and 4"
  },
  {
    "question": "The influence of the ionosphere on the accuracy of the satellite navigation system NAVSTAR/GPS is:",
    "feedback": "minimised by the receiver using a model of the atmosphere and comparing signals transmitted by the satellites"
  },
  {
    "question": "Skip distance is the:",
    "feedback": "range from the transmitter to the first sky wave"
  },
  {
    "question": "Due to Doppler effect an apparent decrease in the transmitted frequency, which is proportional to the transmitter's velocity, will occur when:",
    "feedback": "the transmitter moves away from the receiver"
  },
  {
    "question": "The frequency of a VOR is 117.5 MHz. What is the corresponding wavelength?",
    "feedback": "2.55 m"
  },
  {
    "question": "When tracking a VOR radial inbound, the aircraft flies:",
    "feedback": "a great circle track"
  },
  {
    "question": "Which one of the statements below is correct regarding the DME?",
    "feedback": "The DME operating frequencies are in the UHF frequency band"
  },
  {
    "question": "A radio signal loses strength as range from the transmitter increases, this is called :",
    "feedback": "attenuation"
  },
  {
    "question": "What is the value of the selected course?",
    "feedback": "299°(M)"
  },
  {
    "question": "3D approach operations are very common nowadays. Which of the following options belong to this type of approach?\n1) RNP APCH (GNSS and Baro-VNAV)2) GLS3) PAR4) RNP 15) ILS6) RNP APCH (SBAS)",
    "feedback": "1, 2, 3, 5, 6"
  },
  {
    "question": "RNP 0.3 navigation specification is used:",
    "feedback": "in all phases of flight, except for oceanic, remote and final approach phases"
  },
  {
    "question": "In accordance with the ITU (International Telecommunication Union) a radio signal may be classified by three symbols. The second symbol indicates (e.g. A1A):",
    "feedback": "Nature of signal(s) modulating the main carrier"
  },
  {
    "question": "What indication, if any, is given in the B737-400 Flight Management System if radio updating is not available?",
    "feedback": "A warning message is displayed on the EHSI and MFDU"
  },
  {
    "question": "PBN path terminator \"CA\" means",
    "feedback": "Course to Altitude"
  },
  {
    "question": "Given: Aircraft position 36°15'S 178°E, magnetic variation 21°W, FL 310. UEB VOR/DME position 36°15'S 178°W, magnetic variation 21°E.  In order to read the most accurate ground speed given by the DME receiver from his present position, the pilot must follow which UEB radial?",
    "feedback": "249°"
  },
  {
    "question": "For PBN operations, what is correct regarding fly-by waypoints and fly-over waypoints?",
    "feedback": "For fly-by waypoints, the turn is commenced prior to reaching the waypoint, and for fly-over waypoints the turn is commenced when overhead the waypoint"
  },
  {
    "question": "Refer to figure 2B. If the adjustment knob is turned clockwise by 3°, what would happen with the LOC course deviation indicator needle?",
    "feedback": "It does not change its position"
  },
  {
    "question": "Which of the following could give guidance to the pilot on a curved MLS approach?",
    "feedback": "Flight Director bars"
  },
  {
    "question": "Which of the following statements concerning the L1 and L2 NAVSTAR/GPS transmission frequencies and codes is correct?",
    "feedback": "The higher frequency is used to transmit both the C/A and P codes"
  },
  {
    "question": "The phase difference between the reference and variable signals on QDM 050° (VAR 10°W) for a conventional VOR is:",
    "feedback": "230°"
  },
  {
    "question": "The main factor that limits the range of an NDB is:",
    "feedback": "the transmitted power"
  },
  {
    "question": "The navigational function of the Horizontal Situation Indicator (HSI) in relation to Area Navigation Systems is:",
    "feedback": "the indication of the cross track distance (XTK)"
  },
  {
    "question": "A secondary radar can provide up to 4096 different codes.\nThese 4096 codes can be used in:",
    "feedback": "all modes"
  },
  {
    "question": "An airborne weather radar is using a 3° beam. A cloud is detected at a range of 40 NM. If the scanner is tilted up to 3° the cloud echo disappears. The top of the cloud, in relation to the aeroplane's cruising level is approximately:",
    "feedback": "6000 ft above the level"
  },
  {
    "question": "Which of the following statements about the accuracy that can be obtained with the differential technique (D-GPS) of the satellite navigation system NAVSTAR/GPS is correct?",
    "feedback": "The nearer a receiver is situated to a D-GPS ground station, the more accurate the position fix"
  },
  {
    "question": "Consider the following statements on horizontal/slant distance when using DME:",
    "feedback": "The difference between the two distances will be negligible for en-route navigation when the indicated distance in NM is more than the height of the aircraft above the DME site, stated in thousands of feet"
  },
  {
    "question": "Check the correctness of the following statements:\n1) Conventional radio navigation is based on raw data from specific navaids such as VOR, DME, or NDB2) PBN is mainly based on sensor-based data (raw data)",
    "feedback": "1) is correct, 2) is not correct"
  },
  {
    "question": "What does the abbreviation AR mean in RNP AR APCH?",
    "feedback": "Authorisation Required"
  },
  {
    "question": "A pilot is tracking inbound to a VOR on a designated radial using the HSI. The VOR ground station is located in an area with varying terrain and man-made obstructions. The pilot notices that the CDI is fluctuating slightly, even though he/she is constantly and accurately tracking inbound to the station and there is no apparent wind effect. What is the term used to describe these fluctuations?",
    "feedback": "Scalloping"
  },
  {
    "question": "The advantages of Secondary Surveillance Radar (SSR) compared to Primary Radar are that SSR (1) .... and has a longer range because (2) ....",
    "feedback": "(1) collects more data, (2) of the active participation of the aircraft's transponder"
  },
  {
    "question": "With regard to the range of NDBs and the accuracy of the bearings they provide can be stated that in general at night:",
    "feedback": "the range increases and the accuracy decreases"
  },
  {
    "question": "The ILS receiver of an aircraft on approach and flying on the right of the exact runway centreline will receive:",
    "feedback": "more of the 150 Hz localiser signal than the 90 Hz localiser signal"
  },
  {
    "question": "Which of the following frequencies is within the DME frequency band?",
    "feedback": "1000 MHz"
  },
  {
    "question": "Which statement regarding GLONASS is true?",
    "feedback": "GLONASS satellites orbit at lower height than GPS/NAVSTAR satellites"
  },
  {
    "question": "The navigation message of a GPS satellite contains the parameters of the model of the ionosphere. This enables:",
    "feedback": "the receiver to calculate the delay of GPS signals passing through the ionosphere"
  },
  {
    "question": "The inputs of information used to achieve the RNAV required accuracy may be: \n\n1) NDB \n2) IRS\n3) VOR/DME\n4) GNSS\n\nThe combination regrouping all the correct statements is:",
    "feedback": "2, 3 and 4."
  },
  {
    "question": "Refer to the top section of an approach plate for an RNP approach at LFPG:\nOne of the tasks that must be completed prior to commencing a flight is to have an awareness of what instrument approach procedures are available at the destination and alternate aerodromes.\nThe information that is highlighted in red means that....",
    "feedback": "GNSS approaches augmented by SBAS are available"
  },
  {
    "question": "Which letter in the figure below indicates the Skip Zone?",
    "feedback": "c"
  },
  {
    "question": "108.35 MHz can only be:",
    "feedback": "an ILS frequency"
  },
  {
    "question": "Airborne weather radar use a frequency of approximately 9 GHz because:",
    "feedback": "the wavelength is such that reflections are obtained only from the larger water droplets"
  },
  {
    "question": "The basic information given by the ADF is",
    "feedback": "The relative bearing from the aircraft to the NDB"
  },
  {
    "question": "Compared to the ILS, MLS has the following advantages:",
    "feedback": "Many different approaches to the same runway may be defined by 1 set of ground\nequipment"
  },
  {
    "question": "Locators transmit in the following frequency bands:",
    "feedback": "LF/MF"
  },
  {
    "question": "A DME measurement is initiated by:",
    "feedback": "the interrogator in the aircraft"
  },
  {
    "question": "Regarding the NAVSTAR/GPS which of the following is correct ?\n1) The satellites are distributed in 8 orbital planes with 3 satellites each\n2) The satellite completes an orbit in approximately 11h15min\n3) The satellites are orbiting inclined 55° to the plane of the equator\n4) All of the above",
    "feedback": "3"
  },
  {
    "question": "In the normal applications using Doppler shift registered in aircraft equipment",
    "feedback": "The Doppler shift will be doubled, because it is based on measuring the frequency of a reflected signal from the ground"
  },
  {
    "question": "Under which of the following circumstances does a VOR/DME Area Navigation system switch to Dead Reckoning mode?",
    "feedback": "The system is receiving information from only one VOR"
  },
  {
    "question": "An aircraft is equipped with a DME receiver that provides a ground speed readout. It is being flown at FL070 and crossing radial 090 from a VORDME station at an indicated range of 20 NM. The aircraft is flying in a northeasterly direction. The ground speed calculated by the DME computer is ....",
    "feedback": "inaccurate as the aircraft is crossing the radials rather than flying an inbound or outbound radial"
  },
  {
    "question": "The azimuth transmitter of a Microwave Landing System (MLS) provides a fan-shaped horizontal approach zone which is usually:",
    "feedback": "+ or - 40° of the runway centre-line"
  },
  {
    "question": "Which of the following geometric satellite constellations provides the most accurate NAVSTAR/GPS position fix?",
    "feedback": "3 satellites with a low elevation above the horizon and an azimuth of 120° from each other together with a fourth directly overhead"
  },
  {
    "question": "When operating in an RNAV mode using multiple DME, inaccuracy can be due to:",
    "feedback": "inability to confirm the aircraft is within the DOC of the DMEs because of identification problems"
  },
  {
    "question": "The maximum range an aircraft at FL270 can receive transmissions from a VOR/DME at 800 ft is:",
    "feedback": "240 NM"
  },
  {
    "question": "The GPS system uses L1 and L2 frequency bands. Which band is used for the P code and which for the C/A code?",
    "feedback": "L1 is modulated with the P and C/A code"
  },
  {
    "question": "\"X\" in RNAV X or RNP X is the (1).... navigation accuracy (total system error) in (2)...., which is expected to be achieved at least (3).... of the flight time by the population of aircraft operating within the airspace, route or procedure.",
    "feedback": "(1) lateral; (2) NM; (3) 95%"
  },
  {
    "question": "Which statement is correct according to ICAO DOC 8168?",
    "feedback": "The aircraft has to be established within half scale deflection of the LLZ before staring descent on the GP"
  },
  {
    "question": "How does a VOR/DME Area Navigation system selects the DME stations to be used for positioning?",
    "feedback": "The VOR/DME Area Navigation system has its own NAV tuner and the system itself tunes the DME stations providing the most accurate position"
  },
  {
    "question": "A relative bearing indicator shows 030°. The heading of the aircraft is 090°(M). The intercept angle for a course to the NDB of 180°(M) is:",
    "feedback": "060°"
  },
  {
    "question": "The type of modulation used for the ILS frequency carrier is:",
    "feedback": "amplitude modulation"
  },
  {
    "question": "The maximum theoretical range at which an aircraft at FL340 may receive signals from a VOR facility sited at mean sea level is:",
    "feedback": "227 NM"
  },
  {
    "question": "How does a receiver of the  NAVSTAR/GPS satellite navigation system determine the elevation and azimuth data of a satellite relative to the location of the antenna?",
    "feedback": "It calculates it by using Almanac data transmitted by the satellites"
  },
  {
    "question": "The allocation of the 24-bit aircraft address used for Mode S transponder operation, as described in ICAO Annex 10, states that:",
    "feedback": "every aircraft will have been allocated with an ICAO Aircraft Address which is hard coded into the airframe"
  },
  {
    "question": "Which are the functions of GBAS during an approach to an airfield?",
    "feedback": "Correction of on-board GPS position, allowing precision approaches"
  },
  {
    "question": "What is the function of a FM immune filter?",
    "feedback": "To make the ILS localizer receiver less susceptible to interference from commerical FM stations (radio and television)"
  },
  {
    "question": "An aircraft is equipped with a DME receiver that can provide a ground speed readout. It is climbing on a heading of 270°(T) and is crossing the 330 radial from a VORDME station. The ground speed calculated by the DME computer is ....",
    "feedback": "less than the actual ground speed because the change in slant range is smaller than the change in ground distance"
  },
  {
    "question": "If VOR bearing information is used beyond the published protection range, errors could be caused by:",
    "feedback": "interference from other transmitters"
  },
  {
    "question": "You are on an RNP APCH to an airfield, using SBAS. What are the lowest minima that can be used?",
    "feedback": "LPV minima"
  },
  {
    "question": "VLF radio waves travel:",
    "feedback": "during day and night as ground waves"
  },
  {
    "question": "What is \"Flight Technical Error (FTE)\", in the context of PBN?",
    "feedback": "It is part of the total system error, which relates to the air crew or autopilot's ability to follow the defined path or track, including any display error"
  },
  {
    "question": "If the (angular) displacement of an aircraft (with respect to the localizer centre line) doubles (e.g. from 1° to 2°) the measured Difference in Depth of Modulation:",
    "feedback": "doubles"
  },
  {
    "question": "PBN path terminator \"FA\" means",
    "feedback": "Fix to Altitude"
  },
  {
    "question": "In relation to primary radar, what does the term Pulse Recurrence Frequency signify?",
    "feedback": "The number of pulses transmitted per second"
  },
  {
    "question": "In which of the following cases would ETOs and ETA at destination calculated by the Flight Management Computer (FMC) be correct?",
    "feedback": "When the actual winds match the forecast winds, and the actual cruising Mach number is equal to the FMC calculated Mach number"
  },
  {
    "question": "Which one of the following is an advantage of a Microwave Landing System (MLS) compared with an Instrument Landing System (ILS)?",
    "feedback": "It is insensitive to geographical site and can be installed at sites where it is not possible to use an ILS"
  },
  {
    "question": "What is the operational purpose for changing the tilt of an Airborne Weather Radar system (without auto tilt) to a higher setting when descending over terrain?",
    "feedback": "If the beam's tilt remains at the setting used during cruise, the scanning range will be reduced and significant ground clutter may be displayed"
  },
  {
    "question": "A VOR is sited at position 58°00'N 073°00'W where the magnetic variation equals 32°W. An aircraft is located at position 56°00'N 073°00'W where the magnetic variation equals 28°W. The aircraft is on VOR radial:",
    "feedback": "212"
  },
  {
    "question": "When the airborne weather radar is operating in it's primary mode, to detect precipitation,",
    "feedback": "The radar beam is pencil-shaped"
  },
  {
    "question": "An aircraft is on the 065 radial with a heading of 090°M. The Course Reference Selector (CRS) is set on 240.\n\nWhich HSI shows the correct indications?",
    "feedback": "B"
  },
  {
    "question": "Which of the following lists phenomena that CANNOT be detected by weather radar?",
    "feedback": "snow; clear air turbulence"
  },
  {
    "question": "What causes coastal refraction?",
    "feedback": "The difference in speed of the EM wave over land and over sea"
  },
  {
    "question": "A mode S transponder receives among other pulses a long P4 pulse from an interrogator.\n\nWhat does this mean?",
    "feedback": "The interrogator transmits a Mode A/C/S all call"
  },
  {
    "question": "Complete the following statement. Airport Surface movement Radar operates on frequencies in the (i) .......... band employing an antenna that rotates at approximately (ii) .......... revolutions per minute; it is (iii) ......... possible to determine the type of aircraft from the return on the radar screen.",
    "feedback": "(i) SHF     (ii) 60      (iii) sometimes"
  },
  {
    "question": "The localiser transmitters operate in a frequency band between:",
    "feedback": "108 MHz and 111.975 MHz"
  },
  {
    "question": "An aircraft is flying at FL 240. The DME reading, uncorrected for altitude, is 8 NM. What is the ground distance to the beacon?",
    "feedback": "7.0 NM"
  },
  {
    "question": "How does 'Selective Availability' (SA), if at all, affect the navigation accuracy of the NAVSTAR/GPS satellite navigation system?",
    "feedback": "It degrades position accuracy by manipulating satellite signals"
  },
  {
    "question": "A reason that GPS satellites use helical antennae is:",
    "feedback": "that the signal has a circular polarization"
  },
  {
    "question": "The VOR monitor will remove the identification or switch off the VOR transmitter if there is a change of measured bearing greater than:",
    "feedback": "1°"
  },
  {
    "question": "With SSR, interrogation and response signals:",
    "feedback": "are standard frequencies separated by 60 MHz"
  },
  {
    "question": "One of the tasks of the space segment of the satellite navigation system NAVSTAR/GPS is to:",
    "feedback": "transmit signals which can be used, by suitable receivers, to determine time, position and velocity"
  },
  {
    "question": "Given : \nCompass heading 270°\nDeviation 2°W\nVariation 30°E \nRelative bearing 316° \nWhat is the QDR?",
    "feedback": "044°"
  },
  {
    "question": "Refer to the figure. What is the text \"RNP 1.00\" and \"ANP 1.36\" indicating?",
    "feedback": "The text is amber because the navigation performance is out of limits"
  },
  {
    "question": "A modern Airborne Weather Radar (AWR) uses a flat plate antenna with a ....",
    "feedback": "pencil or conical beam with the tilt set downward for ground mapping"
  },
  {
    "question": "Which of the following might be caused by antenna shadowing?",
    "feedback": "Poor radio reception of a VOR ident signal while the aircraft is making an orbit (360° medium-level turn)"
  },
  {
    "question": "When using airborne weather radar in the mapping mode in polar areas one runs the risk",
    "feedback": "of mistaking the edge of coastal ice off shore for the real coastline"
  },
  {
    "question": "The number included in the RNP specification (e.g. RNP-5) describes the required:",
    "feedback": "Lateral and longitudinal accuracy in NM (at 95 % of flight time)"
  },
  {
    "question": "In a conventional VOR the direction of rotation of the signal will be ... (i) and the variable signal is ... (ii). In a Doppler VOR the reference signal is ... (iii) and the direction of rotation will be ... (iv):",
    "feedback": "(i) clockwise, (ii) AM, (iii) AM, (iv) anticlockwise"
  },
  {
    "question": "ICAO specifications are that range errors indicated by Distance Measuring Equipment (DME) should not exceed:",
    "feedback": "+ or - 0.25 NM plus 1.25% of the distance measured"
  },
  {
    "question": "An error during PBN operations in the accuracy of determining actual aircraft coordinates is a:",
    "feedback": "Navigation System Error (NSE)"
  },
  {
    "question": "Which modulation signals can be found on a VOR frequency?",
    "feedback": "Navigation, voice (ATIS), and identification"
  },
  {
    "question": "An example of amplitude modulation is depicted in figure:",
    "feedback": "A"
  },
  {
    "question": "A Ground Based Augmentation System (GBAS) supports all phases of approach, landing, departure and surface operations within an aera of coverage of approximately:",
    "feedback": "30 km"
  },
  {
    "question": "The main factor which determines the minimum range that can be measured by a pulsed radar is pulse:",
    "feedback": "length"
  },
  {
    "question": "An aircraft is flying on the 050 radial with a MH of 250°. On the CDI the CRS is set to 060. Which CDI shows the correct indications?",
    "feedback": "Figure C"
  },
  {
    "question": "Which of the following statements about the 'visibility' of NAVSTAR/GPS satellites is correct?",
    "feedback": "It varies, depending on the time and observer's location"
  },
  {
    "question": "The ADF indication in the cockpit is a:",
    "feedback": "relative bearing on a fixed card indicator"
  },
  {
    "question": "In an ILS system, the identification",
    "feedback": "Is transmitted in morse by the localizer transmitter with a tone of 1020 Hz"
  },
  {
    "question": "The distances from two DMEs are plotted directly on a map. They are ....",
    "feedback": "two range circles intersecting at two points and show slant ranges"
  },
  {
    "question": "The VOR system is limited to about 1° of accuracy. One degree at 200 NM represents a width of:",
    "feedback": "3.5 NM"
  },
  {
    "question": "Two aircraft are located on the same radial but at (arbitrary) different distances from a VOR station. Which statement is true?",
    "feedback": "At a certain moment of time, both the phase of the reference signals and of the variable signals are unequal for both aircraft"
  },
  {
    "question": "What wind velocity is indicated?",
    "feedback": "105°(M)/20KT"
  },
  {
    "question": "How is the radio position determined by the FMC in the B737-400 Electronic Flight Instrument System?",
    "feedback": "DME/DME"
  },
  {
    "question": "A GPS receiver is able to calculate the aircraft's ground speed by measuring:",
    "feedback": "the Doppler (frequency) shift of the satellite carrier frequency"
  },
  {
    "question": "In the case of an Airborne-Based Augmentation System (ABAS), which method of integrity monitoring uses information from GNSS and from additional on-board sensors such as Inertial Reference Systems (IRS)?",
    "feedback": "Aircraft Autonomous Integrity Monitoring (AAIM)"
  },
  {
    "question": "When two waypoints are entered on the FMS flight plan page, a track between the two fixes is computed and can be displayed on the Navigation map display (ND). This leg created is:",
    "feedback": "a great circle arc."
  },
  {
    "question": "If you compare SBAS and GBAS, what is an advantage of SBAS over GBAS?",
    "feedback": "SBAS covers a larger area"
  },
  {
    "question": "In accordance with the ITU (International Telecommunication Union) a radio signal may be classified by three symbols. The third symbol indicates (e.g. A1A):",
    "feedback": "Nature of the information to be transmitted"
  },
  {
    "question": "The major source of cross-track error in a doppler navigation system is:",
    "feedback": "compass error"
  },
  {
    "question": "Which of the following statements is true about RNP/RNAV navigation specifications?",
    "feedback": "Aircraft approved to the more stringent accuracy requirements may not necessarily meet some of the functional requirements of navigation specification that having a less stringent accuracy requirement"
  },
  {
    "question": "In which frequency band do VOR transmitters operate?",
    "feedback": "VHF"
  },
  {
    "question": "What is the deviation per dot on the HSI when using a 2-dot basic RNAV system in the en-route mode?",
    "feedback": "2 NM"
  },
  {
    "question": "The superposition of two EM waves of the same or nearly the same frequency is called:",
    "feedback": "interference"
  },
  {
    "question": "EHF (extremely high frequency) waves appear in the frequency spectrum:",
    "feedback": "30 GHz - 300 GHz"
  },
  {
    "question": "Which statement about VHF/UHF propagation in connection with Ground Direction Finders is correct?",
    "feedback": "For both VHF/UHF propagation, the space wave is the only propagation path of practical use. There is no sky wave under normal conditions"
  },
  {
    "question": "The Doppler Navigation System is based on:",
    "feedback": "radar principles using frequency shift"
  },
  {
    "question": "In which frequency bands are the L1 and L2 frequencies used by the satellite navigation system NAVSTAR/GPS for transmission of the navigation message?",
    "feedback": "UHF"
  },
  {
    "question": "An aircraft heading 315°(M) shows an NDB bearing of 180° on the RMI. Any quadrantal error affecting the accuracy of this bearing is likely to be:",
    "feedback": "at a maximum."
  },
  {
    "question": "In relation to PBN operational approvals in accordance with the European Regulations on Air Operations, which of the following statements is correct?",
    "feedback": "Only certain PBN specifications require an operational approval"
  },
  {
    "question": "Which statement is correct about the SBAS (Satellite Based Augmentation Systems)?",
    "feedback": "In an SBAS the pseudo range corrections are sent to the users by geostationary satellites"
  },
  {
    "question": "What inclination do the orbits of the NAVSTAR/GPS have?",
    "feedback": "55° inclination"
  },
  {
    "question": "What is the minimum number of satellites required for a global coverage of the NAVSTAR/GPS?",
    "feedback": "24 satellites"
  },
  {
    "question": "Which statement about Satellite Based Augmentation Systems (SBAS) is correct?",
    "feedback": "In an SBAS the pseudo-range corrections are sent to the users by geostationary satellites"
  },
  {
    "question": "The back beam of a Localizer antenna:",
    "feedback": "May be used as a published non-precision approach"
  },
  {
    "question": "Given:\n\nOBS for a VOR is selected to 090°\nFrom/To indicator indicates \"TO\"\nCDI needle is deflected halfway to the right\n\nOn what radial is the aircraft?",
    "feedback": "275°"
  },
  {
    "question": "The ILS marker with an aural frequency of 1300 Hz is the:",
    "feedback": "middle marker"
  },
  {
    "question": "An aircraft at FL100 should be able to receive a VOR ground station located at 100 ft AMSL at an approximate maximum range of:",
    "feedback": "137 NM"
  },
  {
    "question": "Regarding the NAVSTAR/GPS which of the following is correct ?\n1) It takes 7 minutes for a GPS receiver to receive all the data frames in the navigation message\n2) The almanac contains only the orbital data of the specific satellite\n3) The clock correction parameters are data for correction of the satellite clock\n4) All of the above",
    "feedback": "3"
  },
  {
    "question": "What causes the so-called night effect?",
    "feedback": "A change in the direction of the plane of polarisation due to reflection in the ionosphere"
  },
  {
    "question": "A flight is planned to Longyearbyen Airport in Svalbard (78°15'N). Due to the high latitude the aircraft GPS will not be able to achieve RAIM during the arrival phase, with too few satellites in view. If the aircraft is suitably equipped, which of the following could be used for integrity monitoring?\n(AAIM means Aircraft Autonomous Integrity Monitoring)",
    "feedback": "AAIM using the IRS and barometric altimeter"
  },
  {
    "question": "Moving Target Indicator (MTI) in ground radar is used to:",
    "feedback": "suppress all stationary echoes"
  },
  {
    "question": "Which of the figures depicts an Electronic Flight Instrument System (EFIS) display in Expanded (EXP) VOR/ILS mode with a VOR frequency selected?",
    "feedback": "Figure 2"
  },
  {
    "question": "What type of modulation is shown in the figure?",
    "feedback": "Frequency modulation"
  },
  {
    "question": "In which mode of operation does the aircraft weather radar use a cosecant radiation pattern.",
    "feedback": "MAPPING"
  },
  {
    "question": "Under CS-25 colour code rules for Electronic Flight Instrument Systems (EFIS), selected data and values are coloured:",
    "feedback": "green"
  },
  {
    "question": "What is the slant range error for an aircraft flying at 9000 feet absolute altitude above a DME located at elevation 2000 ft, when the slant range is 12 NM?",
    "feedback": "0,055 NM"
  },
  {
    "question": "When considering RNAV and RNP system functions what is an 'offset flight path'?",
    "feedback": "A lateral offset from a defined route, which is specified in increments of 1 NM up to 20 NM"
  },
  {
    "question": "Flying a 3° glidepath ILS approach, at a ground speed of 100 Kt., the \"rule of thumb\" gives a required rate of descent of",
    "feedback": "500 ft/min"
  },
  {
    "question": "A Precision RNAV (P-RNAV) system requires:",
    "feedback": "RNP1"
  },
  {
    "question": "Which of the following are some of the required navigation functionalities of RNAV and RNP specifications?\n1) continuous indication of lateral deviation2) Continuous indication of vertical deviation3) distance and bearing to active waypoint4) ground speed or time to active waypoint5) navigation data storage6) navigation data modification",
    "feedback": "1, 3, 4, 5"
  },
  {
    "question": "What is the minimum number of satellites required for a Satellite-Assisted Navigation System (GNSS/GPS) to carry out two dimensional operation?",
    "feedback": "3"
  },
  {
    "question": "Which one of the following statements is correct concerning the use in primary radar of continuous wave transmissions as compared with pulse transmissions?",
    "feedback": "It eliminates the minimum target reception range"
  },
  {
    "question": "An aircraft is flying on the 170 radial with a MH of 315°. On the CDI the CRS is set to 180. Which CDI shows the correct indications?",
    "feedback": "Figure D"
  },
  {
    "question": "In the DME system, responses in the aircraft equipment to answers to other aircraft is \nprevented",
    "feedback": "By an irregular change in pulse-pair PRF in every aircraft installation, and by making the receiver sensitive for reception only in a short period of time of around the anticipated time of arrival of the answer from the ground station"
  },
  {
    "question": "A modern Airborne Weather Radar (AWR) with a flat plate antenna has a....",
    "feedback": "pencil or conical beam where the antenna has to be tilted downward to be used for mapping"
  },
  {
    "question": "act QDM 150°\nact HDG 330°\nreq QDM 120°\nKind of interception?",
    "feedback": "45° Interception"
  },
  {
    "question": "The frequency range of a VOR receiver is :",
    "feedback": "108 to 117.95 MHz"
  },
  {
    "question": "Aircraft equipped to operate to RNP1 and better, should be able to:",
    "feedback": "compute an estimate of its position error"
  },
  {
    "question": "A DME station is co-located with a VOR station. Which of the following statements is true?",
    "feedback": "Both stations have the same ident transmitted at different tones"
  },
  {
    "question": "PBN 3D approaches are:\n1) GNSS + VNAV2) GLS3) PAR4) RNP 15) ILS6) SBAS",
    "feedback": "1, 6"
  },
  {
    "question": "Of the types of GPS receivers available for civil aviation, which is the most advanced type?",
    "feedback": "The continuous tracking receiver"
  },
  {
    "question": "Which statement about the interrogation by the DME-interrogator is correct?",
    "feedback": "The indication does not start before pulse-pairs of the tuned DME-station are received."
  },
  {
    "question": "What should an aircraft that operates to RNP 1 or better be able to do?",
    "feedback": "Compute estimated value of aircraft position error"
  },
  {
    "question": "An Airborne Weather Radar transmits pulses of a wavelength of 3.2 cm. What is the corresponding frequency?",
    "feedback": "9.38 GHz"
  },
  {
    "question": "Which of the following options states the correct frequency band, propagation path and frequency range for an NDB?",
    "feedback": "LF and MF, surface waves, 190 - 1750 kHz"
  },
  {
    "question": "The prime factor in determining the maximum unambiguous range of a primary radar is the:",
    "feedback": "pulse recurrence rate"
  },
  {
    "question": "Concerning Performance Based Navigation (PBN) what is the name of a curved terminal or approach section defined by a fix, radius and arc length?",
    "feedback": "Radius to fix"
  },
  {
    "question": "With Mode S each aircraft can be uniquely interrogated and identified by using the:",
    "feedback": "24 bits address code, giving more than 16 million possible codes"
  },
  {
    "question": "Within which frequency band listed below are radio waves propagated as space waves?",
    "feedback": "VHF"
  },
  {
    "question": "An aircraft is on the 120° radial from a VOR station. Course 340° is selected on the HSI. If the magnetic heading is 070°, the deviation bar relative to the aeroplane model will be:",
    "feedback": "behind"
  },
  {
    "question": "A VOR and an NDB are co-located. You cross the VOR radial 240 on a heading of 360°(M). In the vicinity of the station you should read an ADF bearing of:",
    "feedback": "60°"
  },
  {
    "question": "Area Navigation is a method of navigation that permits aircraft operation on any desired flight path within the limits of the capability of self contained systems. Which of the following systems is such a self contained system?",
    "feedback": "Inertial Reference System"
  },
  {
    "question": "VDF for aeronautical use provides service in the frequency band",
    "feedback": "118 - 137 MHz"
  },
  {
    "question": "The reading of the RMI bearing is 300° at the tip of the needle. The magnetic variation at the DR position is 24°W, the magnetic variation at the NDB is 22°W and the deviation is -2°. The compass heading is 020°. The true bearing is:",
    "feedback": "274°"
  },
  {
    "question": "From the selection below, choose a PBN procedure which is classified as a non-precision approach (NPA):",
    "feedback": "RNP APCH to LNAV minima"
  },
  {
    "question": "The required 24 NAVSTAR/GPS operational satellites are located on:",
    "feedback": "6 orbital planes with 4 satellites in each plane"
  },
  {
    "question": "What are the modulation frequencies of the two overlapping lobes that are used on an ILS approach?",
    "feedback": "90 Hz   150 Hz"
  },
  {
    "question": "The calculated output data from a 4D RNAV system are:\n1) Distance to any waypoint\n2) The wind vector\n3) TAS and altitude\n4) Radial to a VOR station\n\nThe combination that regroups all of the correct statements is:",
    "feedback": "1, 2"
  },
  {
    "question": "Concerning the NAVSTAR/GPS satellite navigation system, what is the meaning of the term 'Receiver Autonomous Integrity Monitoring' (RAIM)?",
    "feedback": "It is a technique by which a receiver ensures the integrity of the navigation information"
  },
  {
    "question": "When a maximum range and altitude is published for a VOR",
    "feedback": "The reception from this VOR is guaranteed free from harmful interference from other\nVORs when you are within this airspace"
  },
  {
    "question": "An aircraft is flying on the 245 radial with a MH of 250°. On the CDI the CRS is set to 060. Which CDI shows the correct indications?",
    "feedback": "Figure D"
  },
  {
    "question": "A Category 1 Instrument Landing System (ILS) ground installation provides accurate guidance from coverage limit down to:",
    "feedback": "200 feet above the runway threshold"
  },
  {
    "question": "An aircraft has a Magnetic Heading of 290° and is on VOR radial 280. Which value has to be selected on the OBS to get a TO indication and the CDI centered?",
    "feedback": "100"
  },
  {
    "question": "Which one is the most correct statement regarding the range of the DME system?",
    "feedback": "Range within line of sight, and maximum 200 NM"
  },
  {
    "question": "When and from which station is an SPI (Special Position Identification) pulse sent?",
    "feedback": "From the aircraft transponder, when the pilot pushes the IDENT button"
  },
  {
    "question": "The wave length of a radio signal transmitted at a frequency of 118.7 MHz is:",
    "feedback": "2.53 m"
  },
  {
    "question": "Plotting positions in charts by Dead Reckoning (DR) may be required ......",
    "feedback": "during a flight with limited equipment and few navigational aids"
  },
  {
    "question": "ICAO Annex 11 defines Area Navigation (RNAV) as a method of navigation which permits aircraft operation on any desired flight path:",
    "feedback": "within the coverage of station-referenced navigation aids or within the limits of the capability of self-contained aids, or a combination of these"
  },
  {
    "question": "A pilot is flying between two waypoints defined by suitably located VOR/DMEs. Equipped with a simple 2D RNAV system, this pilot:",
    "feedback": "reads cross track error and the distance to go on CDI or HSI."
  },
  {
    "question": "The MLS use a technique based on",
    "feedback": "\"Time Reference Scanning Beam\""
  },
  {
    "question": "In which frequency band do most airborne weather, and ground based ATC, radar systems operate?",
    "feedback": "SHF"
  },
  {
    "question": "The Performance Based Navigation (PBN) concept expresses performance requirements using specific terms. The term that defines the capability of the system to perform its function without unscheduled interruptions during the intended operation is ....",
    "feedback": "Continuity"
  },
  {
    "question": "Which type of radar gives an indication of the shape and, to some extent, the type of aircraft producing a return?",
    "feedback": "Aerodrome Surface Movement Radar (ASMR)"
  },
  {
    "question": "The correction for an aircraft GNSS receiver in EGNOS and WAAS systems are broadcasted:",
    "feedback": "via a geostationary satellite."
  },
  {
    "question": "The antennae of modern airborne weather radars are stabilized by means of:",
    "feedback": "inputs from the aircraft's attitude system"
  },
  {
    "question": "According to the definition from Annex I to Part-FCL regarding linear and angular laterally guided operations during approach phase of flight, which of the following statements is true?",
    "feedback": "Linear guidance means instrument approach operation in which the maximum tolerable error/deviation from the planned track is expressed in units of length, for instance nautical miles, for cross-track lateral deviation"
  },
  {
    "question": "The function of a locator beacon in an ILS procedure",
    "feedback": "Is to provide a navigation aid that will clearly indicate that the aircraft is within the\ncoverage of the ILS localizer and glide path"
  },
  {
    "question": "Signal reception is required from a minimum number of satellites that have adequate elevation and suitable geometry in order for a Satellite-Assisted Navigation System (GNSS/GPS) to carry out independent three dimensional operation, Receiver Autonomous Integrity Monitoring (RAIM) and to isolate any faulty satellite and remove it from contributing to the navigation solution. The number of satellites is:",
    "feedback": "6"
  },
  {
    "question": "What is the main differences between a ground based and a satellite based augmentation system?",
    "feedback": "A satellite based augmentation system uses one or more geostationary satellites to broadcast correction information"
  },
  {
    "question": "An  RMI slaved to a remote indicating compass has gone unserviceable and is locked on to a reading of 090°. The tail of the VOR pointer shows 135°. The available information from the VOR is:",
    "feedback": "Radial 135°, relative bearing  unknown"
  },
  {
    "question": "The ILS receiver of an aircraft on approach and flying on the glidepath will receive:",
    "feedback": "the modulation from both lobes at equal depth"
  },
  {
    "question": "You are flying in IMC at night above 73° north latitude. Because of the high latitude and the GNSS satellite positions, you elect to fly an RNP APCH to LNAV/VNAV minima, based on barometric VNAV with GNSS horizontal guidance. The minimum published temperature for the approach is -8°C, you do not have automatic temperature compensation fitted. The temperature given by the most recent ATIS is -6°C. During final approach, ATC advises you to perform an immediate go around, because terrain separation is not guaranteed anymore.\nWhat is the likely reason for losing minimum terrain separation?",
    "feedback": "The temperature has fallen below -8°C, invalidating the indicated altitudes with the present altimeter subscale setting"
  },
  {
    "question": "What does PBN accommodate in the approach phases of flight?",
    "feedback": "Both linear and angular laterally guided operations"
  },
  {
    "question": "An electromagnetic wave consists of an oscillating electric (E) and an oscillating magnetic (H) field. Which of the following answers is true?",
    "feedback": "The (E) field and the (H) field are perpendicular to each other"
  },
  {
    "question": "Which of the following describes antenna shadowing?",
    "feedback": "Reduced reception by an antenna when part of the airframe blocks the signal to the antenna"
  },
  {
    "question": "A young adult interested in studying to become a pilot is invited into the cockpit. He/she is interested in the weather radar and asks the pilot why there is a tilt knob on the control unit. The pilot replies that this controls the up- and downwards tilt of the antenna, as required for the two main tasks of the radar, which are ....",
    "feedback": "detecting significant weather and ground mapping"
  },
  {
    "question": "Erratic indications may be experienced when flying towards a basic VOR/DME-based Area Navigation System 'Phantom Station':",
    "feedback": "when operating at low altitudes close to the limit of reception range from the reference station"
  },
  {
    "question": "Which statement is correct for tracking towards an NDB in an area with constant wind and constant magnetic variation?",
    "feedback": "The Relative Bearing of the NDB should be equal (in magnitude and sign) to the experienced Drift Angle."
  },
  {
    "question": "Which one of the following is an advantage of a multi-sensor system using inputs from a global navigation satellite system (GNSS) and an inertial navigational system (INS)?",
    "feedback": "The GNSS can be used to update a drifting INS"
  },
  {
    "question": "Receiver Autonomous Integrity Monitoring (RAIM) is a method used to ensure GNSS position integrity within a GNSS receiver. This is achieved by using the 3D position and timing data from ....",
    "feedback": "any number of visible satellites beyond 4 to create several independent positions which should agree"
  },
  {
    "question": "NAVSTAR GPS receiver clock error is removed by:",
    "feedback": "adjusting the pseudo ranges to determine the error"
  },
  {
    "question": "PBN path terminator \"CF\" means",
    "feedback": "Course to Fix"
  },
  {
    "question": "A 2-dimensional RNAV system has capability in the:",
    "feedback": "horizontal plane"
  },
  {
    "question": "For what purpose does an aircraft's RNAV computer receive a TAS input and a heading input?",
    "feedback": "To calculate the actual wind velocity"
  },
  {
    "question": "The navigation accuracy for civil users of the NAVSTAR/GPS satellite navigation system was formerly influenced by:",
    "feedback": "the 'Selective Availability' (SA) function"
  },
  {
    "question": "The ILS marker with an aural frequency of 400 Hz is the:",
    "feedback": "outer marker"
  },
  {
    "question": "Which of the following types of radar equipment operate by means of the pulse technique?\n1) Aerodrome Surface Movement Radar (ASMR)2) Airborne Weather Radar (AWR)3) Secondary Surveillance Radar (SSR)4) Aerodrome Surveillance (approach) Radar",
    "feedback": "1, 2, 3, 4"
  },
  {
    "question": "Flying an ILS approach, the middle marker is positioned so as to be passed",
    "feedback": "At about 200 ft AAL"
  },
  {
    "question": "Instrument Landing Systems (ILS) Glide Paths provide azimuth coverage (i) ..........° each side of the localiser centre-line to a distance of (ii) .......... NM from the threshold.",
    "feedback": "(i) 8          (ii) 10"
  },
  {
    "question": "When the warning flag on a VOR indicator appears, it may indicate",
    "feedback": "All 3 answers are correct"
  },
  {
    "question": "The OBS is set on 048°, \"TO\" appears in the window. The needle is close to full right deflection. The VOR radial is approximately:",
    "feedback": "238°"
  },
  {
    "question": "An RNP APCH to LNAV/VNAV minima based on Baro-VNAV can only be conducted when the aircraft is within a promulgated temperature range. What is the reason for this?",
    "feedback": "The assessment of the vertical position of the aircraft, in relation to the glide path angle (GPA) during the approach is based on barometric data"
  },
  {
    "question": "Which statement from the choices below characterises a Satellite Based Augmentation System (SBAS)?",
    "feedback": "SBAS is able to provide approach and landing operations with vertical guidance"
  },
  {
    "question": "In an MLS the azimuth information is available in the approach sector",
    "feedback": "To a distance of 20 NM in an 80 degree wide sector"
  },
  {
    "question": "When raising the frequency of an electromagnetic wave, the:",
    "feedback": "wavelength decreases"
  },
  {
    "question": "Which of the following frequencies are used by ILS?",
    "feedback": "a and b above"
  },
  {
    "question": "Which statement is correct with respect to the range of an NDB?",
    "feedback": "With propagation over sea the range will be greater than the range with propagation over land."
  },
  {
    "question": "An aircraft is on a VOR radial of 235°, heading 003° M, and with the OBS set to 060. The correct indications are:",
    "feedback": "TO, 1/2 scale deflection to the left"
  },
  {
    "question": "Which one of the following Secondary Surveillance Radar (SSR) codes should be used by aircraft entering airspace from an area where SSR operation has not been required?",
    "feedback": "2000"
  },
  {
    "question": "Which of the figures depicts an Electronic Flight Instrument System (EFIS) display in MAP mode?",
    "feedback": "Figure 1"
  },
  {
    "question": "Your aircraft is approved for RNP APCH (LNAV). Therefore, it will automatically also be approved for RNP 2 operations as they require a lower level of accuracy to RNP APCH (LNAV).\nIs this statement correct?",
    "feedback": "No, as the aircraft may fail to meet all the functional requirements for RNP 2. A separate approval for RNP 2 is necessary"
  },
  {
    "question": "Benefits of RNAV include:  1) Shorter flight distance  2) Reduction in fuel and flight time  3) No radio contact within RNAV airspace 4) Reduction in the number of ground facilities  5) Pilot choice of vertical and horizontal separations  The combination regrouping all the correct statements is:",
    "feedback": "1, 2 and 4."
  },
  {
    "question": "Which component of typical EFIS generates the visual displays on the EADI and EHSI?",
    "feedback": "Symbol Generator"
  },
  {
    "question": "The range of a locator beacon is much shorter than that of an NDB because:",
    "feedback": "locator beacons have a lower power output"
  },
  {
    "question": "In the propagation of MF waves, the phenomenon of FADING is particularly found :",
    "feedback": "at night, due to the combination of the sky and ground waves."
  },
  {
    "question": "The pilot of a light aircraft is plotting the position of the aircraft using a VOR bearing and an NDB bearing. Both bearings are displayed on an RMI with two pointers. What is the true bearing to plot from the NDB, given the following information?\nDeviation: 2°EVariation: 5°E",
    "feedback": "199*"
  },
  {
    "question": "When a Mode C check is carried out, and assuming the equipment is working without error, the Mode C will report a pressure altitude of 35064 ft as:",
    "feedback": "FL351"
  },
  {
    "question": "Which of the following NAVSTAR/GPS satellite navigation system codes can be processed by 'unauthorised' civil aviation receivers?",
    "feedback": "C/A"
  },
  {
    "question": "In which frequency band does the Microwave Landing System (MLS) operate?",
    "feedback": "SHF"
  },
  {
    "question": "Given:\n\nW/V (T) 230/20 kt\nVar. 6E\nTAS 80 kt\n\nWhat relative bearing from an NDB should be maintained in order to achieve an outbound course of 257°(M) from overhead the beacon?",
    "feedback": "188°"
  },
  {
    "question": "The rate of descent required to maintain a 3.25° glide slope at a groundspeed of 140 kt is approximately:",
    "feedback": "800 FT/MIN"
  },
  {
    "question": "Explain the principle of SBAS:",
    "feedback": "Measure on the ground the signal errors transmitted by GNSS satellites and transmit differential corrections and integrity messages for navigation satellites"
  },
  {
    "question": "A pilot departs an aerodrome on the West coast of Spain at dawn for a flight to New York. Half an hour after departure, the VHF station for communication can no longer be received. What are two of the main reasons that VHF radio range is limited to line of sight?",
    "feedback": "No reflection by the ionosphere, and no surface waves"
  },
  {
    "question": "A typical consequence of the Shoreline/Coastal Effect is:",
    "feedback": "refraction of the radio waves"
  },
  {
    "question": "DME channels utilise frequencies of approximately:",
    "feedback": "1000 MHz"
  },
  {
    "question": "Which of the following is one of the functions of the Computer in a basic RNAV system?",
    "feedback": "It transfers the information given by a VOR/DME station into tracking and distance indications to any chosen Phantom Station/waypoint"
  },
  {
    "question": "In order to establish what radial you are on, you could",
    "feedback": "Rotate the OBS until the CDI gets centred and the TO/FROM indicator is showing\nFROM. Then read the radial on the OBS"
  },
  {
    "question": "Fading (MF and LF) can happen:",
    "feedback": "from the beginning of evening twilight until the end of morning twilight"
  },
  {
    "question": "Which factor makes the difference between a 3D RNAV system and a 4D RNAV system?",
    "feedback": "Time"
  },
  {
    "question": "A weather radar, set to the 100 NM scale, shows a squall at 50NM. By changing the scale to 50 NM, the return on the radar screen should:",
    "feedback": "increase in area and move to the top of the screen"
  },
  {
    "question": "If, during an ILS approach, after having been established, the pilot deviates by more than half scale deflection on the Localizer:",
    "feedback": "an immediate missed approach should be executed because obstacle clearance may no long be guaranteed"
  },
  {
    "question": "What is true about FMC databases?",
    "feedback": "the data includes SID, STARs and runway approaches"
  },
  {
    "question": "A Course Deviation Indicator (CDI) shows full deflection to the left when within range of a serviceable VOR. What is the angular deviation from the selected radial?",
    "feedback": "10° or more"
  },
  {
    "question": "An aircraft is flying an approach to runway 19. As the pilot is approaching 1800 ft, what cockpit light and audion indications are to be expected?",
    "feedback": "A blue light with continuous low frequency dashes"
  },
  {
    "question": "Which of the following is an advantage of Ground/DF (VDF) let-down?",
    "feedback": "It only requires a VHF radio to be fitted to the aircraft"
  },
  {
    "question": "Refer to the diagram # 5. Assume that the indicator is set to define the centreline of an airway, that the aircraft is 90 NM from the VOR and inbound to the facility. At the time of observation the aircraft was located on radial",
    "feedback": "063°"
  },
  {
    "question": "Which of the figures correctly depicts the standard coverage area of an ILS glide path?",
    "feedback": "Figure 1"
  },
  {
    "question": "A primary pulse radar system operates with a pulse repetition frequency of 400 pps. The maximum theoretical range of the system is:",
    "feedback": "202 NM"
  },
  {
    "question": "What is the frequency of a radio wave with a wavelength of 3 km?",
    "feedback": "100 kHz"
  },
  {
    "question": "The antenna polar diagram of a conventional VOR",
    "feedback": "Rotates at 30 revolutions per second"
  },
  {
    "question": "Changing the gain on control switch number 1 will change the:",
    "feedback": "Sensitivity of the receiver"
  },
  {
    "question": "Minimum Ground-Based Augmentation System (GBAS) plan coverage is:",
    "feedback": "15 NM from the landing threshold within 35° apart the final approach path and 10° apart between 15 and 20 NM"
  },
  {
    "question": "How many orbits does the fully operational GLONASS consist of?",
    "feedback": "3 orbits"
  },
  {
    "question": "Garbling is caused by:",
    "feedback": "aeroplanes in close proximity responding to the same interrogation"
  },
  {
    "question": "When preparing to commence an RNP AR APCH procedure the flight crew checks the routing including the waypoint sequence and notice that one waypoint is missing. Which is the correct action to take?",
    "feedback": "continue using conventional navigation aids, when available"
  },
  {
    "question": "Abnormal long ranges may be experienced on VDF channels, caused by",
    "feedback": "Super refraction of signals in the atmosphere"
  },
  {
    "question": "Which statement about dilution of precision (DOP) is correct?",
    "feedback": "The value of the DOP depends upon the geometry and the number of satellites in view"
  },
  {
    "question": "The wave length of a radio signal transmitted at a frequency of 75 MHz is:",
    "feedback": "4 m"
  },
  {
    "question": "Which of the figures depicts an Electronic Flight Instrument System (EFIS) display in MAP mode?",
    "feedback": "Figure 3"
  },
  {
    "question": "How may pilots retrieve an RNAV 1/RNAV 2/RNP 1/RNP2 SID or STAR for use?",
    "feedback": "By route name conforming to the charted route"
  },
  {
    "question": "An aircraft is flying RNAV 2 and another aircraft is flying RNP 2. What is the difference between them?",
    "feedback": "RNP 2 is used in the en-route and oceanic/remote phases of flight. RNAV 2 might be used in the en-route continental, arrival and departure phases of flight"
  },
  {
    "question": "OBS 123, TO/FROM showing TO, CDI is indicating 4 dots right on a 5-dot indicator.\nOn what radial is your position?",
    "feedback": "Radial 311"
  },
  {
    "question": "The ADF in the aircraft has been tuned to a nearby NDB, which has been identified. The figure shows the accompanying RBI and the Direction Indicator in the aircraft, which has been aligned with the on-board compass. Ignoring any applicable turn radius and wind effects, which statement is correct?",
    "feedback": "Turning to a heading of 030° makes the aircraft track along QDM 030°"
  },
  {
    "question": "What is cross track distance (XTK distance) in an Area Navigation System?",
    "feedback": "Distance between actual position and great circle track between active waypoints"
  },
  {
    "question": "The principle used in VOR bearing measurement is:",
    "feedback": "phase comparison"
  },
  {
    "question": "How does the SSR ground interrogation signal (Mode A and C) get transmitted to a transponder?",
    "feedback": "in form of pairs of interrogative pulses with an additional control pulse"
  },
  {
    "question": "You want to use your airborne weather radar to detect areas with turbulence.\nConsider the following statements:",
    "feedback": "If you are flying at low altitude, the detection of turbulence at levels below the aircraft may be difficult because of ground returns"
  },
  {
    "question": "An apparent increase in the transmitted frequency which is proportional to the transmitter velocity will occur when:",
    "feedback": "the transmitter moves towards the receiver"
  },
  {
    "question": "The quadrantal error of an ADF:",
    "feedback": "is caused by the refraction from the aircraft's fuselage and is compensated for"
  },
  {
    "question": "What is the function of the Echo Protection Circuit (EPC)?",
    "feedback": "The EPC has to detect if the interrogator-receiver has been locked on, by reflected pulse pairs"
  },
  {
    "question": "Which of the following statements about the scalloping (path deflection) of VOR-radials, in relation to the accuracy of navigation using a VOR/DME RNAV-system, is correct?",
    "feedback": "Scalloping has a negative effect on the accuracy of navigation."
  },
  {
    "question": "Of the bearing indicators available for use on ADFs, the most sophisticated one is",
    "feedback": "The Radio Magnetic Indicator"
  },
  {
    "question": "Under CS-25 colour code rules, features displayed in amber/yellow on an Electronic Flight Instrument System (EFIS), indicate:",
    "feedback": "cautions, abnormal sources"
  },
  {
    "question": "What is an ARINC 424 Path Terminator in reference to Performance Based Navigation?",
    "feedback": "It is a code that defines a specific type of flight path along a segment of a procedure and a specific type of termination of that flight path"
  },
  {
    "question": "act QDM 330°\nact HDG 060°\nreq QDM 350°\nIntercept HDG?",
    "feedback": "305°"
  },
  {
    "question": "The kinds of wave propagation marked as A and C in the figure are examples of:",
    "feedback": "A = refraction   C = reflection"
  },
  {
    "question": "What is the simplest type of an antenna called?",
    "feedback": "Dipole"
  },
  {
    "question": "Consider the following statements on SSR Mode S:",
    "feedback": "All 3 statements are correct"
  },
  {
    "question": "The reason why the measured distance between a NAVSTAR/GPS satellite navigation system satellite and a receiver is called a 'Pseudo-Range' is because the:",
    "feedback": "calculated range includes receiver clock error"
  },
  {
    "question": "Night effect in an ADF may cause:",
    "feedback": "fluctuating indications of the needle on the RMI"
  },
  {
    "question": "The Instrument Landing System (ILS)  uses the following wavelengths:",
    "feedback": "LOC:  metric      / GP: decimetric"
  },
  {
    "question": "The audio frequency modulation of the outer marker shall be keyed as follows:",
    "feedback": "2 dashes per second continuously"
  },
  {
    "question": "At what approximate height above the WGS-84 ellipsoid are NAVSTAR/GPS satellites circling the earth?",
    "feedback": "20200 km"
  },
  {
    "question": "A VOR and an NDB are located in the same position. Both the VOR and the ADF readings are displayed on the RMI. The aircraft is tracking away from the beacons along the 090 radial. The magnetic variation is changing rapidly. \n\nWhich of the following is correct?",
    "feedback": "The direction of the ADF pointer will change, the direction of the VOR pointer will not change"
  },
  {
    "question": "What is correct regarding NAVSTAR GPS and GLONASS? The two systems have ....",
    "feedback": "different data for navigation services but are interoperable"
  },
  {
    "question": "You are lined up on the departure runway and there are thunderstorms in the vicinity. What should you consider?",
    "feedback": "The radar should be tilted UP (switch 5) to check for any significant precipitation on the climb-out path"
  },
  {
    "question": "The 'gain' control knob of an AWR adjusts:",
    "feedback": "the receiver sensitivity in order to achieve optimum target acquisition"
  },
  {
    "question": "Reflection from ionospheric layers is used in the following radio frequencies:",
    "feedback": "HF"
  },
  {
    "question": "Consider the following statements on the NDB transmitter:",
    "feedback": "It is very simple, being required to transmit only a carrier wave and an identification"
  },
  {
    "question": "The geometric shape of the reference system for the satellite navigation system NAVSTAR/GPS, defined as WGS 84, is:",
    "feedback": "an ellipsoid"
  },
  {
    "question": "In which frequency band do Satellite-Assisted Navigation systems (GNSS/GPS) provide position information that is available to civil aircraft?",
    "feedback": "UHF"
  },
  {
    "question": "In the PBN concept, which type of element is \"RNAV 5\"?",
    "feedback": "Navigation specification"
  },
  {
    "question": "A lateral offset flight path in RNAV/RNP ......",
    "feedback": "is possible in increments of 1 NM up to 20 NM"
  },
  {
    "question": "The picture below are showing an aircraft's position with respect to some thunderstorm cells and the image the pilot is getting from the radar. To detect this \"blind alley\" the pilot should:",
    "feedback": "increase the range setting of his radar"
  },
  {
    "question": "Which of the following statements about SBAS is correct?",
    "feedback": "SBAS satellites are geostationary satellites which can also be used as navigation satellites with their own PRN code"
  },
  {
    "question": "Which statement about the satellites (that transmit the corrections to the users) of a Satellite Based Augmentation System (SBAS) is correct?",
    "feedback": "These geostationary satellites can also be used as navigation satellites to which pseudo-ranges can be measured"
  },
  {
    "question": "One of the possible disturbances of the ILS signal is \"scalloping\". Which statement is correct?",
    "feedback": "Scalloping causes rapid indicator changes from side to side of the intended approach path which can not be followed by the aircraft"
  },
  {
    "question": "The BFO selector switch on the ADF control panel must be in the ON position to enable the pilot to:",
    "feedback": "hear the IDENT of NDBs using NON A1A transmissions"
  },
  {
    "question": "Assuming a five dot display on either side of the ILS localiser cockpit display, what is the angular displacement of the aircraft from the localiser centreline when the CDI is deflected 2 dots to the right?",
    "feedback": "1.0° to the left"
  },
  {
    "question": "Define Approach Procedure with Vertical Guidance (APV):",
    "feedback": "An approach procedure which utilizes lateral and vertical guidance but does not meet the requirements established for precision approaches"
  },
  {
    "question": "A primary pulse radar system operates with a pulse repetition frequency of 360 pps. The maximum theoretical range of the system is:",
    "feedback": "225 NM"
  },
  {
    "question": "Due to Doppler effect an apparent increase in the transmitted frequency will occur when:",
    "feedback": "the transmitter and receiver move towards each other"
  },
  {
    "question": "MF (Medium Frequency) waves appear in the frequency spectrum:",
    "feedback": "300 kHz - 3000 kHz"
  },
  {
    "question": "What is the orbital time of a GLONASS navigation satellite?",
    "feedback": "11h 15min"
  },
  {
    "question": "In Performance Based Navigation (PBN), with respect to navigation error components, the Total System Error (TSE) is ......",
    "feedback": "a measure of the navigation accuracy"
  },
  {
    "question": "Which of the distances indicated will be shown on a basic VOR/DME-based Area Navigation Equipment when using a 'Phantom Station'?",
    "feedback": "12 NM"
  },
  {
    "question": "The audio frequency modulation of the middle marker shall be keyed as follows:",
    "feedback": "a continuous series of alternate dots and dashes, the dashed keyed at the rate of 2 dashes per second, and the dots at the rate of 6 dots per second"
  },
  {
    "question": "A radio signal may be classified by three symbols in accordance with the ITU radio regulation e.g. A1A. Which statement is true?",
    "feedback": "The first symbol indicates the type of modulation of the main carrier"
  },
  {
    "question": "The maximum theoretical range at which an aircraft at FL80 can obtain bearings from a ground VDF facility sited 325 FT above MSL is:",
    "feedback": "134 NM"
  },
  {
    "question": "What are additional aircraft parameters that are downlinked from Mode S Enhanced Surveillance (EHS) transponders?\n1) selected altitude2) indicated airspeed3) magnetic heading4) true track angle",
    "feedback": "1, 2, 3, 4"
  },
  {
    "question": "The UHF band is assigned to the:\n\n1) Locator\n2) Localiser\n3) Outer Marker\n4) Glide path\n\nThe combination that regroups all of the correct statements is:",
    "feedback": "4"
  },
  {
    "question": "act QDM 095°\nact HDG 090°\nreq QDM 090°\nEET 5Min.\nCorrection?",
    "feedback": "15°"
  },
  {
    "question": "The stabilisation of the weather radar, aerial is effective",
    "feedback": "For up to +/- 20° of combined roll and pitch"
  },
  {
    "question": "The BFO selection will ....",
    "feedback": "make the carrier wave audible"
  },
  {
    "question": "RNP1 (Required Navigation Performance) requires a navigation performance of:",
    "feedback": "+/- 1 NM both lateral and longitudinal 95% of the flying time"
  },
  {
    "question": "The indication of the FROM/TO indicator of a VOR shifts from TO to FROM (or vice versa) when the value of the difference between the selected course and the measured radial passes in either direction:",
    "feedback": "090°"
  },
  {
    "question": "With regard to types of transmission, which of the following statements is true?",
    "feedback": "Continuous wave transmission can be either frequency or amplitude modulated"
  },
  {
    "question": "In which of the following situations is the FMC present position of a B737-400 Electronic Flight Instrument System likely to be least accurate?",
    "feedback": "At top of descent"
  },
  {
    "question": "Given:\nMagnetic heading 280°\nVOR radial 090°\nWhat bearing should be selected on the omni-bearing selector in order to centralise the VOR deviation needle with a \"TO\" indication?",
    "feedback": "270°"
  },
  {
    "question": "What kind of disturbances may occur in the area marked by the circle in the figure?",
    "feedback": "Fading and interference"
  },
  {
    "question": "Which of the following will give the most accurate calculation of aircraft ground speed?",
    "feedback": "A DME station sited on the flight route"
  },
  {
    "question": "The identification of a DME in combination with a collocated VOR is as follows:",
    "feedback": "in a period of 40 seconds the DME ident will be heard once on an audio frequency of 1350 Hz"
  },
  {
    "question": "Refer to GNSS. The Ground Based Augmentation System (GBAS) sends corrections for:",
    "feedback": "errors due to ionospheric and tropospheric delays"
  },
  {
    "question": "What is the value of the track from TBX to YTB?",
    "feedback": "097°(T)"
  },
  {
    "question": "An airborne weather radar unit transmits a 4° beam from a parabolic dish aerial reflector assembly. If the wavelength is 3 cm, what is the diameter of the dish?",
    "feedback": "52,5 cm"
  },
  {
    "question": "Which of the following statements is correct concerning the principle behind the correction of one of the NAVSTAR/GPS satellite navigation system errors by the transmission of the signals on two frequencies (L1 and L2)?",
    "feedback": "The path delay of the signals in the earth atmosphere is proportional to the inverse of the carrier frequency squared"
  },
  {
    "question": "A-RNP incorporates the navigation specifications:\n1) RNAV 12) RNAV 53) RNAV APCH4) RNP 1 / RNP 25) RNP APCH",
    "feedback": "1, 2, 4, 5"
  },
  {
    "question": "Which statement about a typical 4D RNAV system is correct?\n1) The system has \"direct to\" capability to any waypoint2) The system is capable of parallel off-set tracking",
    "feedback": "1) and 2) are correct"
  },
  {
    "question": "A radar used by ATC has the following characteristics: Long wavelength, aerial rotation speed 5 RPM. Most likely this is",
    "feedback": "An en route surveillance radar"
  },
  {
    "question": "The back CRS of an ILS may give:",
    "feedback": "non-precision approach guidance for the reciprocal of the main approach runway"
  },
  {
    "question": "In the response curve of an amplifier, the bandwidth is:",
    "feedback": "The frequency band corresponding to maximum gain less 3 decibels."
  },
  {
    "question": "To provide a pilot with the position of the aircraft in the absence of radar, ATC must have at its disposal at least:",
    "feedback": "two VDF's at different locations, able to take bearings simultaneously on the transmitted frequency"
  },
  {
    "question": "You are approaching an aerodrome on an RNP APCH to LNAV/VNAV minimums using Baro-VNAV. The approach has a minimum temperature of -8°C, while the OAT is +10*C during final approach. ATC tells you to go around immediately due to loss of terrain separation. What could have happened?",
    "feedback": "You made a mistake inputting barometric data"
  },
  {
    "question": "SBAS messages are broadcast via:",
    "feedback": "geostationary satellites"
  },
  {
    "question": "When Mode C is selected on the aircraft SSR transponder the additional information transmitted is:",
    "feedback": "flight level based on 1013.25 hPa"
  },
  {
    "question": "Given:\nVOR station position N61° E025°, variation 13°E;\nEstimated position of an aircraft N59° E025°, variation 20°E.\nWhat VOR radial is the aircraft on?",
    "feedback": "167°"
  },
  {
    "question": "On what data is a VOR/DME Area Navigation system operating in the dead reckoning mode?",
    "feedback": "TAS from the Air Data Computer; heading from the aircraft compass; the last computed W/V"
  },
  {
    "question": "An aircraft is required to approach a VOR station via the 244° radial. In order to obtain correct sense indications the deviation indicator should be set to:",
    "feedback": "064° with the TO flag showing"
  },
  {
    "question": "Which of the following radar equipments operate by means of the pulse technique?\n1) Aerodrome Surface Movement Radar\n2) Airborne Weather Radar\n3) Secondary Surveillance Radar (SSR)\n4) Aerodrome Surveillance (approach) Radar",
    "feedback": "1, 2, 3, 4"
  },
  {
    "question": "The Flight management System consists of the following major units:",
    "feedback": "The Flight management computer and the Command display unit"
  },
  {
    "question": "Which statement is correct regarding RNP/RNAV navigation specifications?",
    "feedback": "Aircraft approved to the more stringent accuracy requirements may not necessarily meet some of the functional requirements of the navigation specification that having a less stringent accuracy requirement"
  },
  {
    "question": "The airborne weather radar uses the following wavelengths:",
    "feedback": "centimetric."
  },
  {
    "question": "Two types of radar approaches may be available",
    "feedback": "Surveillance approach and Precision approach"
  },
  {
    "question": "What is required to enable an antenna to transmit an electromagnetic wave?",
    "feedback": "The antenna has to be fed with an alternating current of high frequency"
  },
  {
    "question": "Which of the following is correct regarding false beams on a glide path?",
    "feedback": "False beams will only be found above the correct glide path"
  },
  {
    "question": "Which of the figures depicts an Electronic Flight Instrument System (EFIS) display in Expanded (EXP) VOR/ILS mode with an ILS frequency selected?",
    "feedback": "Figure 1"
  },
  {
    "question": "The glide path antenna is located on the side of the runway approximately:",
    "feedback": "300 m beyond the threshold"
  },
  {
    "question": "The visibility of GPS satellites is:",
    "feedback": "dependent on the location of the user"
  },
  {
    "question": "In relation to Area Navigation Systems (RNAV), which of the following is an Air Data input?",
    "feedback": "True airspeed"
  },
  {
    "question": "Which of the following statements is correct or incorrect?\n1) A fly-by waypoint is a waypoint where the turn is initiated overhead in order to join the next segment of a route or procedure\n2) A fly-over waypoint is a waypoint that requires turn anticipation to allow tangential interception fo the next segment of a route or procedure",
    "feedback": "1) and 2) are not correct"
  },
  {
    "question": "During descent ATC informs the pilot to expect the RNP Approach (RNP APCH) for Runway 09. During approach preparation the pilot notices that one waypoint for the RNP APCH is missing in the navigation database. What are his/her options?",
    "feedback": "An RNP APCH must not be flown unless it is retrievable from the on-board navigation database and conforms to the charted procedure. Request a different approach procedure from ATC"
  },
  {
    "question": "With a GNSS Ground Based Augmentation System a correction is transmitted for, amongst others,",
    "feedback": "tropospheric and ionospheric delays"
  },
  {
    "question": "Which of the figures depicts an Electronic Flight Instrument System (EFIS) display in FULL VOR/ILS mode with an VOR frequency selected?",
    "feedback": "Figure 2"
  },
  {
    "question": "In the VDF system directional antennas are used",
    "feedback": "At the ground installation"
  },
  {
    "question": "ILS is subject to false glide paths resulting from:",
    "feedback": "multiple lobes of radiation patterns in the vertical plane"
  },
  {
    "question": "Assume that one of the satellites used by a GPS receiver is faulty. When the signals of 5 satellites are received (including the faulty one) the RAIM software in the receiver:",
    "feedback": "is able to detect that one of the satellites is faulty but is unable to identify the faulty one"
  },
  {
    "question": "Given:\nAircraft heading 160°(M),\nAircraft is on radial 240° from a VOR,\nSelected course on HSI is 250°.\nThe HSI indications are deviation bar:",
    "feedback": "behind the aeroplane symbol with the FROM flag showing"
  },
  {
    "question": "In order to provide an Air Traffic Services (ATS) surveillance service, what minimum information must be provided to the controller on the surveillance system display?\nIndication of position and also ....",
    "feedback": "any map information needed to provide the surveillance service, and (when available) the aircraft identification and level"
  },
  {
    "question": "The VHF Omnirange (VOR) uses the following wavelengths:",
    "feedback": "metric."
  },
  {
    "question": "ADF bearings by an aeroplane by day within the published protection range should be accurate to within a maximum error of:",
    "feedback": "+/-5°"
  },
  {
    "question": "What is the instantaneous aircraft track?",
    "feedback": "272°(M)"
  },
  {
    "question": "The advantage of the use of slotted antennas in modern radar technology is to:",
    "feedback": "virtually eliminate lateral lobes and as a consequence concentrate more energy in the main beam"
  },
  {
    "question": "The Performance Based Navigation (PBN) concept expresses performance requirements using specific terms. What is the term that defines the trust than can be placed in the correctness of the information supplied by the total system, and which includes the ability of a system to provide timely and valid alerts to the user?",
    "feedback": "Integrity"
  },
  {
    "question": "The receiver in a primary radar",
    "feedback": "All 3 answers are correct"
  },
  {
    "question": "What type of modulation is shown in the figure?",
    "feedback": "Amplitude modulation"
  },
  {
    "question": "Which of the figures depicts an Electronic Flight Instrument System (EFIS) display in FULL VOR/ILS mode with an ILS frequency selected?",
    "feedback": "Figure 3"
  },
  {
    "question": "An aircraft is established on an ILS approach to a runway. On short final, the warning flags appear for both the Localiser (LOC) and the Glide Path (GP) on the HSI.\nWhat is the most probable explanation for the warnings?",
    "feedback": "The modulation of the 90 Hz and 150 Hz signals is 0%"
  },
  {
    "question": "In oceanic or remote, en-route and terminal phases of flight PBN is limited to:",
    "feedback": "operations with linear lateral performance requirements and time constraints"
  },
  {
    "question": "Which radio navigation aid is mainly affected by the Shoreline/Coastal effect?",
    "feedback": "NDB"
  },
  {
    "question": "The On-Board Performance Monitoring and Alerting (OBPMA):\n1) OBPMA is done on-board the aircraft and not elsewhere, i.e. using ATC surveillance2) OBPMA is implicit for RNAV operations3) OBPMA is usually performed by a GPS augmentation system4) OBPMA allows the crew to detect whether the RNP system satisfies the navigation performance required in the navigation specification",
    "feedback": "1, 2, 3, 4"
  },
  {
    "question": "If the reference phase differs 30° with the variable phase the radial from the VOR station will be :",
    "feedback": "030°"
  },
  {
    "question": "Under CS-25 colour code rules for Electronic Flight Instrument Systems (EFIS), current data and values are coloured:",
    "feedback": "white"
  },
  {
    "question": "In relation to the satellite navigation system NAVSTAR/GPS, which of the following statements correctly describes the term 'Pseudo Random Noise (PRN)' signal?",
    "feedback": "PRN is a code used for the identification of the satellites and the measurement of the time taken by the signal to reach the receiver"
  },
  {
    "question": "What is the minimum height an aircraft must be to receive signals from a VOR at 196 ft AMSL at a range of 175 NM?",
    "feedback": "16000 ft"
  },
  {
    "question": "In general, a GPS receiver is able to determine:",
    "feedback": "a three dimensional position, groundspeed and a precise time reference"
  },
  {
    "question": "Which of the following errors is associated with the use of VOR?",
    "feedback": "Scallopping"
  },
  {
    "question": "Flying around different parts of Europe, it is apparent that there are a significant number of EGNOS based procedures available. When it comes to approaches, all parts of the continent use the same EGNOS system but for each runway there is a given 5-digit channel number. Which of the following statements is correct?",
    "feedback": "EGNOS covers an extensive area by using geostationary satellites and the channel number is used for approach identification only since EGNOS uses the normal GPS frequency"
  },
  {
    "question": "The minimum range of a primary radar, using the pulse technique, is determined by the (i)........ ; the maximum unambiguous range by the (ii).........",
    "feedback": "(i)  pulse length (ii) pulse recurrence frequency"
  },
  {
    "question": "Assume that one of the satellites used by a GPS receiver is faulty and that the PDOP has a relatively low value. When the signals of 6 satellites are received (including the faulty one) the RAIM software in the receiver:",
    "feedback": "is able to detect that one of the satellites is faulty and is able to identify and isolate the faulty one"
  },
  {
    "question": "Which of the following Secondary Surveillance Radar (SSR) codes is used to indicate transponder malfunction?",
    "feedback": "0000"
  },
  {
    "question": "An airborne weather radar, with a beamwidth of 4° in azimuth, is used in mapping mode. At what maximum range would it be able to detect a 1 NM wide opening in a facing sea cliff?",
    "feedback": "15 NM"
  },
  {
    "question": "A VOR and DME are co-located.\nYou want to identify the DME by listening to the callsign.\nHaving heard the same callsign 4 times in 30 seconds the:",
    "feedback": "DME callsign is the one with the higher pitch that was broadcast only once"
  },
  {
    "question": "The frequency band of the GBAS data link is:",
    "feedback": "VHF band of ILS and VOR systems"
  },
  {
    "question": "Under CS-25 colour code rules features displayed in cyan/blue, on an Electronic Flight Instrument Systems (EFIS), indicate:",
    "feedback": "the sky"
  },
  {
    "question": "In using an airborne Doppler navigation system, the Doppler shift is proportional to",
    "feedback": "Aircraft speed and transmitter frequency"
  },
  {
    "question": "What number of satellites can be found in one orbit of the full operational NAVSTAR/GPS system?",
    "feedback": "4 satellites"
  },
  {
    "question": "An aircraft not equipped with a temperature-compensating system is executing an RNP APCH to a Baro-VNAV minimum. The minimum temperature to execute the procedure (TMIN) is -8°C. The temperature at the airport is +10°C. The pilots have set the appropriate FMS settings based on the approach charts and the aircraft follows the FMS guidance. During the final approach segment, ATC instructs the pilots to go around immediately as a result of insufficient separation from the surrounding terrain. What caused this outcome?",
    "feedback": "Incorrect altimeter setting, leading to the aircraft being lower than indicated"
  },
  {
    "question": "Which of the following combinations of satellite navigation systems provide the most accurate position fixes in air navigation?",
    "feedback": "NAVSTAR/GPS and GLONASS"
  },
  {
    "question": "Which of the following combinations of satellite navigation systems provide the most accurate position fixes in air navigation?",
    "feedback": "NAVSTAR/GPS and GLONASS"
  },
  {
    "question": "The figure of a multifunction display shows VOR1 on the EHSI, which is tuned and correctly identified to a nearby VOR station. The aircraft is located:",
    "feedback": "5° left of the selected radial 045 outbound"
  },
  {
    "question": "A mode A/C transponder receives a P2 pulse from which the amplitude is smaller than that of the P1 (and P3) pulse.\n\nWhat is the reason?",
    "feedback": "The transponder is located in the direction of the main lobe of the interogator antenna"
  },
  {
    "question": "Full deflection on a glide slope indicator indicates that the aircraft is approximately:",
    "feedback": "0.7° above or below the correct glide path"
  },
  {
    "question": "What is the maximum latitude of a GPS-satellite ground track?",
    "feedback": "55° N/S"
  },
  {
    "question": "Locators are:\n\n1) High powered NDBs used for en route and airways navigation\n2) Low powered NDBs used for airfield or runway approach\n3) Beacons with a usually range of 10 to 250 NM\n4) Beacons with a usually range of 10 to 25 NM. \n\nThe combination regrouping all the correct statements is:",
    "feedback": "2 and 4."
  },
  {
    "question": "RNP APCH is used ....",
    "feedback": "in the approach phases of flight"
  },
  {
    "question": "To enter a holding pattern based on a VORDME fix, which entry sectors are permissible when following a DME arc entry track?",
    "feedback": "1, 3"
  },
  {
    "question": "What is the effect of multipath signals (coming from the same aircraft) at the Ground VHF Direction Finder station?",
    "feedback": "They may result in bearing errors"
  },
  {
    "question": "The outer marker of an ILS with a 3° glide slope is located 4.6 NM from the threshold. Assuming a glide slope height of 50 FT above the threshold, the approximate height of an aircraft passing the outer marker is:",
    "feedback": "1450 FT"
  },
  {
    "question": "You are flying parallel to the coastline. An NDB is positioned about 10 NM inland. In which areas will you observe the Shoreline/Coastal Effect?",
    "feedback": "Area C + D, deflection to the coastline"
  },
  {
    "question": "Aircraft 1 is flying using a PBN navigation specification. Aircraft 2 is flying based on conventional navigation aids. One of the main differences between the aircraft is that aircraft 1 ......",
    "feedback": "is using computed data instead of raw data"
  },
  {
    "question": "What are the data elements transmitted by NAVSTAR GPS satellites?\n\n1) Offset of the satellite clock from UTC\n2) Ephemeris data\n3) Health data\n4) Ionospheric delays\n5) Solar activity\n\nThe combination the regroups all of the correct statements is:",
    "feedback": "1, 2, 3, 4"
  },
  {
    "question": "On which bearings do the errors caused by the Shoreline/Coastal Effect reach their maximum?",
    "feedback": "On bearings 000° to 030° to the coastline"
  },
  {
    "question": "What drift is being experienced?",
    "feedback": "8° Left"
  },
  {
    "question": "Radar returns, on a B737-400, can be displayed on all Electronic Horizontal Situation Indicator (EHSI) screen modes of an Electronic Flight Instrument System (EFIS) WITH THE EXCEPTION OF:",
    "feedback": "FULL NAV, FULL VOR/ILS and PLAN"
  },
  {
    "question": "Which of the figures above indicates the azimuth coverage of the ILS localizer?",
    "feedback": "Figure C"
  },
  {
    "question": "An NDB is on a relative bearing of 316° from an aircraft.\nGiven:\n\nCompass heading: 270°\nDeviation at aircraft: 2°W, variation 30°E\nVariation at station: 28°E\n\nCalcluate the true bearing of the NDB from the aircraft:",
    "feedback": "254°"
  },
  {
    "question": "Given the following information, what is the true bearing from the NDB to the aircraft?\nCompass Heading: 348°ADF Indication - Relative Bearing Indicator (RBI): 317°Deviation: -2°Variation: 22°Wthe effect of convergence can be ignored",
    "feedback": "101°(T)"
  },
  {
    "question": "An aircraft is flying on a MH of 010°. The magnetic variation at the VOR is 10°W and at the aircraft 12°W.\n\nWhich VOR-RMI corresponds to the indications on the CDI shown?",
    "feedback": "Figure A"
  },
  {
    "question": "A VOR is sited at position A (45°00'N,  010°00'E). An aircraft is located at position B (44°00'N, 010°00'E). Assuming that the magnetic variation at A is 10°W and at B is 15°W, the aircraft is on VOR radial:",
    "feedback": "190°"
  },
  {
    "question": "Which of the following coordinate systems is used by the GPS receiver to determine position (Latitude, longitude and altitude)?",
    "feedback": "WGS 84"
  },
  {
    "question": "Which diagram shows the correct coverage area for a Ground-Based Augmentation System (GBAS) providing three-dimensional (3D) guidance in the final approach segment?",
    "feedback": "Figure D"
  },
  {
    "question": "Errors in GPS satellite orbits are due to:",
    "feedback": "the solar wind and the gravitation of sun, moon and planets"
  },
  {
    "question": "In flight, a pilot can improve the range of his transmission with a VDF operator by:",
    "feedback": "increasing altitude"
  },
  {
    "question": "What does it mean if a transponder receives a P2 pulse which is stronger than P1 (and P3) pulses?",
    "feedback": "The transponder responses will be suppressed for a short time interval"
  },
  {
    "question": "In order to navigate an aircraft under the specifications of PBN, the pilot must ensure that the onboard navigation database ......",
    "feedback": "is valid for the current AIRAC cycle"
  },
  {
    "question": "What SSR modes are currently in use by ATC?",
    "feedback": "Mode A and Mode C"
  },
  {
    "question": "Which of the following applies to the Doppler VOR, when comparing conventional and Doppler VOR?",
    "feedback": "the reference and variphase signals are reversed but the phase difference remains the same"
  },
  {
    "question": "In order to determine \"ionospheric delay\" corrections on a civilian aoroplane:",
    "feedback": "a \"ionospheric delay\" model is determined from the satellite Nav message"
  },
  {
    "question": "act QDM 120°\nact HDG 120°\nreq QDR 060°\nInt-HDG?",
    "feedback": "040°"
  },
  {
    "question": "How is the unit \"Hertz\" (Hz) defined?",
    "feedback": "The number of oscillations per second of an electromagnetic wave"
  },
  {
    "question": "Basic RNAV requires a track-keeping accuracy of:",
    "feedback": "+/- 5NM or better for 95% of the flight time"
  },
  {
    "question": "In a Satellite-Assisted Navigation system (GNSS/GPS) a position line is obtained by:",
    "feedback": "timing the period that is taken for a satellite's transmission to reach the aircraft's receiver"
  },
  {
    "question": "An aircraft flies from a VOR at 61°N 013°W to 58°N 013°W. The variation at the VOR station is 13°W and at the aircraft's position 5°W. What radial is the aircraft on?",
    "feedback": "193°"
  },
  {
    "question": "Consider the following statements on ILS:",
    "feedback": "ILS is the primary precision approach facility for civil aviation"
  },
  {
    "question": "Modulation is:",
    "feedback": "the addition of a low frequency signal (tone, voice) onto a high frequency carrier wave"
  },
  {
    "question": "You are flying over sea parallel to the coastline. An NDB is situated 10 NM inland. In which sectors in the diagram does the Shoreline/Coastal Effect reach its minimum?",
    "feedback": "Sectors A + B"
  },
  {
    "question": "For weather radar, the frequency 9375 MHz in X Band is preferable to C Band because:",
    "feedback": "It better detects clouds contour and range is greater with the same transmission power."
  },
  {
    "question": "Which one of the following methods is used by a Microwave Landing System (MLS) to indicate distance from the runway threshold?",
    "feedback": "A DME co-located with the MLS transmitters"
  },
  {
    "question": "To avoid the inaccuracies that may be caused by coastal refraction the pilot should take an ADF bearing when:",
    "feedback": "the aircraft is on the perpendicular to the coast which runs through the NDB"
  },
  {
    "question": "A GPS based SBAS uses satellites to transmit corrections to users. Which statement about these satellites is true?",
    "feedback": "Pseudo-range measuremants to these geostationary satellites can be made as they also transmit a valid GPS navigation message on the GPS frequency"
  },
  {
    "question": "On the Navigation Display (ND), you can see two separate VORs tuned and identified. The radial from PSE VOR is:",
    "feedback": "172°"
  },
  {
    "question": "An aircraft is inbound to VOR X on the 073° radial and experiences a drift of 12°L. A position report is required when crossing the 133° radial from VOR Y. If the aircraft is on track, the RMI indications at the reporting point would be:",
    "feedback": "heading 265°, X pointer 253°, Y pointer 313°"
  },
  {
    "question": "In which frequency band may fading occur during the twilight period?",
    "feedback": "MF"
  },
  {
    "question": "The principle of operation of an ILS localiser transmitter is based on two overlapping lobes that are transmitted on (i).......... frequencies and carry different (ii)..........",
    "feedback": "(i)  the same          (ii)  modulation frequencies"
  },
  {
    "question": "If the remote compass providing heading information to the RMI suddenly suffers a 20° deviation:",
    "feedback": "all answers are correct."
  },
  {
    "question": "The definition of the term QDR is:",
    "feedback": "the magnetic bearing from the station"
  },
  {
    "question": "An ILS receiver:",
    "feedback": "measures the difference in depth of modulation of the two transmitted signals"
  },
  {
    "question": "What is the approximate maximum theoretical range at which an aircraft at FL130 could receive information from a VDF facility which is sited 1024 FT above MSL?",
    "feedback": "180 NM"
  },
  {
    "question": "The BFO selector switch on the ADF receiver is used to:",
    "feedback": "hear the IDENT of some NDB stations radiating a continuous wave signal"
  },
  {
    "question": "When a GPS satellite is marked \"unhealthy\":",
    "feedback": "the navigation data of the satellite is not valid"
  },
  {
    "question": "When both SSR and primary radar is presented on the controller's display",
    "feedback": "The primary radar information is more accurate in bearing and distance"
  },
  {
    "question": "Which of the following gives the best information about the progress of a flight  between 2 en-route waypoints from a RNAV equipment?",
    "feedback": "ETO"
  },
  {
    "question": "The orbital planes of the satellite navigation system NAVSTAR/GPS are:",
    "feedback": "inclined 55° to the equatorial plane"
  },
  {
    "question": "In PBN operations, on-board performance monitoring and alerting of the Path Definition Error (PDE) ......",
    "feedback": "depends on the integrity of the navigation database, and PDE is assumed to be zero"
  },
  {
    "question": "Typically the following sources of information are used by the FMS to establish the aircraft's position",
    "feedback": "VOR/DME, ILS, IRS, GNSS, Radio altimeter"
  },
  {
    "question": "Classify the marker from lower aural frequency to higher aural frequency : 1. Inner marker (if available) 2. Middle marker 3. Outer marker",
    "feedback": "3 - 2 -1"
  },
  {
    "question": "In order to enter a phantom waypoint that is designated by a VOR/DME simple RNAV system, the VOR/DME:",
    "feedback": "does not have to be in range when entered but must be when used"
  },
  {
    "question": "The integrity of the VOR system is improved by using:",
    "feedback": "an automatic ground monitoring system"
  },
  {
    "question": "From which physical phenomenon do sky waves originate?",
    "feedback": "refraction"
  },
  {
    "question": "What number of satellites can be found in one orbit of the full operational GLONASS system?",
    "feedback": "8 satellites"
  },
  {
    "question": "A 3-dimensional RNAV system has capability in:",
    "feedback": "the horizontal plane and in the vertical plane"
  },
  {
    "question": "Of what use, if any, is a military TACAN station to civil aviation ?",
    "feedback": "It can provide DME distance"
  },
  {
    "question": "Which of the figures depicts an Electronic Flight Instrument System (EFIS) display in PLAN mode?",
    "feedback": "Figure 4"
  },
  {
    "question": "Which of the following statements about SBAS/GBAS is true?",
    "feedback": "SBAS can cover more area than GBAS"
  },
  {
    "question": "In order to give the flight crew control of the required lateral guidance functions, the RNAV equipment should be able to perform a number of functions.\n\nWhich of the following is not such a function?",
    "feedback": "Control automatically the speed of the aircraft in order to arrive at the next waypoint at a specified time (timing function)"
  },
  {
    "question": "In order to indicate radio failure the aircraft SSR transponder should be selected to code:",
    "feedback": "7600"
  },
  {
    "question": "Which of the following is an ILS localiser frequency?",
    "feedback": "109.15 MHz"
  },
  {
    "question": "A Primary radar operates on the principle of:",
    "feedback": "pulse technique"
  },
  {
    "question": "Given:\nAircraft heading 160°(M)\nAircraft is on radial 240° from a VOR\nSelected course on HSI is 250°\n\nThe HSI indications are deviation bar:",
    "feedback": "behind the aeroplane symbol with the FROM flag showing"
  },
  {
    "question": "A pilot flying an ILS approach with the \"marker\" selected on the intercom hears a steady sequence of dots. What is the colour of the cockpit indications that is associated with this audio signal?",
    "feedback": "White"
  },
  {
    "question": "If the number of pulse pairs received by the DME transponder exceeds the maximum number possible, which aircraft will always be denied a DME range first?",
    "feedback": "The aircraft from which the weakest pulse pairs are received"
  },
  {
    "question": "To which performance does the RNP concept apply?",
    "feedback": "Navigation performance within airspaces"
  },
  {
    "question": "The phenomenon when a wave bends when it passes around an impenetrable obstacle is called:",
    "feedback": "diffraction"
  },
  {
    "question": "The aircraft DME receiver cannot lock on to interrogation signals reflected from the ground because:",
    "feedback": "aircraft transmitter and DME ground station are transmitting on different frequencies"
  },
  {
    "question": "Under CS-25 colour code rules for Electronic Flight Instrument Systems (EFIS), a selected heading is coloured:",
    "feedback": "magenta"
  },
  {
    "question": "An airport uses PBN operations. Which kind of specification is to be found in the STAR?",
    "feedback": "RNAV 1"
  },
  {
    "question": "An aircraft at 6400 FT will be able to receive a VOR groundstation at 100 FT above MSL at an approximate maximum range of :",
    "feedback": "110 NM"
  },
  {
    "question": "What is the orbital time of a NAVSTAR/GPS navigation satellite?",
    "feedback": "11h 58min"
  },
  {
    "question": "Under CS-25 colour code rules, features displayed in green on an Electronic Flight Instrument System (EFIS), indicate:",
    "feedback": "engaged modes"
  },
  {
    "question": "Which statement below concerning Mountain Effect is correct?",
    "feedback": "It may occur on NDB and VOR bearings"
  },
  {
    "question": "The meaning of the term \"ABAS\" is:",
    "feedback": "Aircraft-based augmentation systems"
  },
  {
    "question": "The information carried by a signal emitted from a VOR is",
    "feedback": "In what magnetic direction the signal left the VOR antenna, and the identification of the station"
  },
  {
    "question": "An aircraft is situated at 30°N 005°E with a magnetic variation of 10°W. A VOR is located at 30°N 013°E with a magnetic variation of 15°W. The aircraft is situated on the VOR radial:",
    "feedback": "287°"
  },
  {
    "question": "Distance Measuring Equipment (DME) operates in the:",
    "feedback": "UHF band and is a secondary radar system"
  },
  {
    "question": "The skip zone is defined as:",
    "feedback": "the area, where neither the ground waves nor the sky waves are received"
  },
  {
    "question": "act QDR 285° act HDG 290° req QDR 290° Time passed the station 2Min. Correction HDG?",
    "feedback": "300°"
  },
  {
    "question": "Which of the following are output data from 4D RNAV systems?\n1) Flight level and altitudes2) Radials from VOR/DME stations3) GS and TAS4) True wind and track errors\nThe combination re-grouping all of the correct statements is:",
    "feedback": "3, 4"
  },
  {
    "question": "What is an example of a self contained RNAV system?",
    "feedback": "INS"
  },
  {
    "question": "Under which of the following circumstances does a VOR/DME Area Navigation system switch to Dead Reckoning mode?",
    "feedback": "VOR/DME Area Navigation computer is receiving neither radial nor distance data information from VOR/DME stations"
  },
  {
    "question": "Which of the following requires FAS data block?",
    "feedback": "RNP APCH LPV"
  },
  {
    "question": "The maximum range obtainable from an en-route Surveillance Radar is approximately:",
    "feedback": "200-300 NM"
  },
  {
    "question": "When flying at 6000 feet above ground level, the DME indicates 5 NM. What is the horizontal distance from the aircraft to overhead the DME?",
    "feedback": "4.9 NM"
  },
  {
    "question": "How are radio waves in MF propagated?",
    "feedback": "At daytime as ground wave, during night as ground wave and sky wave"
  },
  {
    "question": "An aircraft is flying a heading of 090° along the equator, tracking direct to a VOR. If the variation at the aircraft's position is 10°E and 15°E at the VOR, the aircraft is situated on radial:",
    "feedback": "255°"
  },
  {
    "question": "Every 10 kt decrease in groundspeed, on a 3° ILS glidepath, will require an approximate:",
    "feedback": "decrease in the aircraft's rate of descent of 50 FT/MIN"
  },
  {
    "question": "The indicator of the ground VDF equipment responds to",
    "feedback": "The carrier wave received"
  },
  {
    "question": "A pilot is planning to fly an RNP 1 STAR (Standard Terminal Arrival) but notices that one of the waypoints is missing in the FMS readout of the procedure, when comparing to the chart. It appears that due to an error, the missing waypoint is not defined in the FMS database.\nAs a result of this error, the pilot may ......",
    "feedback": "not fly the planned procedure and must request an alternative STAR"
  },
  {
    "question": "By using EGNOS in combination with GPS:",
    "feedback": "the integrity is improved by reducing the mean failure reporting time from up to 3 hours to 6 seconds"
  },
  {
    "question": "Which of the following list use the VHF band?\n\n1) Locator\n2) Localiser\n3) Outer Marker\n4) Glide path\n\nThe combination that regroups all of the correct statements is:",
    "feedback": "2, 3"
  },
  {
    "question": "An estimate of the position accuracy from the Global Navigation Satellite System (GNSS) can be derived from several factors, including:",
    "feedback": "Geometric Dilution Of Precision (GDOP) and User Equivalent Range Error (UERE)"
  },
  {
    "question": "In the DME system",
    "feedback": "The receive and the transmit frequency is always split by 63 MHz"
  },
  {
    "question": "In the NAV message, the \"ephemeris\" refers to the exact:",
    "feedback": "position and orbit of the observed satellite."
  },
  {
    "question": "Most Airborne Weather Radar (AWR) systems transmit in the ....",
    "feedback": "SHF band"
  },
  {
    "question": "Which of the following is a requirement for Required Navigation Performance (RNP) operations? Aera navigation that includes the requirements for:",
    "feedback": "on-board performance monitoring and alerting"
  },
  {
    "question": "Within the Performance Based Navigation concept, RNP requires on-board performance monitoring and alerting. An advanced navigation system such as a Flight Management System (FMS) will assess its own position and calculate an Estimated Position Error (EPE). How can this be achieved?",
    "feedback": "The FMS will use several sources of navigation information and, depending on their expected accuracy, create a comparison between these position data and the FMS position"
  },
  {
    "question": "The picture shows the display of an Airborne Weather Radar (AWR) with two aerodromes located at positions B and C. What levels of precipitation is to be expected at these aerodromes?",
    "feedback": "Weather conditions at aerodrome B cannot be determined. At aerodrome C, no or low level of precipitation is to be expected"
  },
  {
    "question": "SHF (Super High Frequency) waves appear in the frequency spectrum:",
    "feedback": "3 GHz - 30 GHz"
  },
  {
    "question": "What is the colour sequence when passing over an Outer, Middle and Inner Marker beacon?",
    "feedback": "blue   -   amber   -   white"
  },
  {
    "question": "A flight crew is in the cruise, preparing to fly an RNP APCH. Which of the following has to be performed?\n1) Load the procedure from a valid aircraft navigation database2) Individually insert each waypoint's coordinates into the navigation system3) Cross-check the waypoint sequence with a valid approach chart4) Cross-check the lateral path with a VOR or NDB overlay approach",
    "feedback": "1, 3"
  },
  {
    "question": "Given: Aircraft position 52°09'S 024°E, magnetic variation 14°W, FL 310. BIT VOR/DME position 54°42'S 024°E, magnetic variation 14°E.  In order to read the most accurate ground speed given by the DME receiver from his present position, the pilot must follow which BIT radial?",
    "feedback": "346°"
  },
  {
    "question": "The high Altitude Radio Altimeter uses the following wavelengths:",
    "feedback": "decimetric."
  },
  {
    "question": "Echoes that do not change in distance from the antenna (relative speed zero) of a ground radar with a Moving Target Indicator (MTI) are dangerous for the following reason:",
    "feedback": "The Moving Target Indicator (MTI) eliminates such echoes"
  },
  {
    "question": "An aircraft carrying out a 3° glidepath ILS approach experiences a reduction in groundspeed from 150 kt at the outer marker to 120 kt over the threshold. The effect of this change in groundspeed on the aircraft's rate of descent will be a decrease of approximately:",
    "feedback": "150 FT/MIN"
  },
  {
    "question": "During daytime the range of an NDB depends on:",
    "feedback": "the power output and the nature of the earth's surface over which the ground wave travels"
  },
  {
    "question": "Which of the following statements about the accuracy that can be obtained with the LAAS (local area augmentation system) of the satellite navigation system NAVSTAR GPS is correct?",
    "feedback": "The closer the receiver is to a LAAS ground reference station, the more accurate is the aircraft position fix"
  },
  {
    "question": "In order to ascertain whether a cloud return on an Aircraft Weather Radar (AWR) is at or above the height of the aircaft, the tilt control should be set to: \n(Assume a beam width of 5°)",
    "feedback": "2.5° up"
  },
  {
    "question": "The minimum airborne equipment required for operation of a VHF direction finder is a:",
    "feedback": "VHF transmitter-receiver operating in the 118 MHz to 136 MHz range."
  },
  {
    "question": "A typical frequency employed in Distance Measuring Equipment (DME) is:",
    "feedback": "1000 MHz"
  },
  {
    "question": "Refer to Jeppesen GSPRM, chart E(LO)14\nWhat are the correct identification, frequency, and Morse code for the Alghero VOR (40°38'N 008°015'E)?",
    "feedback": "ALG, 113.8 MHz, ._ ._.. __."
  },
  {
    "question": "The transmission of the glide slope beacon is characterised by a:",
    "feedback": "UHF frequency with a minimum range of 10 NM"
  },
  {
    "question": "An aircraft is flying a heading of 245° towards a VOR at FL300. The HSI displays a \"selected course\" of 255° with a TO indication. The variation at the VOR is 15°E. Variation at the aircraft position is 16°E and the deviation is +1°\n.\n\nWhen the pilot keeps the CDI on the left inner dot on a display with two dots on either side,",
    "feedback": "the VOR will be approached along radial 070"
  },
  {
    "question": "In weather radar the use of a cosecant beam in 'Mapping' mode enables:",
    "feedback": "scanning of a large ground zone producing echos whose signals are practically independent of distance"
  },
  {
    "question": "In respect of the use of GNSS, Dilution of Precision (DOP) is a loss of accuracy due to:",
    "feedback": "relative position of the visible satellites"
  },
  {
    "question": "How can an Air Traffic Control unit determine the position of an aircraft?",
    "feedback": "By using auto-triangulation provided from several VDF bearings from different stations"
  },
  {
    "question": "In what piece of FMS equipment will the pilot enter the waypoint information for the route?",
    "feedback": "Control Display Unit"
  },
  {
    "question": "When an operator increases the range on a radar display, in general:",
    "feedback": "the PRF becomes lower and the pulse length larger"
  },
  {
    "question": "Which of the following is an Aircraft-Based Augmentation System?",
    "feedback": "RAIM"
  },
  {
    "question": "An aircraft at FL 100 should be able to receive a VOR groundstation at 100 FT above MSL at an approximate maximum range of :",
    "feedback": "135 NM"
  },
  {
    "question": "Which letter in the figure below indicates the Skip Distance?",
    "feedback": "d"
  },
  {
    "question": "In order to give the flight crew control of the required lateral guidance functions, the RNAV equipment should be able to perform a number of functions.\n\nWhich of the following is not such a function?",
    "feedback": "Display the satellites used by the GPS receiver on the CDU"
  },
  {
    "question": "Check the correctness of the following statements:\n1) Conventional radio navigation is based on raw data from specific navaids such as VOR, DME, or NDB2) PBN is based on sensor-specific computed data",
    "feedback": "1) is correct, 2) is not correct"
  },
  {
    "question": "From the following statements, select those which apply: -1: The coupling of MLS with DME/P greatly enhances accuracy -2: A DME/P channel is not paired with the azimuth and elevation channel of the MLS -3: A DME/P may be substituted by a navigation DME and is therefore not an integral part of the MLS -4: The DME/P may be used to enhance accuracy of an Instrument Landing System (ILS)",
    "feedback": "only 1 is correct"
  },
  {
    "question": "If, when you are requesting a QDM from an airfield, you are offered a QGH, it means",
    "feedback": "The VDF unit is prepared to give you assistance during an approach to the airfield, based on VDF bearings"
  },
  {
    "question": "Pulse length is expressed in units of ....",
    "feedback": "time"
  },
  {
    "question": "In the NAVSTAR/GPS satellite navigation system, what is the maximum time taken to receive the complete set of almanac data from all satellites?",
    "feedback": "12.5 minutes (= 30 seconds per data frame)"
  },
  {
    "question": "On the RMI the tip of a VOR needle indicates 060.\n\nWith the CRS set on 055 the indications on the HSI are:",
    "feedback": "TO, half scale deflection to the right"
  },
  {
    "question": "An en-route surveillance radar will typically use a frequency of",
    "feedback": "600 MHz"
  },
  {
    "question": "Apart from radials and distances from VOR/DME stations, what information is required by the VOR/DME Area Navigation computer in order to calculate the wind?",
    "feedback": "Heading from the aircraft compass system and true airspeed from the air data computer"
  },
  {
    "question": "An aircraft is flying on a heading of 270°(M). The VOR OBS is also set to 270° with the full left deflection and FROM flag displayed. \nIn which sector is the aircraft from the VOR ground station?",
    "feedback": "NW"
  },
  {
    "question": "The quoted accuracy of a VOR is valid:",
    "feedback": "at all times"
  },
  {
    "question": "In case a discrepancy occurred between the on-board navigation database and the published procedure:",
    "feedback": "Pilots must not fly an RNP APCH"
  },
  {
    "question": "What is the approximate angular coverage of reliable navigation information for a 3° ILS glide path out to a distance of 10 NM?",
    "feedback": "1.35° above the horizontal to 5.25° above the horizontal and 8° each side of the localiser centreline"
  },
  {
    "question": "The information available about an aircraft on an air traffic controller's screen may include (1) .... from the (2) .... .",
    "feedback": "(1) ground speed, (2) SSR"
  },
  {
    "question": "In order to measure the radial from a VOR, the aircraft VOR receiver:",
    "feedback": "measures the phase difference between the reference phase and the variable phase of the signal."
  },
  {
    "question": "When using ADF, the sky-wave (night) effect:",
    "feedback": "is most dominant around dusk and dawn"
  },
  {
    "question": "The Performance Based Navigation (PBN) concept expresses performance requirements using specific terms. The term that defines the conformance of the true position and the required position is ....",
    "feedback": "Accuracy"
  },
  {
    "question": "What is the Doppler effect with reference to radio signals?",
    "feedback": "It is the shift in frequency of the radio wave due to the relative movement between transmitter and receiver"
  },
  {
    "question": "User Equivalent Range Error (UERE) or User Range Accuracy (URA) is a signal-in-space error consisting of several individual errors. The most significant of these errors is:",
    "feedback": "Ionospheric Propagation Delay (IPD)"
  },
  {
    "question": "GPS satellites broadcast signals that enable a suitable receiver to obtain a position. Each satellite transmits....",
    "feedback": "ranging signals on the L1 and L2 UHF frequencies"
  },
  {
    "question": "Within the PBN concept, which of the following statements is correct?",
    "feedback": "In the approach phases of flight, PBN accommodates both linear and angular laterally guided operations"
  },
  {
    "question": "Which of the following statements concerning the variable, or directional, signal of a conventional VOR is correct?",
    "feedback": "The rotation of the variable signal at a rate of 30 times per second gives it the characteristics of a 30 Hz amplitude modulation"
  },
  {
    "question": "Which of the following equipments uses primary radar principles?",
    "feedback": "Airborne Weather Radar (AWR)"
  },
  {
    "question": "The OBS is set to 235°, magnetic heading 200°. The indications of the VOR receiver are half scale deflection left and \"TO\". The aircraft is therefore on the radial:",
    "feedback": "050°"
  },
  {
    "question": "Precision RNAV (P-RNAV) requires a track-keeping accuracy of:",
    "feedback": "1.0 NM standard deviation or better"
  },
  {
    "question": "Check the following statements for correctness:\n1) RNAV 2 may be used in the en-route continental, arrival and departure phases of flight2) Regarding RNAV 2, latitude and longitude values may be entered manually by the crew",
    "feedback": "1) is correct, 2) is not correct"
  },
  {
    "question": "The heading rose of an HSI is frozen on 200°. Lined up on the ILS of runway 25, the localizer needle will be:",
    "feedback": "centred"
  },
  {
    "question": "Which of the following summaries lists only directional antennae?",
    "feedback": "Loop antenna, parabolic antenna, slotted planar array antenna, helical antenna"
  },
  {
    "question": "You are flying across northern Canada on airway NCA Whiskey. You wish to cross check the IRS computed position by taking a bearing from a nearby VOR. When tuning in the Churchill VOR you note, that you are on the 300° radial. What is the bearing to plot on a chat if the variation at the VOR is 2°W and the variation at the aircraft is 4°E?",
    "feedback": "298°"
  },
  {
    "question": "'Night Effect' which causes loss of signal and fading, resulting in bearing errors from NDB transmissions, is due to:",
    "feedback": "skywave distortion of the null position and is maximum at dawn and dusk"
  },
  {
    "question": "Quadrantal errors associated with aircraft Automatic Direction Finding (ADF) equipment are caused by:",
    "feedback": "signal bending by the aircraft metallic surfaces"
  },
  {
    "question": "In the B737-400 Flight Management System the CDUs are used during preflight to:",
    "feedback": "manually initialize the IRSs and FMC with dispatch information"
  },
  {
    "question": "The VHF direction finder uses the following wavelengths:",
    "feedback": "metric."
  },
  {
    "question": "The Low Altitude Radio Altimeter uses the following wavelengths:",
    "feedback": "centimetric."
  },
  {
    "question": "By selecting one VHF frequency, in the range of 108 to 112 MHz, on the NAV receiver:",
    "feedback": "rho-theta information from a terminal VOR/DME can be obtained"
  },
  {
    "question": "An approach using GNSS only must meet the following RNP APCH minima:",
    "feedback": "LNAV minima"
  },
  {
    "question": "Which of the following terms refers to a fixed radius path for en-route sections using Performance Based Navigation (PBN)?",
    "feedback": "FRT leg type"
  },
  {
    "question": "How does a Mode S interrogator identify aircraft?",
    "feedback": "with a 24 bit identifier, giving over 16 million combinations"
  },
  {
    "question": "Which of the following affects VDF range?",
    "feedback": "The height of the transmitter and of the receiver"
  },
  {
    "question": "The range of a locator according to ICAO Annex 10 is",
    "feedback": "10-25 NM"
  },
  {
    "question": "Refer to figure 2B. If you turn the knob of the CDI 2.5° clockwise, what would happen to the indication during the ILS approach?",
    "feedback": "Nothing"
  },
  {
    "question": "In a Satellite-Assisted Navigation System (GNSS/GPS), a fix is obtained by:",
    "feedback": "measuring the time taken for a minimum number of satellites' transmissions, in known positions, to reach the aircraft's receiver"
  },
  {
    "question": "When intercepting the glide path from below, which PDF display allows to start the descent?",
    "feedback": "Figure C"
  },
  {
    "question": "Modulation is:",
    "feedback": "the addition of information onto a radio wave during transmission"
  },
  {
    "question": "A Cat III ILS glidepath transmitter provides reliable guidance information down to:",
    "feedback": "the surface of the runway"
  },
  {
    "question": "The ILS marker identified visually by a white light flashing is the:",
    "feedback": "inner marker"
  },
  {
    "question": "The difference between Area Navgiation (RNAV) and Required Navigation Performance (RNP) is that RNP includes requirements for:",
    "feedback": "on-board performance monitoring and alerting"
  },
  {
    "question": "A Mode S transponder:",
    "feedback": "responds normally to Mode A or C interrogations"
  },
  {
    "question": "The following flight plan has been inserted into the navigation system : WPT1, WPT2, WPT3, WPT4, WPT5. Between WPT1 and WPT2, a clearance is given to proceed directly to WPT5. In order to achieve this the pilot must:",
    "feedback": "type DIR TO WPT5 on his keyboard"
  },
  {
    "question": "The relative bearing to VOR 2 is .....",
    "feedback": "300°"
  },
  {
    "question": "On an HSI (Horizontal Situation Indicator) used in combination with a VOR receiver",
    "feedback": "A pictorial presentation of aircraft deviation relative to VOR radials is provided"
  },
  {
    "question": "Which of the following procedures must be adopted if, on a flight under IFR conditions using a NAVSTAR/GPS satellite navigation system receiver, the position fix obtained from the GPS receiver differs from the position of conventional navigation systems by an unacceptable amount?",
    "feedback": "It may be continued using conventional navigation systems"
  },
  {
    "question": "An aircraft is \"homing\" to a radio beacon whilst maintaining a relative bearing of zero. \nIf  the magnetic heading decreases, the aircraft is experiencing :",
    "feedback": "right drift"
  },
  {
    "question": "At what approximate height above the WGS-84 ellipsoid are GLONASS satellites circling the earth?",
    "feedback": "19100 km"
  },
  {
    "question": "The basic elements of the satellite navigation system NAVSTAR/GPS are the:",
    "feedback": "control, space and user segments"
  },
  {
    "question": "SBAS is required to comply with the PBN specifications for RNP approaches down to:",
    "feedback": "LPV minima"
  },
  {
    "question": "GPS receivers, using both GPS frequencies L1 and L2, can nearly eliminate:",
    "feedback": "ionospheric propagation delay"
  },
  {
    "question": "Which of the distances indicated will be shown on a basic VOR/DME-based Area Navigation Equipment when using a 'Phantom Station' as depicted on the picture?",
    "feedback": "9 NM"
  },
  {
    "question": "When an aircraft is operating its Secondary Surveillance Radar in Mode C an air traffic controller's presentation gives information regarding the aircraft's indicated pressure altitude in increments of:",
    "feedback": "100 ft"
  },
  {
    "question": "What is the reason that a DME interrogator makes use of an irregular transmission sequence?",
    "feedback": "In this way the DME interrogator is able to distinguish between his own reply pulse pairs and the reply pulse pairs of other aircraft"
  },
  {
    "question": "RNP 5 (Required Navigation Performance) requires a navigation accuracy of:",
    "feedback": "+/- 5 NM lateral 95% of the flight time"
  },
  {
    "question": "An aircraft at FL350 is using a VOR (2060 ft AMSL). The maximum theoretical range at which the VOR can be used is:",
    "feedback": "290 NM"
  },
  {
    "question": "Which statement regarding GLONASS compared to GPS/NAVSTAR is true?",
    "feedback": "GLONASS satellites orbit faster than GPS/NAVSTAR satellites"
  },
  {
    "question": "How many orbits does the fully operational NAVSTAR/GPS consist of?",
    "feedback": "6 orbits"
  },
  {
    "question": "At an altitude of 20000 ft you would expect to detect a VOR (located at sea level) at a range of:",
    "feedback": "177 NM"
  },
  {
    "question": "The three main components of VOR airborne equipment are:",
    "feedback": "Receiver, antenna, display"
  },
  {
    "question": "Which statement about ADFs is correct?",
    "feedback": "ADFs can receive and take bearing on any broadcasting stations transmitting within the frequency band 190-1750 kHz"
  },
  {
    "question": "The track-line on the Electronic Horizontal Situation Indicator (EHSI) or Navigation Display of an Electronic Flight Instrument System:",
    "feedback": "represents the track of the aircraft over the ground. When it co-incides with the desired track, wind influence is compensated for"
  },
  {
    "question": "In the context of PBN operations, what is Navigation System Error (NSE)?",
    "feedback": "It refers to the difference between the aircraft's estimated position and its actual position"
  },
  {
    "question": "In the approach phases of flight PBN accommodates",
    "feedback": "both linear and angular laterally guided operations"
  },
  {
    "question": "Which statement about the C/A code transmitted by the GPS satellites is correct?",
    "feedback": "The C/A code is a PRN code, repeating every millisecond"
  },
  {
    "question": "An NDB transmits a signal pattern in the horizontal plane which is:",
    "feedback": "omnidirectional"
  },
  {
    "question": "An aircraft is flying on a MH of 210°. The magnetic variation at the VOR is 5°W and at the aircraft 10°W.\n\nAccording to the HSI shown the aircraft is on radial:",
    "feedback": "025"
  },
  {
    "question": "The principle of operation of an ILS is:",
    "feedback": "the difference in depth of modulation"
  },
  {
    "question": "An aircraft on a heading of 180° M is on a radial of 270° M from a VOR. The bearing which should be selected on the OBS to centralize the VOR/ILS left/right deviation needle and to proceed to the VOR is:",
    "feedback": "090°"
  },
  {
    "question": "An aircraft flies over position A which is due North of a VOR station sited at position B. The magnetic variation at A is 18°W and at B is 10°W. What radial from B is the aircraft on?",
    "feedback": "010°"
  },
  {
    "question": "Assuming a CDI with five dots on each side of the display operating in ILS (localiser) mode, what does each of the dots represent approximately:",
    "feedback": "0.5°"
  },
  {
    "question": "Electromagnetic waves in the LF band have a frequency spectrum of:",
    "feedback": "30-300 kHz"
  },
  {
    "question": "The spacing between the two pulses transmitted by an SSR interrogator determines:",
    "feedback": "what mode is used"
  },
  {
    "question": "Your aircraft is able to fly RNP APCH. Is it allowed to conduct RNP 2?",
    "feedback": "Not necessarily. First, establish the aircraft eligibility"
  },
  {
    "question": "A DME that has difficulty obtaining a \"lock-on\":\n(NOTE: PRF = pulse recurrence frequency,  \n              PPS = pulses per second)",
    "feedback": "stays in search mode but reduces PRF to max. 60 PPS after 15000 pulse pairs have been transmitted"
  },
  {
    "question": "The frequency of the amplitude modulation and the colour of an outer marker (OM) light is:",
    "feedback": "400 Hz, blue"
  },
  {
    "question": "The audio frequency modulation of the inner marker (if available) shall be keyed as follows:",
    "feedback": "6 dots per second continuously"
  },
  {
    "question": "In the NAVSTAR GPS system, authorised users can calculate positions from ....",
    "feedback": "PPS as well as the less accurate SPS"
  },
  {
    "question": "In a primary radar using pulse technique, Pulse Recurrence Frequency (PRF)/Pulse Recurrence Rate (PRR) determines:",
    "feedback": "maximum theoretical range"
  },
  {
    "question": "According to ICAO DOC 9613, which of the following statements is correct?",
    "feedback": "RNP procedures require approval and are operator dependent"
  },
  {
    "question": "What is the frequency of a radio wave with a wavelength of 8.25 m?",
    "feedback": "36.4 MHz"
  },
  {
    "question": "An aircraft is flying on a MH of 010°. The magnetic variation at the VOR is 10°W and at the aircraft 12°W.\n\nWhich VOR-RMI corresponds to the indications on the HSI shown?",
    "feedback": "Figure C"
  },
  {
    "question": "Which of the following is a valid frequency (MHz) for a VOR?",
    "feedback": "112,20"
  },
  {
    "question": "The interrogation pulse sequence on board an aircraft DME system:",
    "feedback": "Changes from interrogation to interrogation"
  },
  {
    "question": "Are operators with aircraft quipped with a single IRS or INS permitted to extend their RNAV 10 capability time?",
    "feedback": "Yes, they can extend the time by updating"
  },
  {
    "question": "What type of  satellite navigation system NAVSTAR/GPS receiver is most suitable for use on board an aircraft?",
    "feedback": "Multichannel"
  },
  {
    "question": "Which of the figures depicts an Electronic Flight Instrument System (EFIS) display in PLAN mode?",
    "feedback": "Figure 2"
  },
  {
    "question": "Consider the following statements on ILS back beam approach:",
    "feedback": "All 3 statements are correct"
  },
  {
    "question": "What are, in order of highest priority followed by lowest, the two levels of message produced by the CDU of the B737-400 Electronic Flight Instrument System?",
    "feedback": "Alerting and Advisory"
  },
  {
    "question": "In which situation will speed indications on an airborne Distance Measuring Equipment (DME) most closely represent the groundspeed of an aircraft flying at FL400?",
    "feedback": "When tracking directly towards the station at a range of 100 NM or more"
  },
  {
    "question": "The Fan Markers uses the following wavelengths:",
    "feedback": "metric."
  },
  {
    "question": "The figure shows an Airborne Weather Radar display with two aerodromes indicated at positions B and C. What are the likely levels of precipitation at these aerodromes?",
    "feedback": "Conditions at aerodrome B cannot be determined. At aerodrome C, no or low precipitation"
  },
  {
    "question": "An aircraft is flying an ILS approach and is descending on the final segment. With which PFD display must a go-around be commenced immediately?",
    "feedback": "Figure C"
  },
  {
    "question": "On a standard radar display (PPI)",
    "feedback": "The time base is made to rotate synchronously with the antenna in order to display bearing as well as range"
  },
  {
    "question": "When switching on the weather radar, after start-up, a single very bright line appears on the screen.\nThis means that the:",
    "feedback": "scanning of the cathode ray tube is faulty"
  },
  {
    "question": "An aircraft is following a defined RNP 2 route and approaching a waypoint where a track change of 40° is required. The route is part of a route system with 4 parallel routes and reliable lateral separation between the aeroplanes on the different routes is essential.\nWhich of the following types of FMS coding of the waypoint will ensure lateral separation between aircraft also during the turn?",
    "feedback": "Fixed Radius Transition (FRT)"
  },
  {
    "question": "The maximum theoretical range at which an aircraft at FL230 may receive signals from a VOR facility sited at mean sea level is:",
    "feedback": "190 NM"
  },
  {
    "question": "The minimum airborne equipment required for operation of a VHF direction finder is a:",
    "feedback": "VHF transmitter-receiver operating in the 118 MHz to 136 MHz range"
  },
  {
    "question": "With reference to which time scale do the GPS satellites broadcast the PRN codes?",
    "feedback": "SV GPS time"
  },
  {
    "question": "A frequency of airborne weather radar is :",
    "feedback": "9375 MHz"
  },
  {
    "question": "What is different between A/C all call and A/C/S all call?",
    "feedback": "P4 pulse"
  },
  {
    "question": "For any given circumstances, in order to double the effective range of a primary radar the power output must be increased by a factor of:",
    "feedback": "16"
  },
  {
    "question": "The ISO-ECHO facility of an airborne weather radar is provided in order to:",
    "feedback": "detect areas of possible severe turbulence in cloud"
  },
  {
    "question": "The picture shows the control panel of a transponder which can be found onboard many aircraft. What does the shown number (3465) express?",
    "feedback": "A transponder Mode A identificatiokn"
  },
  {
    "question": "Factors liable to affect most NDB/ADF system performance and reliability include:",
    "feedback": "static interference - night effect - absence of failure warning system"
  },
  {
    "question": "The frequency which corresponds to a wavelength of 12 cm is:",
    "feedback": "2500 MHz"
  },
  {
    "question": "According to ICAO Annex 10, in which frequency band(s) does a locator normally transmit?",
    "feedback": "LF/MF"
  },
  {
    "question": "The Automatic Direction Finder uses the following wavelengths:",
    "feedback": "hectometric or kilometric."
  },
  {
    "question": "A Surveillance Radar installation will often consist of",
    "feedback": "A Primary radar and a Secondary Surveillance Radar (SSR)"
  },
  {
    "question": "Refer to diagram # 4. An aircraft is attempting to track 186° M on an airway (10 NM wide), defined by a VOR 80 NM away. The VOR display indicates the aircraft position. With these indications, the aircraft is on the ... radial and ... the airway.",
    "feedback": "001°, outside"
  },
  {
    "question": "Which statement is correct with respect to selections on the transponder control panel?",
    "feedback": "With ALT selected a reply in the modes A, C and S can be transmitted"
  },
  {
    "question": "An error during PBN operations relating to the excecution of a flight along a defined path is a:",
    "feedback": "Flight Technical Error (FTE)"
  },
  {
    "question": "An aircraft is on an ILS approach to runway 23 using an approach plate with the diagram above. As the pilot is approaching 1500 feet, what cockpit light and audio indications is the pilot expecting?",
    "feedback": "A blue light and a continuous series of low-frequency dashes"
  },
  {
    "question": "The wavelength of a radio signal transmitted at the frequency of 3 GHz is:",
    "feedback": "10 cm"
  },
  {
    "question": "An electromagnetic wave consists of an oscillating electric (E) and an oscillating magnetic (H) field. Their propagation speed is:",
    "feedback": "the speed of light"
  },
  {
    "question": "Consider the following circumstances related to ILS operations:\n1) The measured DDM is zero\n2) The absence of the 90 and 150 Hz modulation simultaneously\n3) The cloud base as reported by the ATIS below landing minima\n4) The modulation depth of either the 90 or 150 Hz signal reduced to zero\n\nWhich of the above given circumstances will trigger warning flags for the LLZ and the GP?",
    "feedback": "2, 4"
  },
  {
    "question": "Which of the following statements is correct or incorrect?\n1) A fly-over waypoint is a waypoint where the turn is initiated overhead in order to join the next segment of a route or procedure\n2) A fly-by waypoint is a waypoint that requires turn anticipation to allow tangential interception fo the next segment of a route or procedure",
    "feedback": "1) and 2) are correct"
  },
  {
    "question": "What approaches are possible with MLS without DME-P?",
    "feedback": "Straight-in approaches similar to ILS"
  },
  {
    "question": "The Microwave Landing System (MLS) uses the following wavelengths:",
    "feedback": "centimetric."
  },
  {
    "question": "Navigating to an NDB at dusk, you notice the ADF needle swinging erratically. What may be the reason for this?",
    "feedback": "Interference occurs between the ground wave and sky wave causing the signal to fade when the two waves are out of phase"
  },
  {
    "question": "3D RNAV fixing provides:",
    "feedback": "Horizontal and vertical profile guidance"
  },
  {
    "question": "List the factors used to define area navigation (RNAV) or required navigation performance (RNP) system performance requirements:",
    "feedback": "accuracy, integrity, continuity"
  },
  {
    "question": "The ATC transponder system,excluding Mode S, contains :",
    "feedback": "two modes, each of 4096 codes"
  },
  {
    "question": "RNP AR APCH is used:",
    "feedback": "in the approach phase of flight"
  },
  {
    "question": "You are plotting a chart and use a DME arc. What does the DME arc represent?",
    "feedback": "Slant range"
  },
  {
    "question": "ILS Cat II will permit instrument approaches down to",
    "feedback": "DH 100 ft,  RVR 300 m"
  },
  {
    "question": "The Doppler frequency shift of the received GPS carrier frequency may be used to:",
    "feedback": "calculate the groundspeed of the aircraft"
  },
  {
    "question": "An operator operates multiple of the same type of aircraft. However, some of the aircraft are able to fly to LPV (Localizer Performance with Vertical Guidance) minima while other are not able to do so. The reason for this difference in capability is that the ......",
    "feedback": "FMS requires an additional final approach segment (FAS) data block function to fly LPV minima"
  },
  {
    "question": "The wavelength of a non-directional beacon (NDB) at a frequency of 300 kHz is:",
    "feedback": "1000 metres."
  },
  {
    "question": "The ILS marker with an aural frequency of 3000 Hz is the:",
    "feedback": "inner marker (if available)."
  },
  {
    "question": "The reason why pre take-off holding areas are sometimes further from the active runway when ILS Category 2 and 3 landing procedures are in progress than during good weather operations is:",
    "feedback": "aircraft manoeuvring near the runway may disturb guidance signals"
  },
  {
    "question": "Almanac data stored in the receiver of the satellite navigation system NAVSTAR/GPS is used for the:",
    "feedback": "fast identification of received signals coming from visible satellites"
  },
  {
    "question": "Which statement is correct for homing towards an NDB in an area with constant wind and constant magnetic variation?",
    "feedback": "The Relative Bearing of the NDB should be kept 000°."
  },
  {
    "question": "Which of the following statements concerning differential GPS is true?",
    "feedback": "DGPS can improve the accuracy of position information"
  },
  {
    "question": "Outer marker transmits on 75 MHz and is modulated by an aural frequency of:",
    "feedback": "400 Hz"
  },
  {
    "question": "What is the approximate speed of a radio wave?",
    "feedback": "162000 NM/s"
  },
  {
    "question": "Which interception do you choose with a difference of angle of 15° and an EET of 4 minutes?",
    "feedback": "45° Interception"
  },
  {
    "question": "Which statement about the range of VHF waves is correct?",
    "feedback": "It depends on the altitude of the aircraft and the elevation of the ground antenna"
  },
  {
    "question": "LF (low frequency) waves appear in the frequency spectrum:",
    "feedback": "30 kHz - 300 kHz"
  },
  {
    "question": "A dipole antenna in its simplest form, suited for a frequency of 110 MHz, ought to have a length of:",
    "feedback": "136 cm"
  },
  {
    "question": "What is (one of) the differences between a mode A/C/S all call and a mode A/C only all call?",
    "feedback": "The length of the pulse P4"
  },
  {
    "question": "Given a wire fed with alternating current and a second wire parallel to, but remote from it. The result will be:",
    "feedback": "the first wire will radiate electro-magnetic waves into space and alternating current will be induced in the second wire"
  },
  {
    "question": "A locator beacon differs from an NDB with respect to: \n\n1) operational use \n2) transmission power \n3) presentation in the cockpit \n4) frequency band. \n\nFrom the above stated differences the following numbers are correct:",
    "feedback": "1 and 2"
  },
  {
    "question": "Which of the following systems is a Global Navigation Satellite System (GNSS)?",
    "feedback": "BeiDou"
  },
  {
    "question": "What is the reason that a DME station can generally respond to a maximum of 100 aircraft?",
    "feedback": "The number of reply pulse pairs per second that a DME transponder can transmit is limited to a certain maximum value"
  },
  {
    "question": "The phenomenon of a change in direction of an EM wave occuring due to a change in its speed is called:",
    "feedback": "refraction"
  },
  {
    "question": "In general the operation of airborne weather radar equipment on the ground is:",
    "feedback": "only permitted with certain precautions, to safeguard health of personnel and to protect equipment"
  },
  {
    "question": "A GBAS signal is sent to:",
    "feedback": "a receiver which is located in the aircraft and modifies horizontal and vertical guidance corrections"
  },
  {
    "question": "The reference and the variable modulation signals from a VOR",
    "feedback": "Are both at 30 Hz, one frequency modulated and the other amplitude modulated"
  },
  {
    "question": "During an ILS approach to runway 19, the pilot wants to know the distance from the outer marker to the runway. The distance is .....",
    "feedback": "5.4 NM"
  },
  {
    "question": "An aircraft passes overhead a DME station at 12000 feet above the station. At that time, the DME reading will be:",
    "feedback": "approximately 2 NM"
  },
  {
    "question": "act QDM 210°\nact HDG 060°\nreq QDM 260°\nFirst turn?",
    "feedback": "right HDG 170°"
  },
  {
    "question": "An aircraft is being flown under the specifications of RNP, using a suitable area navigation system. At the start of the approach phase of the flight, the RNP specifications might change from ......",
    "feedback": "RNP 1 to RNP APCH"
  },
  {
    "question": "A Doppler shift will occur",
    "feedback": "All 3 answers are correct"
  },
  {
    "question": "By which of the following flight deck equipment are the waypoints inserted into an FMS RNAV system by the pilot?",
    "feedback": "Control Display Unit"
  },
  {
    "question": "In the MAPPING MODE the airborne weather radar utilises a:",
    "feedback": "fan shaped beam effective up to a maximum of 50 NM to 60 NM range"
  },
  {
    "question": "Refer to diagram # 1. The indication was obtained when the aircraft was at a range of 50 NM from the VOR. Assuming that the VOR is correctly set-up, the radial and horizontal distance the aircraft is off track are:",
    "feedback": "089 radial and 3,3 NM right of track."
  },
  {
    "question": "The D-layer and E-layer of the atmosphere are part of the:",
    "feedback": "ionosphere"
  },
  {
    "question": "In a hybrid navigation system",
    "feedback": "Data from two or more of sources is electronically compared and the best information is used"
  },
  {
    "question": "What are the risks when using an airborne weather radar (AWR) in MAP mode over polar regions?",
    "feedback": "The ice offshore lines may be mistaken for the real coast lines."
  },
  {
    "question": "A VOR indication of 240° \"FROM\" is given. Variation at the aircraft's position is 9°W and at the VOR 7°W. The heading to reach the station in nil wind conditions is:",
    "feedback": "053° T"
  },
  {
    "question": "The term \"phase difference\" can be defined as:",
    "feedback": "the angular difference between the corresponding points of two cycles of equal wavelength, which is measurable in degrees"
  },
  {
    "question": "The DME reading is 100 NM (DME installed before 1989). The error of the DME reading shall, according to ICAO Annex 10, not exceed:",
    "feedback": "1.5 NM"
  },
  {
    "question": "Selection of WX+T mode on rotary switch 3 will help to detect and display areas of ....",
    "feedback": "turbulence within precipitation by detecting the Doppler shift of reflected radio signal"
  },
  {
    "question": "Which statement about Satellite Based Augmentation Systems (SBAS) is correct?",
    "feedback": "The use of SBAS improves both the accuracy and the integrity of the position of the user"
  },
  {
    "question": "Minimum useful range of a primary radar requires",
    "feedback": "Short pulses"
  },
  {
    "question": "Which of the figures depicts an Electronic Flight Instrument System (EFIS) display in PLAN mode?",
    "feedback": "Figure 4"
  },
  {
    "question": "Ignoring pulse length, the maximum pulse repetition frequency  (PRF) that can be used by a primary radar facility to detect targets  unambiguously to a range of 200 NM is: (pps = pulses per second)",
    "feedback": "405 pps"
  },
  {
    "question": "The satellites used in the GPS",
    "feedback": "Orbit the Earth at an altitude of about 20 200 km"
  },
  {
    "question": "What datum is used for the Minimum Descent Altitude (MDA) on a non-precision approach when using the NAVSTAR/GPS satellite navigation system?",
    "feedback": "Barometric altitude"
  },
  {
    "question": "In order to give the flight crew control of the required lateral guidance functions, the RNAV equipment should be able to perform several of functions.  Which of the following is such a function?",
    "feedback": "all of the above"
  },
  {
    "question": "How can an airborne SSR transponder differentiate a mode A from a mode C interrogation?",
    "feedback": "By a pulse spacing between the P1 and P3 pulse of 8μsec for a mode A and 21μsec for a mode C interrogation"
  },
  {
    "question": "Which of the following options can be used for an entry into a holding pattern based on a VORDME fix?",
    "feedback": "The DME arc defining the fix"
  },
  {
    "question": "Airborne weather radar systems use a wavelength of approximately 3 cm in order to:",
    "feedback": "detect the larger water droplets"
  },
  {
    "question": "On a primary radar system, identify which component(s) is/are rotating:",
    "feedback": "Both"
  }
]